[{"author": "notblackmachete", "body": "Nah it’s Pennsylvania. We do actually have a decently large Hispanic population here, so it’s kinda funny that they messed it up that bad", "created_utc": "1666924845.0", "edited": "False", "id": "iu2oy10", "is_submitter": "True", "link_id": "t3_yefyp7", "parent_id": "t1_iu2mxy0", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "Dokładnie. I w mojej opinii angielski też się nie nadaje do seksu. Dlatego się uczę hiszpańskiego, który jest język pewnie najbardziej przydatny do takich spraw lol", "created_utc": "1666905015.0", "edited": "False", "id": "iu1h27h", "is_submitter": "False", "link_id": "t3_yev3za", "parent_id": "t1_iu06s41", "score": "4", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "notblackmachete", "body": "Scientist-practitioner", "created_utc": "1666901365.0", "edited": "False", "id": "iu17m51", "is_submitter": "False", "link_id": "t3_yewfr2", "parent_id": "t1_iu12ff6", "score": "1", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "I’m taking 5 classes atm. Classes only meet once a week. Some just involve papers and presentations, some have exams. But some of them are much more practically oriented. And I actually do care about these. For example, I’m taking an IQ testing class which involves practicing administering the WISC and WAIS as well as report writing. These are obviously important skills so I do put effort into this. My other class like this is basically an intro to clinical work. We focus on developing basic interviewing skills for next semester when we will be interacting with real patients. Again, this is important.\n\nI also have a stats class which I really like. But I’m also taking a cognitive psych class which I just could not care less about. And we also have an adult psychopathology class which is pretty meh. Like I know almost everything we are covering in it from undergrad.\n\nIn terms of readings, each class gives you like 60-100 pages of reading a week which is impossible to do so you kind of gotta skim or just not do the ones you can get away with not doing.", "created_utc": "1666898658.0", "edited": "False", "id": "iu10lvq", "is_submitter": "False", "link_id": "t3_yewfr2", "parent_id": "t1_iu0zx8s", "score": "1", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "I’m a first year student, and so far it has actually been much easier than undergrad. I’m just doing classes and research at this point, and once you get to grad school you really don’t need to care as much about getting As in your classes as in undergrad. Research is fun for me so I put all of my effort into that. I actually give very little shits about my coursework lol. I do the bare minimum for my classes bc they TRULY do not matter as much as research and clinical work. Being a grad student is all about learning where to focus your efforts and where not to. You cannot do everything perfectly, so you gotta let some things slide. THIS DOES NOT APPLY TO YOUR CLINICAL WORK. You are responsible for the well-being of your clients so there is no excuse for slacking.\n\nI know that in the second year clinical responsibilities pick up and shit really hits the fan in terms of workload. Classes, research, clinical work, and applying for externships. That goes on up until you graduate pretty much.\n\nEdit: I want to clarify what I mean about not caring about my coursework. In undergrad, I just NEEDED to get As. Like all that mattered was the grade. Now, I can actually get a B and it really doesn’t matter. I focus on getting what I need out of my classes. If I feel like my classes are somewhat irrelevant to my goals, I simply put less effort into them. And such classes are common for APA-accredited programs because APA has some dumbass course requirements for PhD classes. Like I’m taking a pure cognitive psych class this semester and I cannot give two shits about cognitive psych insofar as it is detached from clinical work. But I am taking a stats class which I absolutely love. I’m a bit of a stats nerd so I go hard for this class.", "created_utc": "1666897228.0", "edited": "1666898966.0", "id": "iu0wzy2", "is_submitter": "False", "link_id": "t3_yewfr2", "parent_id": "t3_yewfr2", "score": "1", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "Agreed. You cannot at this time win any sort of election if you’re out there talking about real socialism. The Overton window simply has not moved that far left and likely won’t for a while.\n\nFascists know this for their side, although open fascist rhetoric has increased a lot recently. But they still don’t go out there talking about how they want to murder black people yknow. Same applies for progressives like Bernie and AOC", "created_utc": "1666896389.0", "edited": "False", "id": "iu0utsk", "is_submitter": "False", "link_id": "t3_yeh9vr", "parent_id": "t1_iu0oc9l", "score": "10", "subreddit": "swoletariat", "subreddit_id": "t5_35qx1"}, {"author": "notblackmachete", "body": "Doucette is a clown. He loves attacking fat people for no reason", "created_utc": "1666896257.0", "edited": "False", "id": "iu0uhii", "is_submitter": "False", "link_id": "t3_yeh9vr", "parent_id": "t1_iu0lhuq", "score": "27", "subreddit": "swoletariat", "subreddit_id": "t5_35qx1"}, {"author": "notblackmachete", "body": "Jeff is great. One of the few, if only, fitness creators I’ve seen criticize fatphobia", "created_utc": "1666896189.0", "edited": "False", "id": "iu0ub85", "is_submitter": "False", "link_id": "t3_yeh9vr", "parent_id": "t3_yeh9vr", "score": "27", "subreddit": "swoletariat", "subreddit_id": "t5_35qx1"}, {"author": "notblackmachete", "body": "What do you think about the medical system? I know there’s a shortage of doctors in Poland and the wait times for specialists can last years. That’s one of the biggest reasons I’d be afraid to live there even though I have polish citizenship and can move there whenever I want", "created_utc": "1666889169.0", "edited": "False", "id": "iu0c2bl", "is_submitter": "False", "link_id": "t3_yeosd0", "parent_id": "t1_iu0blqb", "score": "5", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "I agree if we are talking about American suburbs. I just don’t find American cities to be great either.", "created_utc": "1666882967.0", "edited": "False", "id": "itzw6n3", "is_submitter": "False", "link_id": "t3_yefh8o", "parent_id": "t1_itztm7o", "score": "1", "subreddit": "AskNYC", "subreddit_id": "t5_2uqch"}, {"author": "notblackmachete", "body": "I just moved here for school, and nothing has yet convinced me that I wanna stay after I graduate lol. I like it, but doesn’t seem like a reasonable place to settle down with a family especially given the costs. Living in an apartment with a family for the rest of my life seems fucked up", "created_utc": "1666875802.0", "edited": "False", "id": "itzfdtg", "is_submitter": "False", "link_id": "t3_yefh8o", "parent_id": "t3_yefh8o", "score": "1", "subreddit": "AskNYC", "subreddit_id": "t5_2uqch"}, {"author": "notblackmachete", "body": "I think it’s morally neutral up until about the 3rd trimester. I seriously don’t think anyone can make an ethically sound argument for abortions past a certain point.", "created_utc": "1666875350.0", "edited": "False", "id": "itzegg4", "is_submitter": "False", "link_id": "t3_ye2one", "parent_id": "t3_ye2one", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I respect it, but if I was on his campaign team I would not have let him do it. There was nothing to gain from doing that debate. Nonetheless, I am a Pennsylvanian and I still gladly marked him on my mail-in ballot yesterday.", "created_utc": "1666875093.0", "edited": "False", "id": "itzdxpg", "is_submitter": "False", "link_id": "t3_yeartz", "parent_id": "t3_yeartz", "score": "4", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I unironically think that people who use neopronouns are more concerned with, more obsessed with, and more affected by gender than the average person.\n\nAlso, when it comes to battling gender as a construct, pronouns are by far the least important thing. So feeling the need to use some insane words as your pronouns almost seems to me as if you don’t actually care about focusing on what matters. What matters to me is increasing the range of acceptable gendered expression. Changing your pronouns to xe/xem does nothing towards that end.", "created_utc": "1666802824.0", "edited": "False", "id": "itvioew", "is_submitter": "False", "link_id": "t3_ydzpyq", "parent_id": "t3_ydzpyq", "score": "15", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I get what you’re saying. But for an average person it’s irrelevant. I do data analysis, but I would never walk up to an average person and say that I used principle component analysis or hierarchical linear regression to get my results.", "created_utc": "1666790474.0", "edited": "False", "id": "ituokpe", "is_submitter": "False", "link_id": "t3_ydvt8z", "parent_id": "t1_ituo0ik", "score": "-6", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "That’s different. Imagine if you said “I like to watch videos on YouTube” and I replied to you “you should actually say that you enjoy viewing the output from a complex set of coding that is being processed by your computer and being supported by internet connection” \nLike no one cares.", "created_utc": "1666789968.0", "edited": "False", "id": "itunih8", "is_submitter": "False", "link_id": "t3_ydvt8z", "parent_id": "t1_itum9d7", "score": "-3", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "Strongly disagree. No reason you can’t take your shoes off on a 9 hour flight. I mean, maybe you’re the type of person who keeps their shoes on inside their own home lmfao.", "created_utc": "1666789647.0", "edited": "False", "id": "itumuq1", "is_submitter": "False", "link_id": "t3_ydbsqs", "parent_id": "t1_its9tgu", "score": "2", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "notblackmachete", "body": "Most people do not care about the specifics of how such images are generated", "created_utc": "1666789253.0", "edited": "False", "id": "itum215", "is_submitter": "False", "link_id": "t3_ydvt8z", "parent_id": "t1_itul647", "score": "9", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "Possibly. If you’re the head of a psych department at a university you definitely can. Idk about other avenues though.", "created_utc": "1666754019.0", "edited": "False", "id": "itt8816", "is_submitter": "False", "link_id": "t3_ydkmnf", "parent_id": "t3_ydkmnf", "score": "-1", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "Wdym this is based", "created_utc": "1666750186.0", "edited": "False", "id": "itt0l7g", "is_submitter": "False", "link_id": "t3_yddf3w", "parent_id": "t3_yddf3w", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m also a PhD student and I think 6/10 people in my cohort are into astrology. I don’t think they take it super serious but it’s a little jarring to me that it’s even being discussed.", "created_utc": "1666738887.0", "edited": "False", "id": "itsbvjw", "is_submitter": "False", "link_id": "t3_ycv6pk", "parent_id": "t3_ycv6pk", "score": "4", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "I’m not being rude lol. I’m telling you that the person who commented is messing with you", "created_utc": "1666731854.0", "edited": "False", "id": "itrvedb", "is_submitter": "False", "link_id": "t3_yddvpw", "parent_id": "t1_itrv20n", "score": "2", "subreddit": "tortoise", "subreddit_id": "t5_2sd1c"}, {"author": "notblackmachete", "body": "Hermaphrodite means both male and female. The commenter is fucking with you lol", "created_utc": "1666730280.0", "edited": "False", "id": "itrra74", "is_submitter": "False", "link_id": "t3_yddvpw", "parent_id": "t1_itrm2md", "score": "2", "subreddit": "tortoise", "subreddit_id": "t5_2sd1c"}, {"author": "notblackmachete", "body": "You’re being downvoted because the interviewer clearly was giving the floor to Ayola to give an example of how to respond to accusations of wokeness. The interviewer is on Ayola’s side.", "created_utc": "1666725498.0", "edited": "False", "id": "itrenf4", "is_submitter": "False", "link_id": "t3_ycyrj4", "parent_id": "t1_itq3iu8", "score": "12", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "Uh. Clearly you’re a moral relativist. I actually do think my ethical system should apply to the whole world thank you very much.\n\nIf they raped babies in Russia on the regular and they thought it was cool would you not condemn that. And you can say that there’s a big difference between raping babies and having fucking dab pen in Russia. but you literally said that we have no right to judge other countries so let’s see how you weasel out of that", "created_utc": "1666713722.0", "edited": "1666714118.0", "id": "itqk3n7", "is_submitter": "False", "link_id": "t3_yd4p4p", "parent_id": "t1_itq6ypq", "score": "1", "subreddit": "sports", "subreddit_id": "t5_2qgzy"}, {"author": "notblackmachete", "body": "I don’t think that about art deco. I said that architectural styles can be loved for their artistic qualities. \n\nAnd maybe modern structures won’t last but people might still look back at them favorably", "created_utc": "1666702279.0", "edited": "False", "id": "itpsyzl", "is_submitter": "False", "link_id": "t3_ycnwf1", "parent_id": "t1_itp8e7d", "score": "4", "subreddit": "UrbanHell", "subreddit_id": "t5_2yokk"}, {"author": "notblackmachete", "body": "I agree until I’m three beers deep", "created_utc": "1666668643.0", "edited": "False", "id": "itohfjj", "is_submitter": "False", "link_id": "t3_yct1e9", "parent_id": "t3_yct1e9", "score": "22", "subreddit": "cocaine", "subreddit_id": "t5_2qu9w"}, {"author": "notblackmachete", "body": "That’s definitely pretty solid. It might be less efficient than highly motivated self-study though? Obviously there’s so much variation between individuals. \n\nI’m guessing one of the big advantages of college Spanish courses would be the ultra-structured approach to grammar. Of course that’s not everyone’s preferred learning style and it might be a bit annoying, but you’ll really have the grammar down by the time you graduate.", "created_utc": "1666668522.0", "edited": "False", "id": "itoh6z1", "is_submitter": "True", "link_id": "t3_ycu24q", "parent_id": "t1_itoex9b", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "I see this in two ways. First, there are definitely artistic criticisms you can make regarding any architectural styles. \n\nAt the same time, it could be one of those “the grass is greener on the other side” and historical nostalgia types of biases. I bet throughout every point in history there have been people who hate on the current architectural style. 100-200 years from now people will be looking at contemporary architecture and soying over it. “Midnight in Paris” is a good film that explores this topic", "created_utc": "1666668112.0", "edited": "False", "id": "itogdqd", "is_submitter": "False", "link_id": "t3_ycnwf1", "parent_id": "t3_ycnwf1", "score": "15", "subreddit": "UrbanHell", "subreddit_id": "t5_2yokk"}, {"author": "notblackmachete", "body": "Rock", "created_utc": "1666667055.0", "edited": "False", "id": "itoe6ru", "is_submitter": "False", "link_id": "t3_ycm9rz", "parent_id": "t3_ycm9rz", "score": "4", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "That’s great. And I think you could be a good example of what guys should be doing. Im kinda just referring to a stereotype which could definitely be a dumb place to start from.", "created_utc": "1666666848.0", "edited": "False", "id": "itodrdz", "is_submitter": "False", "link_id": "t3_yceu6y", "parent_id": "t1_itodik0", "score": "-3", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "To your first point. Yeah these are just my observations.\n\nFor your second point you literally reworded what I said lmao I agree", "created_utc": "1666665391.0", "edited": "False", "id": "itoapdo", "is_submitter": "False", "link_id": "t3_yceu6y", "parent_id": "t1_ito9cp8", "score": "7", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "If you think of many who self-define themselves as “male feminists” or “soft boys,” their whole personality is based off of their opposition to “be masculine” and to “not be like other guys.” By doing so, I believe they fail to find any self-definition aside from one rooted in a withdrawal away from something (i.e. a negative identity). I believe that identity should be based in a movement towards a certain set of characteristics. Identity that is centered around withdrawal is self-hating imo. Withdrawal away from something can be fine so long as there is a simultaneous approach towards something more positive.\n\nI feel like this is a little abstract. What I mean is defining yourself as “not this” or “not that” is unproductive and self-damaging", "created_utc": "1666661166.0", "edited": "False", "id": "ito16tl", "is_submitter": "False", "link_id": "t3_yceu6y", "parent_id": "t1_itnzmv4", "score": "-1", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "That was hot", "created_utc": "1666659152.0", "edited": "False", "id": "itnwe4v", "is_submitter": "False", "link_id": "t3_ycquxe", "parent_id": "t3_ycquxe", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I kind of agree in the sense that the left does a terrible job providing positive alternatives to toxic masculinity. There’s only talk about what masculinity shouldn’t be, but never about what it should be. So what you get is these men on the left who are self-hating, and they think that this self-hate is what it means to be a good man.\n\nAnd then comes the right with terrible and dangerous solutions. But what the right says works to get men over to their side  because masculinity is framed in a positive light. The left basically makes lonely ass men feel even shittier, and the right makes lonely ass men feel shittier but through the illusion that things will get better only if they start to hate women, for example", "created_utc": "1666658685.0", "edited": "False", "id": "itnvaq8", "is_submitter": "False", "link_id": "t3_yceu6y", "parent_id": "t1_itni6zw", "score": "6", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "Winsorize your data.\n\nOr bootstrap that shit.\n\nOr do both", "created_utc": "1666653700.0", "edited": "1666653915.0", "id": "itnk5xm", "is_submitter": "False", "link_id": "t3_yceire", "parent_id": "t3_yceire", "score": "2", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "Is he saying there’s a difference between depression and melancholy? Does he not realize that melancholy was the former term used to describe depression? Literally to describe the same set of symptoms", "created_utc": "1666653560.0", "edited": "False", "id": "itnjuuu", "is_submitter": "False", "link_id": "t3_yciknv", "parent_id": "t3_yciknv", "score": "-1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Że jest żabka co 5 metrów", "created_utc": "1666631327.0", "edited": "False", "id": "itm0c1i", "is_submitter": "False", "link_id": "t3_ycaj9l", "parent_id": "t3_ycaj9l", "score": "3", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "notblackmachete", "body": "Maybe compare and contrast good video essayists like contra and loner to shit ones like muel or Noah samsen. \n\nAlso, I’ve never watched thought slime or noncompete besides Vaush’s coverage of them. But I’ve heard they have made very good videos before. Maybe it would be useful to cover how these people have good points but fuck it up for the online left by being absolute cucks", "created_utc": "1666631233.0", "edited": "False", "id": "itm036j", "is_submitter": "False", "link_id": "t3_ycddwv", "parent_id": "t3_ycddwv", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yo estoy aprendiendo español y creo que el acento y dialecto borinqueño son muy chevere. Es un acento muy difícil entender para los estudiantes de español. Yo puedo entender español mexicano fácilmente pero no puedo entender PR español para nada. Por eso creo que no es algo de lo que avergonzarse sino algo de lo que estar orgulloso!\n\nEdit: es decir que yo tengo una gran admiración por PR español y me gustaría mucho entender PR español y hablar en esa manera. Yo siempre digo, el día que yo pueda entender PR español fácilmente será el día que haya dominado el idioma lol. En verdad yo creo que muchos estudiantes de español piensan así y que solo otros hispanohablantes son tan “gatekeepy”", "created_utc": "1666626832.0", "edited": "1666629883.0", "id": "itlov3i", "is_submitter": "False", "link_id": "t3_ybzfys", "parent_id": "t1_itjvll7", "score": "3", "subreddit": "PuertoRico", "subreddit_id": "t5_2qjyb"}, {"author": "notblackmachete", "body": "This is super interesting. I can’t imagine the cope and mental gymnastics nazis would go through if they saw that the top ten most ethnically diverse countries are in Africa.\n\n“bUT tHeY’rE aLl bLaCK”", "created_utc": "1666611731.0", "edited": "False", "id": "itksham", "is_submitter": "False", "link_id": "t3_yc78mx", "parent_id": "t1_itklwsv", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I think a lot of people use they/them pronouns for attention and to be contrarian", "created_utc": "1666582470.0", "edited": "False", "id": "itjpr4k", "is_submitter": "False", "link_id": "t3_ybwdx0", "parent_id": "t3_ybwdx0", "score": "13", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "And driving a vehicle tbh", "created_utc": "1666574917.0", "edited": "False", "id": "itja2ms", "is_submitter": "False", "link_id": "t3_ybutn1", "parent_id": "t1_itj81hg", "score": "17", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Being either openly or covertly (like through dog whistles) anti-democratic should disqualify you from being able to run for office. The paradox of democracy 🤷‍♂️\n\nAlso, ban cars in cities. City residents can have cars, but they gonna be parking those shits in designated parking garages and they can’t drive them around the city.", "created_utc": "1666574844.0", "edited": "1666575095.0", "id": "itj9x46", "is_submitter": "False", "link_id": "t3_ybutn1", "parent_id": "t3_ybutn1", "score": "22", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yes very normal. Thank god too. Makes cleanup easy", "created_utc": "1666566590.0", "edited": "False", "id": "itis2b8", "is_submitter": "False", "link_id": "t3_ybv7jx", "parent_id": "t3_ybv7jx", "score": "19", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Least horny Vaushite", "created_utc": "1666494883.0", "edited": "False", "id": "itexujl", "is_submitter": "False", "link_id": "t3_yb3gj3", "parent_id": "t3_yb3gj3", "score": "17", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Well good thing trans men meet most of the criteria that makes you a man. Biologically, they have a shit ton of T. Socially, they act, speak, walk, and generally behave like men.", "created_utc": "1666480276.0", "edited": "False", "id": "ite3uzk", "is_submitter": "False", "link_id": "t3_y9xg59", "parent_id": "t1_itdwfnt", "score": "1", "subreddit": "greentext", "subreddit_id": "t5_2srr9"}, {"author": "notblackmachete", "body": "You already speak Spanish tho. For a learner it’s a completely different story. \n\nMany people who learn English as a second language and do so in America struggle to understand accents from the British Isles.", "created_utc": "1666471474.0", "edited": "False", "id": "itdk6a0", "is_submitter": "False", "link_id": "t3_yaw2tf", "parent_id": "t3_yaw2tf", "score": "12", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "When you use “cuando” and are referring to the near future or a hypothetical future, you use the subjunctive. \n\nExamples\n1. “Cuando compres el pan, tráemelo” \n-here, the person hasn’t bought the bread yet. A situation like this requires the subjunctive. \n\n2. “Cuando compras el pan, siempre me lo traes”\n-here, we are talking about an action that regularly occurs (the buying of the bread). So we use the indicative. It is not an action that is hypothetical in nature. \n\nI hope that makes sense", "created_utc": "1666471197.0", "edited": "False", "id": "itdjijk", "is_submitter": "False", "link_id": "t3_yavrp4", "parent_id": "t3_yavrp4", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "Tier lists don’t apply to drain projects bc they’re all S tier", "created_utc": "1666461124.0", "edited": "False", "id": "itcv6zm", "is_submitter": "False", "link_id": "t3_yasgry", "parent_id": "t3_yasgry", "score": "6", "subreddit": "Draingang", "subreddit_id": "t5_39igo"}, {"author": "notblackmachete", "body": "Centering his zoophilia minimizes that he’s also a pedophile and a racist and transphobe and a colonizer", "created_utc": "1666460374.0", "edited": "False", "id": "itctcwf", "is_submitter": "False", "link_id": "t3_yasyz3", "parent_id": "t3_yasyz3", "score": "8", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I was in Szczecin Poland this summer which is a harbor city, and I was really surprised to see many Filipinos. I asked my grandparents what they were doing there (because Szczecin isn’t a very touristy city and there are not a lot of POC in Poland in general) and they said they’re sailors. One of them actually tried to flirt with my partner while I was in the bathroom lmfao", "created_utc": "1666459348.0", "edited": "False", "id": "itcqu0v", "is_submitter": "False", "link_id": "t3_yaonxj", "parent_id": "t1_itc8bz5", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "notblackmachete", "body": "The only thing to add to make this more effective is him not saying that republicans are attacking “me” but they are attacking “you, the American people.” Democrats need to capitalize on how republicans openly hate the average American", "created_utc": "1666456679.0", "edited": "False", "id": "itckbza", "is_submitter": "False", "link_id": "t3_yammqs", "parent_id": "t3_yammqs", "score": "2", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "notblackmachete", "body": "Giving preferential treatment to historically oppressed groups isn’t racism when it comes to things like college admissions.", "created_utc": "1666449934.0", "edited": "False", "id": "itc4o3z", "is_submitter": "False", "link_id": "t3_yam9b4", "parent_id": "t1_itbwa03", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "People who have a public voice. Trump would be a good example. But really any conservative politician.\n\nThe average conservative voter really is cucked. Their fears of minorities are so easily exploited. All the while they are completely blind to how the people they vote for do not advance their material conditions whatsoever. Like I think at this point a conservative leader could outright say “yeah we have no plan about how to help you as a working class American, but we do have a plan about how to stop trans groomers from raping your children.” And they would soy over this statement", "created_utc": "1666416966.0", "edited": "False", "id": "itath5f", "is_submitter": "False", "link_id": "t3_y9xef4", "parent_id": "t1_it80wga", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "There should be a choice for before Vaush was born. The existence of this pedophilic racist liberal zoophile has resulted in an overall worsening of not only the online left but of the the world in general.", "created_utc": "1666416663.0", "edited": "False", "id": "itat2a5", "is_submitter": "False", "link_id": "t3_y9zrxs", "parent_id": "t3_y9zrxs", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m sorry I was mean. \n\nYou can be born intersex without a penis yet retain other male sexual characteristics, you can be a court eunuch (a servant of nobility who got their dicks chopped off), you could have gotten your dick removed because of cancer, you could’ve gotten your dick chopped off as torture or punishment for whatever. The list is really endless.", "created_utc": "1666416410.0", "edited": "False", "id": "itaspan", "is_submitter": "False", "link_id": "t3_y9xg59", "parent_id": "t1_itas1pz", "score": "1", "subreddit": "greentext", "subreddit_id": "t5_2srr9"}, {"author": "notblackmachete", "body": "I am not a vegan, but I do think given the current state of affairs regarding how we farm meat and the consequences (e.g. environment, antibiotic resistance, etc.) it is more ethical to be a vegan. I think there is a way to consume meat ethically, but the way we do it right now is far from meeting that ideal.\n\nI wish there were less barriers to being vegan. First of all, if you want a well balanced diet as a vegan you need to cook like absolute crazy. You need to cook a lot because vegan food is not ubiquitous for you to order whenever you need, and the food that you can order that is vegan is often absolute trash. Cooking is so fun, but it’s unrealistic to expect people to prepare all that food themselves. \n\nYou can buy premade vegan food (which is super good actually), but it costs 50000 dollars for a bag of frozen vegan tendies. \n\nAlso, if you’re into fitness and more specifically weight training, you need to eat an absurd quantity of food to meet protein and calorie goals. And this costs a fuck ton of time and effort.", "created_utc": "1666416160.0", "edited": "False", "id": "itascya", "is_submitter": "False", "link_id": "t3_ya5y9d", "parent_id": "t3_ya5y9d", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Didn’t watch the video but idk why this is so hard for everyone.\n\nSocialism = power directly in the hands of the workers\n\nIf the workers don’t have the power, it’s not socialism. Simple as. USSR for this reason clearly was not socialist", "created_utc": "1666414919.0", "edited": "False", "id": "itaqm06", "is_submitter": "False", "link_id": "t3_yadqxu", "parent_id": "t3_yadqxu", "score": "10", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yeah a list like that would be irrelevant! That’s kinda the point. \n\nDo you think humans 500 years ago knew shit about the biology behind sexual dimorphism? If they thought like you do, then their only physical indicator to go off of would have been whether you have a dick or not plus some secondary sexual characteristics like facial hair and shit. But then men without dicks or men who couldn’t grow facial hair wouldn’t be men. And I think it’s safe to say that our ancestors didn’t genuinely think of cockless men as women or some shit. \n\nThe question for you then is why do we consider men to be men if they don’t meet certain arbitrary criteria? For me, the answer is simply because what we think of as “man” is not a biological reality but a social one. For this reason, someone who doesn’t have a dick or has low T can still be a man, so long as they subscribe to the social category of man.", "created_utc": "1666413139.0", "edited": "False", "id": "itanxwx", "is_submitter": "False", "link_id": "t3_y9xg59", "parent_id": "t1_italiin", "score": "1", "subreddit": "greentext", "subreddit_id": "t5_2srr9"}, {"author": "notblackmachete", "body": "You should list all of the biological factors that would make someone a man. \n\nFirst of all, you can’t. Second of all, even if you did make a list, not all men would meet the criteria of the list. Third of all, if I made such a list, whining about trans men not being men would disqualify you from being a man", "created_utc": "1666405542.0", "edited": "False", "id": "itaanf4", "is_submitter": "False", "link_id": "t3_y9xg59", "parent_id": "t1_it9euzs", "score": "4", "subreddit": "greentext", "subreddit_id": "t5_2srr9"}, {"author": "notblackmachete", "body": "Based", "created_utc": "1666383839.0", "edited": "False", "id": "it8zlp5", "is_submitter": "False", "link_id": "t3_y9ua7p", "parent_id": "t3_y9ua7p", "score": "6", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "I have no experience with French so this might be a dumb take. I’m basing this off of what I’ve heard from others. \n\nSo i would guess French because of the gap between how you learn French and how French is spoken. For those familiar with Spanish, it would be like if all Spanish was spoken with a Caribbean accent - no one ever teaches you Spanish in Caribbean Spanish. I mention Caribbean Spanish because it’s an example of real-world Spanish that is very different from taught Spanish.\n\nBut in general, taught Spanish is more similar to real-world Spanish than taught French is to real-world French", "created_utc": "1666372338.0", "edited": "1666372647.0", "id": "it86z55", "is_submitter": "False", "link_id": "t3_y9g6af", "parent_id": "t3_y9g6af", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "notblackmachete", "body": "I’m polish and I can really only understand Czech if I’m watching a video of someone speaking Czech with subtitles. Even then it’s kind of a guessing game. Like I can understand about 50%.\n\nIt’s important to note that I’m a native speaker of polish but I was born and raised in the US, so my polish is kind of at a child’s level even though I’m fluent", "created_utc": "1666369871.0", "edited": "False", "id": "it80ssk", "is_submitter": "False", "link_id": "t3_y9a9y0", "parent_id": "t3_y9a9y0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "notblackmachete", "body": "What system? There’s always going to be children who have special needs, and we must have tools that we use to identify those needs", "created_utc": "1666367279.0", "edited": "False", "id": "it7ua9v", "is_submitter": "False", "link_id": "t3_y9ihpo", "parent_id": "t1_it7tv2f", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "They do matter. If a child is struggling in school, yet their IQ is average, that means they are likely underachieving for some reason. Interventions can be designed thus to correct the underachievement. \n\nIQ tests are also useful at identifying gifted children and not having them waste their time in regular classes. \n\nIQ tests are also useful for identifying when someone might have a severe intellectual disability, and getting them the necessary accommodations in school. \n\nIQ tests are basically the foundation of school psychology, and without them many kids would be severely fucked over.", "created_utc": "1666363347.0", "edited": "False", "id": "it7khjc", "is_submitter": "False", "link_id": "t3_y9ihpo", "parent_id": "t1_it7k0g9", "score": "10", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Actually I’m really bad at the dumb little puzzles. I’ve had a real IQ test done on me and my visuospatial skills are pretty average. \n\nBut no. I’m a clinical psychology doctoral student currently taking a class on IQ testing. So I kind of know the deal with these things", "created_utc": "1666363056.0", "edited": "False", "id": "it7js5c", "is_submitter": "False", "link_id": "t3_y9ihpo", "parent_id": "t1_it7jhdr", "score": "14", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yes and no. The point of all psychometric tests is to have what is known as construct validity. Construct validity means that the test is actually measuring what it says it wants to measure. The best way to assess this is whether performance on the test correlates with external measures of the construct in question. \n\nIQ tests are an attempt to get at certain things like verbal and nonverbal intelligence. There are various IQ tests that have been revised countless times. With more and more revisions, we see that the utility of these tests increases. This suggests that they are actually becoming somewhat more valid, and are measuring something beyond literal performance on the test itself.", "created_utc": "1666362966.0", "edited": "False", "id": "it7jkb8", "is_submitter": "False", "link_id": "t3_y9ihpo", "parent_id": "t1_it78zjl", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yeah it is. But IQ tests have a ton of clinical utility as well. The results of these tests are just misunderstood and abused by race realists", "created_utc": "1666362742.0", "edited": "False", "id": "it7j0v6", "is_submitter": "False", "link_id": "t3_y9ihpo", "parent_id": "t1_it74tm2", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "You say “modern IQ tests” as if older ones were more valid, which is very untrue. Modern IQ tests are much better at getting at the constructs they intend to measure than older tests, which were extremely biased especially in regards to linguistic demands. \n\nTurns out that the “dumb little puzzles” are actually a pretty decent way to measure constructs such as visuospatial reasoning. They are almost entirely free of linguistic and cultural biases. \n\nAlso, your point about practice making you better at the puzzles is true. However, one of the assumptions of IQ tests like the WISC or WAIS is that you haven’t been extensively exposed to block design or matrix reasoning tasks. If you are too well practiced in them, the test becomes a less valid indicator of your natural ability to perform on such tasks.", "created_utc": "1666362640.0", "edited": "False", "id": "it7is1k", "is_submitter": "False", "link_id": "t3_y9ihpo", "parent_id": "t1_it75ucj", "score": "17", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Rare Ukraine L", "created_utc": "1666320556.0", "edited": "False", "id": "it5o64g", "is_submitter": "False", "link_id": "t3_y9fshk", "parent_id": "t3_y9fshk", "score": "0", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This is true mostly for the present, preterite, and future tenses. In the imperfect and subjunctive, the 1st and 3rd person singular are identical. So without context, there’s no way to know what the subject is. But I have noticed that Spanish speakers tend to use pronouns in these cases to make it more clear. \n\nAlso, even with the 3rd person singular in present, preterite, and future, you can’t know whether the subject is a he/she/it without context\n\nEdit: I forgot about usted in the 3rd person singular and ustedes/ellos/ellas in the 3rd person plural. Need context to distinguish these verb forms as well. Some languages conjugate based on gender which makes things clear and specific, but it would be a nightmare to add such a dimension to conjugations that are already complex for speakers of certain languages like English", "created_utc": "1666320148.0", "edited": "1666376391.0", "id": "it5nbaq", "is_submitter": "False", "link_id": "t3_y91fvl", "parent_id": "t1_it3unkf", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "I think knowing it instinctively means learning it as a child automatically. Obviously objects don’t have genders. But if you’re a baby and grow up hearing a gendered language, then it’s going to be instinctive to understand the gender of words", "created_utc": "1666319909.0", "edited": "False", "id": "it5msi5", "is_submitter": "False", "link_id": "t3_y91fvl", "parent_id": "t1_it5i50d", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "I just mean like neolib policies taken to their absolute extreme", "created_utc": "1666273295.0", "edited": "False", "id": "it2hdh5", "is_submitter": "False", "link_id": "t3_y8x9fq", "parent_id": "t1_it2gf9c", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "So I know fascism is self-destructive. But I actually think this shit might indicate that full-fledged neoliberal economic policies bring a country to ruin faster than does fascism. At least fascists kind of let the systems that are in place function for a little while before they ruin it all with a genocide", "created_utc": "1666272167.0", "edited": "False", "id": "it2eu0j", "is_submitter": "False", "link_id": "t3_y8x9fq", "parent_id": "t3_y8x9fq", "score": "-5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Omg another NEPA Vaushite. I thought I was the only one", "created_utc": "1666145295.0", "edited": "False", "id": "isvwmk6", "is_submitter": "False", "link_id": "t3_y7hv4a", "parent_id": "t1_isv20a8", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I do", "created_utc": "1666145193.0", "edited": "False", "id": "isvwehc", "is_submitter": "False", "link_id": "t3_y7esa8", "parent_id": "t1_isvr2ex", "score": "6", "subreddit": "okbuddyvowsh", "subreddit_id": "t5_303l49"}, {"author": "notblackmachete", "body": "Relax", "created_utc": "1666111221.0", "edited": "False", "id": "istlqbo", "is_submitter": "False", "link_id": "t3_y6ve6c", "parent_id": "t1_ist6qjp", "score": "-10", "subreddit": "BeardedDragons", "subreddit_id": "t5_2sove"}, {"author": "notblackmachete", "body": "Super like", "created_utc": "1666111129.0", "edited": "False", "id": "istlhut", "is_submitter": "False", "link_id": "t3_y77xg3", "parent_id": "t3_y77xg3", "score": "16", "subreddit": "okbuddyvowsh", "subreddit_id": "t5_303l49"}, {"author": "notblackmachete", "body": "It’s because he knows that through anime satan is trying to tempt him into sin with what he wants most: big titty underage anime girls", "created_utc": "1666066008.0", "edited": "False", "id": "isriklt", "is_submitter": "False", "link_id": "t3_y6v9ch", "parent_id": "t3_y6v9ch", "score": "12", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Pro pedophilia mall", "created_utc": "1666035551.0", "edited": "False", "id": "ispnps5", "is_submitter": "False", "link_id": "t3_y6hrp4", "parent_id": "t3_y6hrp4", "score": "10", "subreddit": "okbuddyvowsh", "subreddit_id": "t5_303l49"}, {"author": "notblackmachete", "body": "Yes", "created_utc": "1666034596.0", "edited": "False", "id": "isplasp", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_ispl944", "score": "2", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "So I think that a given amount of food necessary to sustain a healthy human life should be free for everyone. And then if you want to go out to restaurants to eat that’s totally fine. \n\nThe problem with rent is that there is no free housing. If there was free (or at least extremely cheap) housing, and people willingly wanted to pay more for more premium places, that would also be fine. But we don’t live in a world like this. We live in a world where even the poorest of poor have to pay insane relative prices for rent.", "created_utc": "1666034564.0", "edited": "False", "id": "ispl7ua", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_ispkns6", "score": "0", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "If I had a gun to your head, and I told you to suck my dick and you did, you would be consenting to suck my dick. But I think you would agree that this is a deeply troubling situation and you aren’t really making a “free” choice by sucking my dick.", "created_utc": "1666034234.0", "edited": "False", "id": "ispkdr8", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_ispi82y", "score": "1", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "Well you can be satisfied with it but that would just make you a cuck. There’s plenty of children working in sweatshops that are “satisfied” but that doesn’t make it right. \n\nYou’re being exploited because the landlord is charging you excessively even though they needs not. The price may seem reasonable to you, but in reality it is not. The landlord’s profit is valued more highly in such transactions than is putting a proper roof over the head of the tenant.\n\nAnd yeah people have to rent in the same way that people have to work shitty minimum wage jobs", "created_utc": "1666033957.0", "edited": "False", "id": "ispjoe7", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_ispiz8a", "score": "-2", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "You’re right", "created_utc": "1666033430.0", "edited": "False", "id": "ispic83", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_isphl9a", "score": "-3", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "I’m being a bit hyperbolic. But in a sense yes. Being a landlord involves necessary exploitation of your tenants. I personally would find it unethical to become a landlord and blindly participate in this system. I think you can be an ethical landlord if you work within a structure that allows for tenant unions", "created_utc": "1666033404.0", "edited": "False", "id": "ispi9uo", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_isphg8e", "score": "5", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "Economic and financial judgments are informed by your ethical framework.", "created_utc": "1666033149.0", "edited": "False", "id": "isphmg6", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_ispheem", "score": "7", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "Well it’s kind of like being a cop. Like not all cops and landlords are pieces of shit. But the fact that they chose to become a cop or a landlord brings into question their ethical nature.", "created_utc": "1666032931.0", "edited": "False", "id": "isph2ak", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_ispgq2a", "score": "2", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "You forget that landlords don’t give a fuck about ethical considerations. It’s against their nature to do so", "created_utc": "1666032379.0", "edited": "False", "id": "ispfm44", "is_submitter": "False", "link_id": "t3_y6ewei", "parent_id": "t1_ispc0oz", "score": "38", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "notblackmachete", "body": "I agree. The only video essayist besides contra that I’ll watch. I’ve actually learned so much about Black cultural issues from him that I didn’t even know existed. I’ll gladly shut up my white ass to listen to him.", "created_utc": "1666029403.0", "edited": "False", "id": "isp81f4", "is_submitter": "False", "link_id": "t3_y6eemr", "parent_id": "t1_isoz34u", "score": "61", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This is boomer advice lmfao. Google maps or Apple Maps will very clearly tell you exactly which subways to take. No need to try to study a subway map which would be incredibly confusing for someone who is not from the city", "created_utc": "1665972023.0", "edited": "False", "id": "ismgp36", "is_submitter": "False", "link_id": "t3_y5mwyz", "parent_id": "t1_islvrnq", "score": "0", "subreddit": "AskNYC", "subreddit_id": "t5_2uqch"}, {"author": "notblackmachete", "body": "Lmfao I plan my trips around food and sightseeing is less important to me. Clearly you’re the opposite with that list of fast food chains barely visible at the bottom there 💀.\n\nBut seriously, it would be a waste of a visit if you didn’t get some of NYC’s legendary food.", "created_utc": "1665971749.0", "edited": "False", "id": "ismg417", "is_submitter": "False", "link_id": "t3_y5mwyz", "parent_id": "t3_y5mwyz", "score": "10", "subreddit": "AskNYC", "subreddit_id": "t5_2uqch"}, {"author": "notblackmachete", "body": "I took German in HS and regret not taking Spanish. Although German is a dope language, Spanish would have been much more useful. Also, the German at my school was a joke.\n\nNonetheless, I started learning Spanish on my own last year and I bet I have learned more in that time than I would’ve just by taking three years of a high school class. Shit I probably learned more in a year than I would’ve if I took several years of college Spanish. Nothing helps you learn quicker and more than non-academic self-motivated learning imo", "created_utc": "1665965917.0", "edited": "False", "id": "ism3amj", "is_submitter": "False", "link_id": "t3_y5avj8", "parent_id": "t3_y5avj8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "notblackmachete", "body": "Concrete is fantastic. Keeps buildings well insulated and you don’t run the risk of accidentally putting a hole in the wall. You don’t punch wall, wall punches you", "created_utc": "1665955259.0", "edited": "False", "id": "islfctq", "is_submitter": "False", "link_id": "t3_y5kcjc", "parent_id": "t1_isk7tk9", "score": "46", "subreddit": "UrbanHell", "subreddit_id": "t5_2yokk"}, {"author": "notblackmachete", "body": "This study found that conservatism is a mediator between low IQ in childhood and adulthood racism. This means that those with low childhood IQ are more likely to be racist if they are conservative. \n\nSo basically, low IQ itself doesn’t predict racism, but if paired with conservatism it does.", "created_utc": "1665954964.0", "edited": "1665957530.0", "id": "islen2h", "is_submitter": "False", "link_id": "t3_y5of8z", "parent_id": "t1_iskz0hi", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Well reptiles really don’t have gender. They’re all part of the they/them militia", "created_utc": "1665954569.0", "edited": "False", "id": "isldoct", "is_submitter": "False", "link_id": "t3_y5f54s", "parent_id": "t3_y5f54s", "score": "-2", "subreddit": "BeardedDragons", "subreddit_id": "t5_2sove"}, {"author": "notblackmachete", "body": "Imagine just rolling up on this on your trip to Warsaw", "created_utc": "1665848383.0", "edited": "False", "id": "isfdpsd", "is_submitter": "False", "link_id": "t3_y4q8y7", "parent_id": "t3_y4q8y7", "score": "978", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "All of red light. First bladee album that “clicked” for me", "created_utc": "1665800808.0", "edited": "False", "id": "isdcksf", "is_submitter": "False", "link_id": "t3_y413hg", "parent_id": "t3_y413hg", "score": "2", "subreddit": "Draingang", "subreddit_id": "t5_39igo"}, {"author": "notblackmachete", "body": "Ron Johnson based?", "created_utc": "1665769890.0", "edited": "False", "id": "isbe3lj", "is_submitter": "False", "link_id": "t3_y3ta1d", "parent_id": "t3_y3ta1d", "score": "-6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "$333", "created_utc": "1665753052.0", "edited": "False", "id": "isa92wa", "is_submitter": "False", "link_id": "t3_y3i1a8", "parent_id": "t3_y3i1a8", "score": "0", "subreddit": "Draingang", "subreddit_id": "t5_39igo"}, {"author": "notblackmachete", "body": "I would make sure to answer this by answering with schools that are similar in focus to the program you are interviewing with. For example, clinical psychology has multiple training models. If you are interviewing with a program that does model X, but you say you are also applying to a program that does model Y and another that does model Z, they might think you are uncertain about what you want from graduate school. Not sure if this applies to other fields", "created_utc": "1665716067.0", "edited": "False", "id": "is8qmw7", "is_submitter": "False", "link_id": "t3_y33aoj", "parent_id": "t3_y33aoj", "score": "11", "subreddit": "gradadmissions", "subreddit_id": "t5_2tn62"}, {"author": "notblackmachete", "body": "If they’re actually springtails then it’s fine. Springtails are super necessary for bioactive set ups. But even with non-bioactive they might prevent mold from building up if you got high humidity", "created_utc": "1665713267.0", "edited": "False", "id": "is8kl5s", "is_submitter": "False", "link_id": "t3_y3gxu9", "parent_id": "t3_y3gxu9", "score": "7", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "N word pass for all polish", "created_utc": "1665710736.0", "edited": "False", "id": "is8f0b3", "is_submitter": "False", "link_id": "t3_y2unnv", "parent_id": "t3_y2unnv", "score": "0", "subreddit": "Polska", "subreddit_id": "t5_2qiqo"}, {"author": "notblackmachete", "body": "They’re whitewashing his full sexual nature which includes horsefucking", "created_utc": "1665690842.0", "edited": "False", "id": "is744ld", "is_submitter": "False", "link_id": "t3_y32r62", "parent_id": "t3_y32r62", "score": "27", "subreddit": "okbuddyvowsh", "subreddit_id": "t5_303l49"}, {"author": "notblackmachete", "body": "Too young for sperm plug I would say", "created_utc": "1665690765.0", "edited": "False", "id": "is73xa6", "is_submitter": "False", "link_id": "t3_y37vy0", "parent_id": "t3_y37vy0", "score": "2", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "One of the few based leftist subs that doesn’t promote a love for state capitalist fascist regimes.\n\nThank god y’all are sane on here bc I wouldn’t want a bunch of tankies with brain rot running around with guns", "created_utc": "1665668931.0", "edited": "False", "id": "is5ksc3", "is_submitter": "False", "link_id": "t3_y2rzhg", "parent_id": "t3_y2rzhg", "score": "1", "subreddit": "SocialistRA", "subreddit_id": "t5_37lnk"}, {"author": "notblackmachete", "body": "Se dice “Latinoamérica” pq español, Portugués, y francés se originaron del idioma latino. Y en esos países se habla en esos idiomas. No tiene nada de ver con catolicismo", "created_utc": "1665629154.0", "edited": "False", "id": "is3wfe5", "is_submitter": "False", "link_id": "t3_y1wtxe", "parent_id": "t1_is1y74a", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "I figured this string of Ws from Biden wouldn’t last", "created_utc": "1665626178.0", "edited": "False", "id": "is3py6p", "is_submitter": "False", "link_id": "t3_y2l76v", "parent_id": "t3_y2l76v", "score": "53", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Vowshite dennis coming in hot with the r slur", "created_utc": "1665610067.0", "edited": "False", "id": "is2oze3", "is_submitter": "False", "link_id": "t3_y2ara2", "parent_id": "t3_y2ara2", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Wait so it’s literally just a hyperbolic statement. It’s the same thing as when someone says “i knew I was a gamer from the womb”", "created_utc": "1665576626.0", "edited": "False", "id": "is0f8f1", "is_submitter": "False", "link_id": "t3_y1zjcf", "parent_id": "t1_is0cjny", "score": "54", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I believe that mindfulness and breaking the cycle of mimesis go hand in hand. How are you supposed to not be caught up in mimetic contagion if you are unaware of your own thought processes? How are you to know that you are participating in scapegoating if you cannot pause for a second to observe yourself?\n\nI firmly believe that mindfulness practice is a prerequisite to living out a Girardian ethic. It is no surprise that Christianity has a strong mystic tradition that seems to acknowledge similar ideas. \n\n&#x200B;\n\n>One final problem is that the claim is that Buddhism is empirical: you don't believe his methods, try them out! That's just an unconscious act of mimesis. Like advertising, the positive effects of mindfulness can produce an altered state of consciousness--just like a celebrity can make you desire a product.\n\nNot sure what you are getting at here. First of all, not all acts of mimesis are bad as we know given that the ask of Christianity is to engage in positive mimesis with Christ as the model. Going off my previous point, the altered state of consciousness you talk of could be very beneficial to living a Girardian ethic.", "created_utc": "1665537023.0", "edited": "False", "id": "iryrwwf", "is_submitter": "False", "link_id": "t3_xv0e0x", "parent_id": "t1_iqyj7w9", "score": "1", "subreddit": "ReneGirard", "subreddit_id": "t5_3kdgb"}, {"author": "notblackmachete", "body": "The fact that he basically does video essays extemporaneously on stream via his segments, and the fact that they’re really good suggests to me that if he did legit video essays they’d be insane.  \n\nIt’s like he’s handicapping himself. Don’t get me wrong I hope he never becomes a video essayist; I prefer the streaming. But he’s hiding his power level", "created_utc": "1665514317.0", "edited": "False", "id": "irxa7ez", "is_submitter": "False", "link_id": "t3_y1gatu", "parent_id": "t3_y1gatu", "score": "13", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "this seems like a psyop", "created_utc": "1665507461.0", "edited": "False", "id": "irwsel4", "is_submitter": "False", "link_id": "t3_y1dg40", "parent_id": "t3_y1dg40", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Social determinants of health are part of clinical psychology and are in fact my area of research specialization", "created_utc": "1665491689.0", "edited": "False", "id": "irvrn26", "is_submitter": "False", "link_id": "t3_xyg7or", "parent_id": "t1_irvmx18", "score": "1", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "Yes. My research focus on racial health disparities and what psychological mechanisms maintain them. These perspectives are not mutually exclusive to one another. It’s being nuanced in thinking", "created_utc": "1665491644.0", "edited": "False", "id": "irvrk0n", "is_submitter": "False", "link_id": "t3_xyg7or", "parent_id": "t1_irvnakc", "score": "1", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "*Ian kochinski", "created_utc": "1665435951.0", "edited": "False", "id": "irt5u8b", "is_submitter": "False", "link_id": "t3_y0g1u1", "parent_id": "t3_y0g1u1", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Damn Dubai city planners really said: “let’s make our suburbs even worse and more dystopian than American suburbs”", "created_utc": "1665430853.0", "edited": "False", "id": "irstfq5", "is_submitter": "False", "link_id": "t3_y0gmof", "parent_id": "t3_y0gmof", "score": "1", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "notblackmachete", "body": "I think some do and some don’t. My guy is two years old and this is his first time brumating. \n\nSome people recommend not allowing babies to brumate, some people do. I would do some research so you can make an informed decision.", "created_utc": "1665424018.0", "edited": "False", "id": "irscjpo", "is_submitter": "False", "link_id": "t3_y0kp2w", "parent_id": "t1_irsc0n4", "score": "6", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Probably trying to brumate", "created_utc": "1665423760.0", "edited": "False", "id": "irsbwn1", "is_submitter": "False", "link_id": "t3_y0kp2w", "parent_id": "t3_y0kp2w", "score": "5", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Amazing. If I have the space for this one day I’d definitely do it.", "created_utc": "1665369245.0", "edited": "False", "id": "irprp5s", "is_submitter": "False", "link_id": "t3_y02vlx", "parent_id": "t1_irprf8d", "score": "2", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Looks beautiful! What is the length on your enclosure. Looks massive", "created_utc": "1665368741.0", "edited": "False", "id": "irpqn2k", "is_submitter": "False", "link_id": "t3_y02vlx", "parent_id": "t3_y02vlx", "score": "3", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "This is a good tip. I’m a PhD student so I’m pretty busy, but whenever I’m walking to my school or working out I listen to podcasts.", "created_utc": "1665368506.0", "edited": "False", "id": "irpq5nb", "is_submitter": "False", "link_id": "t3_xzpzb9", "parent_id": "t1_iro2pgj", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "notblackmachete", "body": "You’re essentializing. You are basically saying that there is something fundamentally bad about being German or being Russian. This is bigotry. People are just people. It’s the environments they find themselves in that make them act poorly.\n\nIt’s fine to hate the nazis and the USSR, but it’s not ok to hate individual German or Russian people.", "created_utc": "1665365992.0", "edited": "False", "id": "irpkzll", "is_submitter": "False", "link_id": "t3_xzf7bp", "parent_id": "t1_irpiw2x", "score": "1", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "Well it’s not weird in the sense that it’s totally understandable. That does not make it right tho. I would understand why someone might hate Black people if they got robbed by a Black person one time. But that does not make it ok to have that hatred. \n\nI grew up with my Polish mom telling me how awful Germans and Russians are for what they did to us throughout history. But as I got older, I realized these beliefs are just fueled by hatred and essentialization. \n\nI personally think ironically making fun of Russians or Germans is ok. But I think a lot of people don’t do it ironically and actually hate these groups", "created_utc": "1665364600.0", "edited": "False", "id": "irpi59b", "is_submitter": "False", "link_id": "t3_xzf7bp", "parent_id": "t1_irpdn7q", "score": "0", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "That just takes into account writing systems and religion and ignores the rest of cultural aspects that might be important to the conversation", "created_utc": "1665361625.0", "edited": "False", "id": "irpbw9g", "is_submitter": "False", "link_id": "t3_xzf7bp", "parent_id": "t1_irpb82d", "score": "0", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "Right so it’s simply because certain Polish people are ashamed of other Slavic countries. This seems like a pretty bad reason to not identify with other Slavs. It seems like Poles who hold this attitude are pretty much “pick me girls.” Like what you’re saying is “I swear, I’m not like the other Slavs UwU.” I find this to actually be a disgusting and ethnocentrist attitude", "created_utc": "1665361444.0", "edited": "False", "id": "irpbj8l", "is_submitter": "False", "link_id": "t3_xzf7bp", "parent_id": "t1_irn4hit", "score": "-1", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "No I’m not saying those latter groups have commonalities. I’m just saying that we as poles are less similar to all of those groups than we are with other Slavic groups. I’m not grouping those other groups together. \n\nLike the insinuation of people saying we are Central Europeans is that we have more in common with the fucking Germans than with Russians", "created_utc": "1665360691.0", "edited": "False", "id": "irpa04i", "is_submitter": "False", "link_id": "t3_xzf7bp", "parent_id": "t1_irp8h5t", "score": "0", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "One tip one of my professors gave me is to always make sure to ask if they can write you a “GOOD”letter of recommendation. Apparently, there are some assholes out there who will write you a LOR if you ask, but it’ll be quite bad or disparaging. So you should make sure it will be a good one when you initially ask.", "created_utc": "1665346280.0", "edited": "False", "id": "irodypc", "is_submitter": "False", "link_id": "t3_xzom4s", "parent_id": "t3_xzom4s", "score": "2", "subreddit": "gradadmissions", "subreddit_id": "t5_2tn62"}, {"author": "notblackmachete", "body": "Brain dead take. This is the type of attitude that leads to genocide. Russia the state is bad for its war crimes, but that does not make the Russian culture or language also bad. This would be like saying after WWII that German should no longer be studied", "created_utc": "1665345412.0", "edited": "False", "id": "irobn30", "is_submitter": "False", "link_id": "t3_xztrxd", "parent_id": "t1_iroaxv6", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "notblackmachete", "body": "I agree with you but they would just say that this type of gender dysphoria is justified bc the boy is developing unnatural breasts. They would say males should not be developing breasts in the first place. They would probably compare it to growing a wart on a part of your body and having it removed. By contrast, breasts in females are natural and ought not to be removed. \n\nYour argument here is fantastic for people who actually believe in a sex-gender difference. But I’m afraid it won’t work against transphobes", "created_utc": "1665334359.0", "edited": "False", "id": "irnjesw", "is_submitter": "False", "link_id": "t3_xzo5g7", "parent_id": "t3_xzo5g7", "score": "17", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "No but terminally online leftists are. They probably just build their idea of America through clowns on twitter", "created_utc": "1665332996.0", "edited": "False", "id": "irnfzsg", "is_submitter": "True", "link_id": "t3_xzaczy", "parent_id": "t1_irndtl8", "score": "0", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "We are literally Slavic people. Majority of Slavs live in Eastern Europe. We share more culturally with Ukrainians, Czechoslovakians, and god forbid Belarusians and Russians than we do with Germans, French, Italians, Spaniards, British", "created_utc": "1665327740.0", "edited": "False", "id": "irn38y0", "is_submitter": "False", "link_id": "t3_xzf7bp", "parent_id": "t1_irn1ov8", "score": "-2", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "No better way to trigger a pole than calling Poland Eastern Europe lol.", "created_utc": "1665327617.0", "edited": "False", "id": "irn2yyf", "is_submitter": "False", "link_id": "t3_xzf7bp", "parent_id": "t3_xzf7bp", "score": "26", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "OP is clearly troubled as evidenced by their post history. This is probably just a troll post to garner negative attention. No way someone can come onto this sub and unironically think this type of incel shit is gonna be received seriously", "created_utc": "1665285351.0", "edited": "False", "id": "irlb5n5", "is_submitter": "False", "link_id": "t3_xz88pj", "parent_id": "t3_xz88pj", "score": "3", "subreddit": "psychologystudents", "subreddit_id": "t5_2vizn"}, {"author": "notblackmachete", "body": "Oh yeah I think it’s important. But certainly a strange place to start if you are just getting into psychology. I personally love all of the social science, so I appreciate the value of works like this", "created_utc": "1665280106.0", "edited": "False", "id": "irl0q3d", "is_submitter": "False", "link_id": "t3_xz404p", "parent_id": "t1_irl0ik0", "score": "3", "subreddit": "psychologystudents", "subreddit_id": "t5_2vizn"}, {"author": "notblackmachete", "body": "For many people it is a fantasy. \n\nBut to unironically think religious systems are simply “fairy tales” is anti-intellectual. We have whole fields of sociology, anthropology, and theology that devote themselves to studying religion.", "created_utc": "1665275324.0", "edited": "False", "id": "irkqz2b", "is_submitter": "False", "link_id": "t3_xz6l51", "parent_id": "t3_xz6l51", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Totem and taboo is more sociology/anthropology than psychology", "created_utc": "1665275003.0", "edited": "False", "id": "irkqa2s", "is_submitter": "False", "link_id": "t3_xz404p", "parent_id": "t3_xz404p", "score": "6", "subreddit": "psychologystudents", "subreddit_id": "t5_2vizn"}, {"author": "notblackmachete", "body": "Yep I agree with what you’re saying. I don’t mean it in a blaming sense whatsoever.", "created_utc": "1665264384.0", "edited": "False", "id": "irk46n3", "is_submitter": "False", "link_id": "t3_xyg7or", "parent_id": "t1_irk3kd8", "score": "3", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "I don’t disagree with what you’re saying. And I also agree we should be advocates for social change. And yes, contextualizing a client’s problems can be very helpful.\n\nI simply think that we as therapists need to focus our work by using the tools that we have at our disposal. \n\nWith your example of the Black man who has a fear of the police, I agree it is a completely valid fear. But in session, we will not just throw our hands up and complain about the state of policing in America. That should certainly be part of our discussion. But we will primarily focus on the things we actually can change in the therapeutic context. \n\nI think we are mostly in agreement. I certainly don’t mean to dismiss the effects of oppressive structures but rather be realistic regarding goals in therapy", "created_utc": "1665264038.0", "edited": "1665264222.0", "id": "irk3fs5", "is_submitter": "False", "link_id": "t3_xyg7or", "parent_id": "t1_irk1fl3", "score": "2", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "I have a strong feeling that adding political orientation into the equation would change these results dramatically lol", "created_utc": "1665235517.0", "edited": "False", "id": "irihv21", "is_submitter": "False", "link_id": "t3_xqufi2", "parent_id": "t3_xqufi2", "score": "1", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "You’re observations here are spot on for so many things we call “disorders.” At the same time, I think that failing to focus on placing certain pathologies within the individual will obfuscate our understanding and inhibit proper treatment. \n\nFor example, you can say that OCD stems from the pressures of functioning in a capitalist system (this very well could be true). But we as psychologists are not first and foremost political revolutionaries. We do not seek to necessarily help people by trying to alter these massive sociopolitical structures. If we formulate our case conceptualizations based on the interaction between the individual and their political environment, then our sessions with our clients would just look like a discussion about the perils of late-stage capitalism. And I really think that we would be failing our patients if we engaged with them in this way.", "created_utc": "1665235170.0", "edited": "False", "id": "irihagy", "is_submitter": "False", "link_id": "t3_xyg7or", "parent_id": "t1_irhhtwy", "score": "6", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "Russia attacking twitter leftists", "created_utc": "1665151021.0", "edited": "False", "id": "irel2fp", "is_submitter": "False", "link_id": "t3_xxx2td", "parent_id": "t3_xxx2td", "score": "2", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "notblackmachete", "body": "REPRESENTACJA DLA NASZYCH", "created_utc": "1665021451.0", "edited": "False", "id": "ir8b731", "is_submitter": "False", "link_id": "t3_xwpae7", "parent_id": "t3_xwpae7", "score": "6", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "If the consequences of the action involve the need for medical interventions, then they are immoral to me. For example, knife play could be fine. But if you want someone to slit your jugular or femoral artery, then nah. Or, if you enjoy getting beaten during sex that’s cool. But if you enjoy being beaten to the point of needing facial reconstructive surgery then nope.", "created_utc": "1665016065.0", "edited": "False", "id": "ir80bvj", "is_submitter": "False", "link_id": "t3_xwk8ha", "parent_id": "t3_xwk8ha", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Not a grift for Kanye he is just severely unwell", "created_utc": "1664846845.0", "edited": "False", "id": "iqymjbb", "is_submitter": "False", "link_id": "t3_xuy0q8", "parent_id": "t3_xuy0q8", "score": "65", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "We don’t and I actually don’t think many people genuinely do", "created_utc": "1664846540.0", "edited": "False", "id": "iqyluqk", "is_submitter": "False", "link_id": "t3_xusf0l", "parent_id": "t3_xusf0l", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "You guys were fooled...\n\nAs an American socialist.\n\nI think you guys were fooled by Vaush. \nDo you really think you can bring socialism with Biden ? Do you think AOC is not corrupt like the rest of them ? Bernie is not even a real socialist.\n\nPersonally, I'd gladly vote for Mélenchon, Lula and Corbyn. \nI love and admire those leaders that I coincidentally cannot vote for.\nUnlike the Democrats. They are all part of parties where 0 corruption ever occured and nothing they did was ever liberal leaning.\n\nWhat we should do is *organize*, I don't really know what it entails, so I won't do it, but we should really *organize*, not me though.\n\nPersonally, I think we can convince 300 million Americans to do a socialist revolution, as it is not hard to achieve, we only need to *organize*.\n\nNo I'm not lazy, shut up.", "created_utc": "1664846243.0", "edited": "False", "id": "iqyl6ay", "is_submitter": "False", "link_id": "t3_xv180f", "parent_id": "t3_xv180f", "score": "15", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Disagree. It’s a pretty left-leaning sub. I would say that the types of posts that simply make fun of mentally ill people are uncommon. Most of it is just posts about racist karens or shitty police. People in the comments over there constantly shitting on conservatives.", "created_utc": "1664844505.0", "edited": "False", "id": "iqyhb6s", "is_submitter": "False", "link_id": "t3_xv0ah8", "parent_id": "t3_xv0ah8", "score": "7", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Sorry I edited after you responded. I would just look out for sperm plugs in the next few years. Some skinks take longer to mature, so it could be a while. They usually drop the speed plugs along with their poop and pee but not always", "created_utc": "1664673901.0", "edited": "False", "id": "iqp2kit", "is_submitter": "False", "link_id": "t3_xtbe88", "parent_id": "t1_iqp2fk0", "score": "2", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Too early then. They don’t reach sexual maturity until at least around one year old. But it usually is later than that. Best way to tell is if by the age of 4 you haven’t seen them drop a sperm plug, they’re probably female", "created_utc": "1664673773.0", "edited": "False", "id": "iqp2bb0", "is_submitter": "False", "link_id": "t3_xtbe88", "parent_id": "t1_iqp1yuh", "score": "1", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Age? That skink could be 15 years old for all we know. Gotta provide more info", "created_utc": "1664673484.0", "edited": "False", "id": "iqp1phs", "is_submitter": "False", "link_id": "t3_xtbe88", "parent_id": "t3_xtbe88", "score": "2", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "It’s actually super confusing to me. I feel like there should be a huge overlap between these two communities, but there isn’t. I’m a Vaushite who likes Hassan (obviously brain dead on Ukraine tho). But I do think that Hassan is a little too normie at times for me. His takes are a little simplistic, but he is a huge positive force for the left", "created_utc": "1664647368.0", "edited": "False", "id": "iqng7ix", "is_submitter": "False", "link_id": "t3_xt1jzv", "parent_id": "t3_xt1jzv", "score": "50", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Even the DGGers are mad", "created_utc": "1664646942.0", "edited": "False", "id": "iqnf6fq", "is_submitter": "False", "link_id": "t3_xszu0m", "parent_id": "t3_xszu0m", "score": "30", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "You underestimate their brain damage", "created_utc": "1664641593.0", "edited": "False", "id": "iqn2c3u", "is_submitter": "False", "link_id": "t3_xsrztq", "parent_id": "t1_iqn1lrp", "score": "9", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "It would be to conservatives", "created_utc": "1664639379.0", "edited": "False", "id": "iqmx63m", "is_submitter": "False", "link_id": "t3_xsrztq", "parent_id": "t1_iqmwvq9", "score": "9", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Imagine horny posting on the Spanish subreddit", "created_utc": "1664633885.0", "edited": "False", "id": "iqmkpci", "is_submitter": "False", "link_id": "t3_xslz7i", "parent_id": "t3_xslz7i", "score": "14", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "Any movie not made in America or Europe since the majority of cast won’t be white.", "created_utc": "1664633373.0", "edited": "False", "id": "iqmjkz9", "is_submitter": "False", "link_id": "t3_xsrztq", "parent_id": "t3_xsrztq", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "You can generally find indos starting at 200 and northerns starting at 300. I would recommend ordering from a breeder online though. Reptile shows usually have them, but in my experience they are very expensive there. Like 500ish for northern juveniles", "created_utc": "1664583091.0", "edited": "False", "id": "iqkf23r", "is_submitter": "False", "link_id": "t3_xsbh03", "parent_id": "t3_xsbh03", "score": "1", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "There’s no such thing as lackluster bladee. Sometimes you just have to listen to the project multiple times to achieve enlightenment. We are mere mortals and can’t easily understand the work of god reincarnated", "created_utc": "1664565747.0", "edited": "False", "id": "iqjc7uq", "is_submitter": "False", "link_id": "t3_xs2xfo", "parent_id": "t3_xs2xfo", "score": "18", "subreddit": "Draingang", "subreddit_id": "t5_39igo"}, {"author": "notblackmachete", "body": "Ah, clearly a member of the Vaushite subdivision of the CIA has infiltrated the UK government", "created_utc": "1664548053.0", "edited": "False", "id": "iqi44z5", "is_submitter": "False", "link_id": "t3_xs29nf", "parent_id": "t3_xs29nf", "score": "78", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "No, $1 = 5 zł\n\nOr, 1 zł = $0,2", "created_utc": "1664543677.0", "edited": "False", "id": "iqhu9px", "is_submitter": "False", "link_id": "t3_xs0c50", "parent_id": "t1_iqhrney", "score": "20", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "I see. I’m just curious, what about their anatomy makes them more prone to suffer from impaction.", "created_utc": "1664541336.0", "edited": "False", "id": "iqhpjp3", "is_submitter": "False", "link_id": "t3_xrorvq", "parent_id": "t1_iqhddot", "score": "1", "subreddit": "BeardedDragons", "subreddit_id": "t5_2sove"}, {"author": "notblackmachete", "body": "I really don’t understand the risk of impaction argument. Literally every other reptile can get impacted from their substrate, but no one goes around saying we should keep skinks or tortoises on tile. I feel like this is just a weird myth that only exists in the beardie community", "created_utc": "1664509297.0", "edited": "False", "id": "iqggzkr", "is_submitter": "False", "link_id": "t3_xrorvq", "parent_id": "t1_iqge9q8", "score": "3", "subreddit": "BeardedDragons", "subreddit_id": "t5_2sove"}, {"author": "notblackmachete", "body": "I think it looks more like a northern. I see a little black on the front legs, but not enough to go with irian Jaya. In general it’s lacking blackness normally characteristic of Indonesian species", "created_utc": "1664489796.0", "edited": "False", "id": "iqfaxjd", "is_submitter": "False", "link_id": "t3_xrk551", "parent_id": "t1_iqf92q9", "score": "3", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "I’m dealing with the exact same situation. It’s been a month for me. Probably brumation", "created_utc": "1664483658.0", "edited": "False", "id": "iqew9g5", "is_submitter": "False", "link_id": "t3_xri1y9", "parent_id": "t3_xri1y9", "score": "4", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "I would say that there’s probably only a handful of programs that would be practice oriented. The scale for PhDs kind of goes from: \nscientist-practitioner - clinical science.\n\nSo the best you’ll get is equal emphasis in most cases. That being said, some programs are known for having most of their students go on to do practice rather than research. You can kind of get an estimate of this by the licensure rates of the program. But that’s not a super strong indicator. \n\nAlso, “The Insider’s Guide to Graduate Programs in Clinical and Counseling Psychology” has an appendix where they rate all APA-accredited programs on a scale from 1-7 based on how much they lean towards practice or research. A score of 4 is the midpoint (equal emphasis), and from my recollection all PhD programs are at least a 4. The ratings are based on program self-reports\n\nTo add, the PhD programs that are practice-oriented are probably at non-APA-accredited institutions that are for-profit. That also means that they wouldn't be fully funded.", "created_utc": "1664482501.0", "edited": "1664482751.0", "id": "iqetcak", "is_submitter": "False", "link_id": "t3_xrhod8", "parent_id": "t3_xrhod8", "score": "10", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "I love their podcasts. The topics and their rapport with one another make every episode super fun", "created_utc": "1664481732.0", "edited": "False", "id": "iqerer4", "is_submitter": "False", "link_id": "t3_xrfdxp", "parent_id": "t1_iqepjgt", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "That’s funny because I do know how to use books; I’m a doctoral student. All I do is read books. Moreover, I have gotten to B2 level Spanish in a year without opening a single book. So nice observation there\n\nI’m not saying books don’t have utility, it’s just that there are better alternatives nowadays. ESPECIALLY for language learning. If you’re talking about using books to aid reading comprehension, I fully agree get some books. But to use books for grammar is archaic and not to mention needlessly expensive", "created_utc": "1664480493.0", "edited": "1664480770.0", "id": "iqeoay7", "is_submitter": "False", "link_id": "t3_xrague", "parent_id": "t1_iqen5eq", "score": "0", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "Idk books are pretty boring and not interactive. You can find an online learning tool that serves all of the purposes of a book but is also engaging. Could be a personal preference of mine, but I would never learn anything if I had to use a book.", "created_utc": "1664473060.0", "edited": "False", "id": "iqe5dmf", "is_submitter": "False", "link_id": "t3_xrague", "parent_id": "t1_iqe3z3f", "score": "-18", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "I’ve never heard him use “arbitrary” incorrectly", "created_utc": "1664472445.0", "edited": "False", "id": "iqe3t75", "is_submitter": "False", "link_id": "t3_xrcbup", "parent_id": "t3_xrcbup", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Learning polish is self-harm behavior.\n\nBut in all seriousness fuck books there’s probably good resources on YouTube", "created_utc": "1664469176.0", "edited": "False", "id": "iqdvhqn", "is_submitter": "False", "link_id": "t3_xrague", "parent_id": "t3_xrague", "score": "31", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "Once you eat enough food from different cultures you realize that every culture has the same thing but different variations of it. Like every culture has some kind of dumpling", "created_utc": "1664459731.0", "edited": "False", "id": "iqd8fw3", "is_submitter": "False", "link_id": "t3_xr67ui", "parent_id": "t3_xr67ui", "score": "11", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Of course a Vaushite loves the police. Can’t deal with this fake leftist community", "created_utc": "1664457348.0", "edited": "False", "id": "iqd36l5", "is_submitter": "False", "link_id": "t3_xqy93r", "parent_id": "t3_xqy93r", "score": "-12", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "https://www.amazon.com/REPTI-ZOO-Lighting-Terrarium-Desert/dp/B08HCXZXTK/ref=mp_s_a_1_1_sspa?crid=NLNW30LVQM0H&keywords=t5+ho+uvb&qid=1664405746&qu=eyJxc2MiOiI0LjAwIiwicXNhIjoiMy44MSIsInFzcCI6IjMuNDkifQ%3D%3D&sprefix=t5+ho+uvb%2Caps%2C69&sr=8-1-spons&ufe=app_do%3Aamzn1.fos.006c50ae-5d4c-4777-9bc0-4513d670b6bc&psc=1", "created_utc": "1664405769.0", "edited": "False", "id": "iqaqae0", "is_submitter": "False", "link_id": "t3_xqq75q", "parent_id": "t3_xqq75q", "score": "2", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "What background do you use? Is it custom?", "created_utc": "1664403685.0", "edited": "False", "id": "iqalmgs", "is_submitter": "False", "link_id": "t3_xqd7oh", "parent_id": "t3_xqd7oh", "score": "1", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "More proof Vaush is racist and classist: hurricane Ian disproportionately affects poor communities of color. How are you going to weasel your way out of this one, Vaushites???? “cOntExT”", "created_utc": "1664371022.0", "edited": "False", "id": "iq8cqxx", "is_submitter": "False", "link_id": "t3_xqcfxi", "parent_id": "t3_xqcfxi", "score": "168", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This is an awesome setup.", "created_utc": "1664324912.0", "edited": "False", "id": "iq6ckvk", "is_submitter": "False", "link_id": "t3_xpwy2m", "parent_id": "t3_xpwy2m", "score": "10", "subreddit": "BeardedDragons", "subreddit_id": "t5_2sove"}, {"author": "notblackmachete", "body": "I’m polish and consider myself Eastern European. I consider all slavic people Eastern European. But, I wouldn’t say Poland physically is located in Eastern Europe", "created_utc": "1664311568.0", "edited": "False", "id": "iq5i526", "is_submitter": "False", "link_id": "t3_xpl17t", "parent_id": "t3_xpl17t", "score": "1", "subreddit": "poland", "subreddit_id": "t5_2qkmn"}, {"author": "notblackmachete", "body": "Why can’t we just have roundabouts", "created_utc": "1664304587.0", "edited": "False", "id": "iq4zxaq", "is_submitter": "False", "link_id": "t3_xpkqz5", "parent_id": "t3_xpkqz5", "score": "10", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I would also add that the ideology becomes religious in a sense, with each person trying to demonstrate just how much they know/are faithful to the dogma. Religion also implies scapegoating of either members of the outgroup or members of the ingroup, and this is very clear with the amount of “cancelling” that stems from wokescold communities. In this sense, wokescolds and tankies are identical to people on the far right in the psychological mechanisms that underlie their behavior.", "created_utc": "1664283597.0", "edited": "False", "id": "iq3kcvq", "is_submitter": "False", "link_id": "t3_xp706y", "parent_id": "t1_iq2hnk2", "score": "21", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "That awkward moment when you forget about racial solidarity and join forces with the people who want both your group and the group you’re protesting against dead", "created_utc": "1664249308.0", "edited": "False", "id": "iq27wt2", "is_submitter": "False", "link_id": "t3_xp122r", "parent_id": "t3_xp122r", "score": "1", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "notblackmachete", "body": "Cubans tend to vote Republican:\nhttps://www.pewresearch.org/fact-tank/2020/10/02/most-cuban-american-voters-identify-as-republican-in-2020/\n\nVaush has talked about this\n\nThere are sadly more and more Hispanics growing Republican in the US \n\n\nDon’t know political leanings in Cuba but I’m guessing they’re pretty good given the gay marriage stuff", "created_utc": "1664233596.0", "edited": "1664233840.0", "id": "iq19lvw", "is_submitter": "False", "link_id": "t3_xol1oq", "parent_id": "t1_iq13gze", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Well put", "created_utc": "1664225218.0", "edited": "False", "id": "iq0pjwz", "is_submitter": "False", "link_id": "t3_xotic5", "parent_id": "t1_iq0ij1j", "score": "2", "subreddit": "SocialistRA", "subreddit_id": "t5_37lnk"}, {"author": "notblackmachete", "body": "It’s a joke that seems to make a whole lot of sense to most of the people here", "created_utc": "1664223688.0", "edited": "False", "id": "iq0lhim", "is_submitter": "False", "link_id": "t3_xol1oq", "parent_id": "t1_iq0kprb", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Sure, don’t disagree. But most of them are still conservatives:\n\nhttps://www.pewresearch.org/fact-tank/2020/10/02/most-cuban-american-voters-identify-as-republican-in-2020/", "created_utc": "1664220269.0", "edited": "False", "id": "iq0ck60", "is_submitter": "False", "link_id": "t3_xol1oq", "parent_id": "t1_iq0cb4i", "score": "7", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I would but he decided to brumate lol", "created_utc": "1664219677.0", "edited": "False", "id": "iq0b0m8", "is_submitter": "False", "link_id": "t3_xosgr5", "parent_id": "t1_iq0as5m", "score": "2", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "One additional tip I would suggest is to stick with substrate that doesn’t have any fine particles which would get caked up in its mouth. So no coco coir basically. Looks like you’re using reptibark which is good.", "created_utc": "1664219395.0", "edited": "False", "id": "iq0aanj", "is_submitter": "False", "link_id": "t3_xosgr5", "parent_id": "t3_xosgr5", "score": "4", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "I’ve used “estoy yendo a tu casa” before when speaking with my Puerto Rican partner, and she said it sounds weird.", "created_utc": "1664211750.0", "edited": "False", "id": "ipzqhoa", "is_submitter": "False", "link_id": "t3_xonnja", "parent_id": "t3_xonnja", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "You’re going to make me Roblox myself", "created_utc": "1664207089.0", "edited": "False", "id": "ipzefr7", "is_submitter": "False", "link_id": "t3_xol1oq", "parent_id": "t1_ipze850", "score": "34", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m literally just saying that Cubans in Cuba are based but the ones who come here are cringe", "created_utc": "1664206919.0", "edited": "False", "id": "ipze048", "is_submitter": "False", "link_id": "t3_xol1oq", "parent_id": "t1_ipzai7e", "score": "33", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Well it’s being mean, sure. But I bet if you try you can find hundreds of words that we use in our everyday language that have origins in pretty bad stuff. Nonetheless, we don’t associate these words with their etymologies\n\nLike these:\n\nhttps://www.cracked.com/amp/article_22920_5-common-sayings-you-use-all-time-with-awful-origins.html", "created_utc": "1664204856.0", "edited": "False", "id": "ipz8ui8", "is_submitter": "False", "link_id": "t3_xokbws", "parent_id": "t1_ipz7q7w", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "No I’m talking about how Cubans in America are majority conservative", "created_utc": "1664204612.0", "edited": "False", "id": "ipz88oh", "is_submitter": "False", "link_id": "t3_xol1oq", "parent_id": "t1_ipz83jt", "score": "177", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "No one associates the words idiot or stupid with ID. You are maybe like one of ten people who do.", "created_utc": "1664204314.0", "edited": "False", "id": "ipz7im1", "is_submitter": "False", "link_id": "t3_xokbws", "parent_id": "t3_xokbws", "score": "8", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Looks like a northern who lost its tail at some point", "created_utc": "1664204128.0", "edited": "False", "id": "ipz72az", "is_submitter": "False", "link_id": "t3_xolds5", "parent_id": "t3_xolds5", "score": "0", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Guess that 33% are the ones that like to immigrate to America", "created_utc": "1664203872.0", "edited": "False", "id": "ipz6fyx", "is_submitter": "False", "link_id": "t3_xol1oq", "parent_id": "t3_xol1oq", "score": "201", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "So I think using the r slur is very tactical against conservatives. I don’t think they’d see it coming from a leftist and it would kind of stun them.\n\nAt the same time, it’s probably best to just never use the word. It’s just sad that there’s no other word that carries the weight of the r slur.", "created_utc": "1664197977.0", "edited": "False", "id": "ipyt1az", "is_submitter": "False", "link_id": "t3_xoilc5", "parent_id": "t3_xoilc5", "score": "31", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "As Vaush has explained it himself, he is a loud and aggressive cis White guy. The left has formed an aversion to this archetype of person, so there is this reflexive hatred of him.", "created_utc": "1664147460.0", "edited": "False", "id": "ipwj6vp", "is_submitter": "False", "link_id": "t3_xnz1vl", "parent_id": "t3_xnz1vl", "score": "24", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Depends on the person but certainly more hours than other PhDs. Clinical psych programs have you take about 15 credits a semester whereas other programs have you take a maximum of 9. On top of that, there is research and clinical work. And the clinical work involves both work at your school’s center and then externships. It’s a lot.", "created_utc": "1664137168.0", "edited": "False", "id": "ipvuowg", "is_submitter": "False", "link_id": "t3_xnx805", "parent_id": "t3_xnx805", "score": "2", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "You see now that would be cultural appropriation. How dare you use a word not from your native language", "created_utc": "1664115216.0", "edited": "False", "id": "ipub5wi", "is_submitter": "False", "link_id": "t3_xnhps1", "parent_id": "t1_ipto9yi", "score": "12", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "To the first one, the other person said something about the other option being going to hell or something. That’s just not true. The way people think of hell and heaven (by people I mean both Christians and Atheists) is hilarious. \n\nTo the second, show me contrary evidence. For all of human history the weak and marginalized were left to die or culled from society. Christian writings are one of the very first to so explicitly condemn such behavior. There’s traces of this in Buddhism too but not as strongly. It’s really not an outrageous claim from an anthropological perspective.\n\nYou might be thinking that what I’m trying to say is that white people brought good ole Christianity to the savages. But no that’s not what I mean at all. I’m talking about the changes in human thinking that we’re occurring 2000 years ago.", "created_utc": "1664063672.0", "edited": "1664063948.0", "id": "ips2f03", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_ips15lt", "score": "-1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Because there’s real differences. I never once even criticized Islamic teachings. I criticized its epistemological framework.", "created_utc": "1664058972.0", "edited": "False", "id": "iprsjnt", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_iprrn6v", "score": "0", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Back when I started watching Vaush in 2020 I thought he was being a bit hyperbolic comparing tankies to fascists. But it’s unquestionable at this point", "created_utc": "1664058819.0", "edited": "False", "id": "iprs7vc", "is_submitter": "False", "link_id": "t3_xn3o5j", "parent_id": "t3_xn3o5j", "score": "25", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Username checks out", "created_utc": "1664058057.0", "edited": "False", "id": "iprqluw", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_iproitb", "score": "-6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I get that totally. In practice, religion can lead to a lot of bad shit. I don't really have a strong argument against this. I think it's important to consider that the founding texts of many religions are written in such a way that makes them easy to misinterpret and abuse. So I would say that it is theoretically possible to construct a religion that avoids this, but being humans we would probably fuck it up somehow.", "created_utc": "1664055430.0", "edited": "False", "id": "iprkxeo", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_iprkm5h", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "So it's not that we rule out parts of the Bible. Some of it, sure. But when we talk about the Old Testament, we can think of it more as a story about what the Hebrews thought about God. How they understood their faith. And then the New Testament represents an evolution of thinking about God introduced by Jesus. The whole narrative is important, but that does not mean that each piece of the narrative is to be taken as something to follow. It just doesn't really work like that. \n\nSo your question about Jesus gets into some super deep theological theory. To make it short, Jesus is God because he perfectly imitates God. Thus, it is not that God interfered in the world by sending Jesus, but rather that Jesus \"synched up with\" God as a human being. The idea is that Jesus has been the only human being to ever successfully pull this off, and we should all try to imitate Jesus imitating God.", "created_utc": "1664055178.0", "edited": "False", "id": "iprkddg", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_iprjaen", "score": "-1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "It's not that they exclude it from doctrine. The Old Testament is crucial to the narrative that Christianity tells. However, certain sects interpret it more (protestants) or less (Catholics) literally. \n\nReligion cannot be freed from interpretations. The problem is is that often the dumbest interpretations win out because they serve the biases and prejudices of those interpreting them. Like it would make sense for Christian warlords and colonizers to cite the Old Testament as justification for their behaviors. That doesn't mean that their interpretation is a good one. They simply have the most power and their interpretation becomes standard.", "created_utc": "1664054805.0", "edited": "False", "id": "iprjk02", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_iprilb3", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yeah you're right. Most religious people do believe that the infallibility of religious teachings is central to the religion. This is severely dangerous and dumb.", "created_utc": "1664054605.0", "edited": "False", "id": "iprj4c3", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_iprio0e", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I likewise strongly disagree with divine command theory and find it dangerous. And my argument is that many religions actually don't rely on divine command theory. Some, like Islam, certainly do. But to rely on divine command theory your religion needs to posit a supernatural being that actually interferes in the world. Contrary to popular belief, Christianity does not argue for the existence of such a God, at least many interpretations don't. Neither do religions like Buddhisms, Taoism, etc.", "created_utc": "1664054386.0", "edited": "False", "id": "iprimn4", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_ipri6w8", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Oh yeah there is some bad stuff in the Bible. Don't disagree with that. But the Bible shouldn't be taken in the same way as the Quran is. The Bible itself is an interpretation of what early thinkers thought Christianity should be. All interpretations are fallible.\n\nAlso, the Old Testament shouldn't be understood literally. It is a story just as any other piece of literature. And yes, I know. People take it literally and do bad shit with it", "created_utc": "1664053985.0", "edited": "False", "id": "iprhqso", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_iprh96m", "score": "-8", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I would agree that religion is used as a justification for all of those things. However, it is not religion itself that is the problem. \n\nHow lefties view religion is similar to how most people see communism. Most people think communism is the USSR and China, and since USSR and China are bad, that must mean communism is bad.", "created_utc": "1664053659.0", "edited": "False", "id": "iprh11k", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_iprdgz1", "score": "-18", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I apologize for the incoming effort post. \n\n(1) So he seems to believe that religion is inherently dangerous because it necessitates an allegiance to a supernatural being, and whatever that supernatural being commands is right and just.\n\nThis is a valid critique in some ways. First, there are some religions that are like this. For example, to be a Muslim requires an unquestioning and dogmatic allegiance to the Quran, which is understood to be the literal word of Allah. As that guy in the debate said the other day, if Allah commanded porn to be good, he would think porn is ok. Second, I think that many \"religious\" people believe that what it means to be religious is to be allegiant to a supernatural being in an uncritical fashion. You see this with almost all Christians. Most Christians have zero clue why they believe the things that their religion tell them to believe.\n\nHowever, Christianity at its core is not about an irrational subservience. In fact, Christianity holds that humans have the freedom to follow Jesus or not, and their choice has no bearing on their value as a human being. What ruins religions like Christianity is not Christianity itself, but rather people being dangerously dumb in interpreting it.\n\n(2) That Christianity isn't based.\n\nLike I said, it's Christians that make Christianity bad. At its core, Christianity is literally socialism. That's right, Jesus was the first socialist theorist. Even if you don't believe in the metaphysical claims of Christianity (which I don't), I think that everyone should take Jesus's teachings to heart. At the end of the day, being Christlike should be the goal for all of us lefties.\n\n(3) That Christianity is not the root of modern social justice (not sure Vaush ever talked about this, but it is an issue in atheist discourse)\n\nNietzsche was the only true atheist. Nietzsche called out Christianity for what it actually is: a movement concerned with the suffering of victims. Nietzsche fundamentally disagreed that we should care for the oppressed, but he correctly identified that the reason why so many of us do care is because of 2000 years of Christianity. Prior to Christianity, no one gave a single fuck about advocating for marginalized groups. And yes, Christians notoriously have genocided the fuck out of various populations. But the Christian concern for victims, as an idea, has infiltrated our collective consciousness for the past 2000 years and dramatically changed our worldview as a species. René Girard writes extensively on this in his mimetic theory; he writes specifically on how Christianity is an anti-religion that abolished human sacrifice and exposed the scapegoating of marginalized individuals  (it's too much to get into here but an incredible theory).\n\n&#x200B;\n\ntl;dr: Religion inherently is not bad, it is people who follow religion that make it bad. Christianity is based.", "created_utc": "1664053474.0", "edited": "False", "id": "iprglz4", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t1_ipraus0", "score": "-18", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Religion. He, and most lefties, just have an oversimplified understanding of it. As someone who studied theology in college, it’s kind of frustrating. I’m not even particularly religious I just like theology as a field of study.", "created_utc": "1664048544.0", "edited": "False", "id": "ipr5f25", "is_submitter": "False", "link_id": "t3_xn1z9s", "parent_id": "t3_xn1z9s", "score": "72", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Bad bunny is so based", "created_utc": "1664041851.0", "edited": "False", "id": "ipqprjv", "is_submitter": "False", "link_id": "t3_xmb9c9", "parent_id": "t3_xmb9c9", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Looking good. Can’t give advice, but like the back tat. Does it have to do with Poland?", "created_utc": "1664038140.0", "edited": "False", "id": "ipqgxqf", "is_submitter": "False", "link_id": "t3_xm73x8", "parent_id": "t3_xm73x8", "score": "2", "subreddit": "swoletariat", "subreddit_id": "t5_35qx1"}, {"author": "notblackmachete", "body": "She pretty much asked him why he didn’t accept Vaush’s debate invitation", "created_utc": "1663937340.0", "edited": "False", "id": "iplad7m", "is_submitter": "False", "link_id": "t3_xlkqfs", "parent_id": "t3_xlkqfs", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I would guess that you don’t “need to” for most programs. That being said, it might be harder to get a forensic postdoc if you don’t have research experience in forensic psych.", "created_utc": "1663885290.0", "edited": "False", "id": "ipj1lnf", "is_submitter": "False", "link_id": "t3_xldi5y", "parent_id": "t3_xldi5y", "score": "2", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "I just got banned from going over there and trolling about horse cocks. I couldn’t help myself sorry", "created_utc": "1663868163.0", "edited": "False", "id": "iphuane", "is_submitter": "False", "link_id": "t3_xl6ee6", "parent_id": "t3_xl6ee6", "score": "41", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I actually like doctor mike lol. I think you can tell when someone is citing their credentials to garner undue respect. Idt doctor like or Vaush do that. I’m thinking more of people like Debra soh the terf", "created_utc": "1663867253.0", "edited": "False", "id": "iphrvi9", "is_submitter": "True", "link_id": "t3_xl305u", "parent_id": "t1_iphqgkx", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Idk. If u actually read theory you would know that Lenin was a big fan of shredding asses to shreds. Trotsky writes about this in “The Revolution Betrayed.”", "created_utc": "1663866217.0", "edited": "False", "id": "iphp3qu", "is_submitter": "False", "link_id": "t3_xl5eau", "parent_id": "t1_ipho884", "score": "-3", "subreddit": "socialism", "subreddit_id": "t5_2qjii"}, {"author": "notblackmachete", "body": "Can pussys be banned? Pussys aren’t socialists. The chad socialists of the past century would violently pummel your asshole with their giant horsecocks for whining so much.", "created_utc": "1663865536.0", "edited": "False", "id": "iphn9tq", "is_submitter": "False", "link_id": "t3_xl5eau", "parent_id": "t3_xl5eau", "score": "-6", "subreddit": "socialism", "subreddit_id": "t5_2qjii"}, {"author": "notblackmachete", "body": "Never said a bachelors degree doesn’t matter. Citing a bachelors degree is just one step better than citing your high school education. So it’s not much. \n\nI say Vaush’s knowledge is advanced bc you can go beyond what you learn in undergrad, which Vaush clearly has. Dude literally does whole ass research streams. I have a ton of respect.", "created_utc": "1663865100.0", "edited": "False", "id": "iphm27h", "is_submitter": "True", "link_id": "t3_xl305u", "parent_id": "t1_iphfc6t", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Damn Vaushites should know how analogies work.", "created_utc": "1663864738.0", "edited": "False", "id": "iphl2nq", "is_submitter": "True", "link_id": "t3_xl305u", "parent_id": "t1_iphknkv", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "To be a conservative you have to either be consciously hateful or too stupid to realize that what you support leads to hate (like this guy)", "created_utc": "1663860556.0", "edited": "False", "id": "ipha0cy", "is_submitter": "False", "link_id": "t3_xl2ra8", "parent_id": "t3_xl2ra8", "score": "10", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "notblackmachete", "body": "It’s not a lack of respect. I respect anyone who goes to college and actually is invested in what they are studying. But when it comes to specialization in fields like sociology, philosophy, biology, etc, a bachelors degree is like a grade school education. Even getting a PhD doesn’t make you an expert. If you’ve ever gotten an undergrad degree, you should know just how little you actually learn about your field of study when you’re done. \n\nAs mentioned though, I think Vaush’s knowledge is way beyond what you would learn as a sociology major. That’s because he has put in tremendous amounts of study outside of college. For this reason, I think it’s silly that he even talks about his degree.", "created_utc": "1663859887.0", "edited": "False", "id": "iph89av", "is_submitter": "True", "link_id": "t3_xl305u", "parent_id": "t1_iph4ksm", "score": "-5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I just think that he proves his knowledge enough as is. Citing his degree is an optical flaw of his imo. You really never see people with advanced degrees, let alone bachelors, talk about their phds or MDs unless they’re hacks like JBP or that one fucking idiot doctor who advocates raw carnivore diet. Like it’s a red flag to me if a doctor or someone with a doctorate has their profiles on social media start with “Dr. X”", "created_utc": "1663859645.0", "edited": "False", "id": "iph7myr", "is_submitter": "True", "link_id": "t3_xl305u", "parent_id": "t1_iph5cqa", "score": "-3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Artemy and pigeon canceled", "created_utc": "1663856537.0", "edited": "False", "id": "ipgzp6m", "is_submitter": "False", "link_id": "t3_xkxqsz", "parent_id": "t3_xkxqsz", "score": "12", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "It looks fine. One time I fed mine a crazy amount of arugula and he just pooped complete green slush. Lots of greens make their poop less solid in my experience", "created_utc": "1663812905.0", "edited": "False", "id": "ipf0t35", "is_submitter": "False", "link_id": "t3_xknxyo", "parent_id": "t3_xknxyo", "score": "1", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Psyop sub", "created_utc": "1663772199.0", "edited": "False", "id": "ipc6wen", "is_submitter": "False", "link_id": "t3_xk36uo", "parent_id": "t3_xk36uo", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I very highly recommend the book “Insider's Guide to Graduate Programs in Clinical and Counseling Psychology.” \nhttps://www.amazon.com/gp/aw/d/B09RBCSK5P/ref=tmm_kin_swatch_0?ie=UTF8&qid=&sr=\n\nThis book lays out exactly what you need to do during college to put yourself in the best position to apply to grad schools. It’s a super easy read, and you don’t need to read it all in one go because certain sections are meant for your junior/senior years as an undergrad. \n\nI just cannot recommend it enough. It’s hard to find unified information anywhere about applying to grad schools. This book has it all right there, and it’s based on research that literally focuses on best practices when applying to grad school. \n\nAlso, I just went through the process of applying (I’m a first year PhD student), so feel free to message me!", "created_utc": "1663760717.0", "edited": "False", "id": "ipbhe41", "is_submitter": "False", "link_id": "t3_xjq75r", "parent_id": "t3_xjq75r", "score": "6", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "I suffered brain damage from that", "created_utc": "1663639567.0", "edited": "False", "id": "ip57mcx", "is_submitter": "False", "link_id": "t3_xivoe3", "parent_id": "t3_xivoe3", "score": "22", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I would broadly be familiar with social psych literature + learning theories. Not that this literature was written in a collaboration between philosophers and psychologists. Rather, learning theories and social psychology have dramatic impacts on the free will debate.\n\nPersonally, I became a total free will skeptic after learning about social psych in undergrad. I actually find it hard to believe how one can be educated in psychology and still hold on to a firm belief in free will.", "created_utc": "1663618154.0", "edited": "False", "id": "ip3w0qr", "is_submitter": "False", "link_id": "t3_xicimm", "parent_id": "t3_xicimm", "score": "3", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "The scientific method, as most people understand it, is based on an epistemological assumption that humans actually can discover things about the world through controlled observation. \n\nNote: I actually disagree with this common understanding. I do not believe that science gets us to truth since all scientific inquiry is mediated through a human being, and human beings did not evolve to perceive the world as it is. Rather, we perceive the world in a way that is useful for our survival. Thus, science does not get us to truth but rather to what is most useful given certain ends that we define. \n\nPsychology is actually, in my opinion, much more humble about scientific inquiry than many STEM fields. STEM people tend to go with the view of science that I mentioned first - a scientism that holds that scientific inquiry leads us to absolute truth. \n\nNonetheless, note how all of this is philosophy (albeit sloppy philosophy bc I’m typing this up quick before class). Any meta-discussion of the field of psychology, or any field, requires delving into philosophy.", "created_utc": "1663617908.0", "edited": "False", "id": "ip3vfwa", "is_submitter": "False", "link_id": "t3_xicimm", "parent_id": "t1_ip3ly0k", "score": "7", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "Thanks! These are helpful examples", "created_utc": "1663549908.0", "edited": "False", "id": "ip08ln2", "is_submitter": "True", "link_id": "t3_xhwr7z", "parent_id": "t1_ip078o9", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "Thank you this is very helpful. I try to avoid Caribbean Spanish, but I do like bad bunny even though I can barely understand him. My girlfriend is actually Puerto Rican and trying to understand her parents is painful. I’ve gotten a lot better at understanding PR Spanish but it’s still rough.", "created_utc": "1663549813.0", "edited": "1663550000.0", "id": "ip08drb", "is_submitter": "True", "link_id": "t3_xhwr7z", "parent_id": "t1_ip05puw", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "It depends on the specific PI you are applying to. Some PIs, especially at super competitive schools, will likely not accept anyone that doesn’t have direct experience with their area of research focus.  That being said, I wouldn’t want to work with someone who is so closed off. They are probably not going to be great mentors. \n\nI would say that the majority of PIs are very open to taking you in even if you don’t have specific research experience in their area.", "created_utc": "1663511051.0", "edited": "False", "id": "ioxhwna", "is_submitter": "False", "link_id": "t3_xg9hfs", "parent_id": "t3_xg9hfs", "score": "1", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "I think it depends what kind of university you go to for undergrad. I went to a small liberal arts college and completed two research studies, but neither of them got published. We simply did not have enough resources and manpower to go through the work of getting the first one published. And the second one (my honors thesis) was completely of my own design (from idea to write up) so it had too many methodological and theoretical flaws to publish imo.\n\nIf you go to a big school and join a high output research lab as an undergrad, I think it is very possible to get your name on a publication. Currently, I am in such a lab doing my PhD, and I am leading a team of undergrads and masters students on a project. It is likely that some of these students will get their name on a publication.  My lab has 27 ongoing projects and there are only about 6 PhD students to lead on them, so we need a ton of help from undergrads. Thus, these undergrads will likely get some recognition on papers.", "created_utc": "1663510820.0", "edited": "False", "id": "ioxhcxr", "is_submitter": "False", "link_id": "t3_xgokez", "parent_id": "t3_xgokez", "score": "5", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "I agree, the pure altruism discussion is stupid from a political perspective. It truly makes no difference to the world if everyone was altruistic for their own gain or not. The outcomes would remain the same. If you’re the type of person who brings up pure altruism as an attack against the idea of helping others, you’re so lost.", "created_utc": "1663508495.0", "edited": "False", "id": "ioxc77q", "is_submitter": "False", "link_id": "t3_xgwq7g", "parent_id": "t1_iourp4b", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "People who are super poor also cannot give two shits about politics. This is an intentional consequence of capitalism (I.e., suppressing class consciousness through horrible working conditions).", "created_utc": "1663508051.0", "edited": "False", "id": "ioxb9w3", "is_submitter": "False", "link_id": "t3_xh9vln", "parent_id": "t1_iowft9e", "score": "28", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I never went to the vet with it specifically. But when I went for something else the vet said it was fine and the only problem is that substrate will get stuck in his mouth.\n\nBut I would say that yours looks a bit worse than what my guy had. So I would go to the vet with it", "created_utc": "1663432046.0", "edited": "False", "id": "iotaggv", "is_submitter": "False", "link_id": "t3_xg6ruc", "parent_id": "t1_iot27w6", "score": "2", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Mine fucked up his jaw biting me too once. His mouth is still deformed but it got better over time", "created_utc": "1663416442.0", "edited": "False", "id": "iosd22h", "is_submitter": "False", "link_id": "t3_xg6ruc", "parent_id": "t1_ioqertx", "score": "3", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "\nPoland claims Haiti bc the first Haitian head of state gave polish people the N word pass:\n\n“Haiti's first head of state Jean-Jacques Dessalines called Polish people \"the White Negroes of Europe\", which was then regarded a great honour, as it meant brotherhood between Poles and Haitians.”", "created_utc": "1663345197.0", "edited": "False", "id": "ioolf0n", "is_submitter": "False", "link_id": "t3_xf9a7o", "parent_id": "t3_xf9a7o", "score": "-2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Look at that photo of him with the Starbucks. This dude so fruity. He just like me fr", "created_utc": "1663245084.0", "edited": "False", "id": "ioiti67", "is_submitter": "False", "link_id": "t3_xevhw5", "parent_id": "t3_xevhw5", "score": "84", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Since democracy can be used against itself to be dismantled, anti-democratic actors should be banned from participating in a democratic political system.\n\nI kind of hold a similar position towards bigoted groups. I don’t necessarily think we should allow them to participate in democratic politics, but I probably lean towards allowing them to have free speech. Without the ability to engage in politics, such groups would effectively be neutered. So if they’re in such a pathetic position, I don’t think any more needs to be done", "created_utc": "1663242783.0", "edited": "False", "id": "ioip5cr", "is_submitter": "False", "link_id": "t3_xekoal", "parent_id": "t3_xekoal", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "White people only go for other races because they can’t suppress their colonizer gene. So if all interracial relationships are an act of colonization, do the racial minorities have the right to ensue violence on their partners????? Let’s ask PF", "created_utc": "1663242051.0", "edited": "False", "id": "ioinu0u", "is_submitter": "False", "link_id": "t3_xetfph", "parent_id": "t3_xetfph", "score": "30", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I just make it fresh everytime. This works since I usually mix it in with his normal food", "created_utc": "1663194709.0", "edited": "False", "id": "iogg2s4", "is_submitter": "False", "link_id": "t3_xe6mhz", "parent_id": "t3_xe6mhz", "score": "1", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "Poland claims Haiti bc the first Haitian head of state gave polish people the N word pass:\n\n“Haiti's first head of state Jean-Jacques Dessalines called Polish people \"the White Negroes of Europe\", which was then regarded a great honour, as it meant brotherhood between Poles and Haitians.”", "created_utc": "1663193161.0", "edited": "False", "id": "iogcooy", "is_submitter": "False", "link_id": "t3_xeahsx", "parent_id": "t3_xeahsx", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yes", "created_utc": "1663094026.0", "edited": "False", "id": "ioagrqa", "is_submitter": "False", "link_id": "t3_xd6sb8", "parent_id": "t1_io9lnfs", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Poland claims Haiti bc the first Haitian head of state gave polish people the N word pass:\n\n“Haiti's first head of state Jean-Jacques Dessalines called Polish people \"the White Negroes of Europe\", which was then regarded a great honour, as it meant brotherhood between Poles and Haitians.”", "created_utc": "1663076812.0", "edited": "False", "id": "io99go9", "is_submitter": "False", "link_id": "t3_xd6sb8", "parent_id": "t3_xd6sb8", "score": "15", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Poland claims Haiti since one time a Haitian politician gave polish people the n word pass:\n\n“Haiti's first head of state Jean-Jacques Dessalines called Polish people \"the White Negroes of Europe\", which was then regarded a great honour, as it meant brotherhood between Poles and Haitians.”\n\nhttps://en.m.wikipedia.org/wiki/Polish_Haitians", "created_utc": "1663035307.0", "edited": "1663035521.0", "id": "io7enaz", "is_submitter": "False", "link_id": "t3_xcf8yj", "parent_id": "t3_xcf8yj", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Beau Lotto! I read one of his books and it tremendously influenced my understanding of these issues.", "created_utc": "1662666917.0", "edited": "False", "id": "inmromi", "is_submitter": "True", "link_id": "t3_x8iasd", "parent_id": "t1_inlzyqu", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "The reason why I tend to call this type of position anti-realism is because of how different it is to how a lot of other academics in STEM view their work. I think that a lot of physicists, biologists, etc. believe that their work literally is uncovering “truth.” There seems to a be a sort of hubris and scientism in STEM that takes on an ultra realist tone. My field is psychology and we tend to be a bit more humble about the relationship between our work and “truth.”", "created_utc": "1662641773.0", "edited": "False", "id": "inkzxm7", "is_submitter": "True", "link_id": "t3_x8iasd", "parent_id": "t1_injshps", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m not sure whether he actually believes in objective reality. We didn’t really get to go that deep since this isn’t a philosophy class. But as a former philosophy major, his examples really caught my attention and made it seem that he has some philosophical acumen. \n\nI would guess, though, that he holds a position somewhat like this: there is an objective reality but  our senses and cognitive processes receive that reality through an extremely distorted prism. From this, it would follow that science may be getting us to map on a correspondence (although an imperfect one) between our perceptions and reality. I am guessing that this is the belief my professor holds. It seems the most reasonable.", "created_utc": "1662607656.0", "edited": "False", "id": "injl4a6", "is_submitter": "True", "link_id": "t3_x8iasd", "parent_id": "t1_inix1w1", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "The thing is is that if we had a bunch of class reductionist in power many of the things that disproportionately affect marginalized groups would be resolved. Like maybe class reductionists don’t fully grasp the complexities of intersectionality, but resolving class disparities would help to dissolve disparities between, for example, White and Black folk.\n\nI think that wokescolding taken to its extreme is similar to religious fanaticism which very quickly leads to authoritarianism", "created_utc": "1661903598.0", "edited": "False", "id": "imgfxgx", "is_submitter": "False", "link_id": "t3_x1tsbe", "parent_id": "t3_x1tsbe", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "When you’re looking for a lifetime partner one of the things that you would find attractive is how good of a parent that person would be. It’s not weird at all to say the things Jeff was saying. I personally wouldn’t say what he said so early but whatever. I think he was being very genuine and opening up to her.", "created_utc": "1661466256.0", "edited": "False", "id": "ilslyvw", "is_submitter": "False", "link_id": "t3_wxq9al", "parent_id": "t3_wxq9al", "score": "-8", "subreddit": "LoveIslandUSA", "subreddit_id": "t5_11v5r4"}, {"author": "notblackmachete", "body": "There’s actually a study that found that increases In chest mass over time in men were associated with an increased endorsement that social inequity is justifiable. \n\nIt really does make sense. Fitness requires a lot of independent effort, and once you achieve success you rightfully attribute that success to yourself. But if you’re dumb, you generalize what you learned in the gym to social issues more broadly. For example “why can’t poor people just work hard to not be poor?” “If I was able to get my dream body on my own, why can’t a black person just get up on on out of the hood?”\n\nIt seems plausible and very likely that fitness promotes a sort of survivorship bias in many people that drives them to reactionary positions.\n\nI can’t find the original article that I’m talking about but here’s a similar one: https://onlinelibrary.wiley.com/doi/abs/10.1111/pops.12505", "created_utc": "1661454232.0", "edited": "False", "id": "ilrro4z", "is_submitter": "False", "link_id": "t3_wx848g", "parent_id": "t3_wx848g", "score": "6", "subreddit": "swoletariat", "subreddit_id": "t5_35qx1"}, {"author": "notblackmachete", "body": "Queer baiting is definitely real, but like If im a famous cishet person and act and dress super flamboyant and people take that as me trying to bait them into thinking im queer that’s a them problem yknow. Like anyone should be able to express themselves regardless of sexual or gender identity how they please. I’m sure some people do this maliciously but since people are mentally handicapped they generalize all queer expression by cishet people to be queer baiting.", "created_utc": "1661393588.0", "edited": "1661393787.0", "id": "iloit6p", "is_submitter": "False", "link_id": "t3_wwt7sn", "parent_id": "t1_ilohfo8", "score": "10", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yep totally. It’s frustrating when people like Harry Styles or Bad Bunny get accused of queer baiting for wearing skirts and shit. Like I don’t get it. Aren’t we supposed to be trying to abolish gender here?", "created_utc": "1661372255.0", "edited": "False", "id": "iln2u3z", "is_submitter": "False", "link_id": "t3_wwt7sn", "parent_id": "t3_wwt7sn", "score": "62", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Oswald Mosley is depicted in s5 and s6 of peaky blinders. I would check out his speech in s5. It seems to have been mirrored exactly off of trump speeches. But tbh all fascists sound the same. Worth a watch tho.", "created_utc": "1661269375.0", "edited": "False", "id": "ilgvzji", "is_submitter": "False", "link_id": "t3_wvolng", "parent_id": "t3_wvolng", "score": "14", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "My skink does this during breeding season but only when he’s busting a nut along with his poop. I would check if there’s a sperm plug", "created_utc": "1658757869.0", "edited": "False", "id": "ihkur6t", "is_submitter": "False", "link_id": "t3_w7cinj", "parent_id": "t3_w7cinj", "score": "13", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "It’s whatever, but I don’t see why anyone would choose neopronouns over they/them unless they’re tryna get some attention or trying to be provocative.", "created_utc": "1658391558.0", "edited": "False", "id": "ih0x58i", "is_submitter": "False", "link_id": "t3_w45hsd", "parent_id": "t3_w45hsd", "score": "11", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Learn a language. If you’re American, you truly miss out on the joys of learning and being able to use another language bc of our shit education system. Learning a language takes a lot of time and effort, but the rewards are so worth the struggle. It is so rewarding to be able to experience the world through another language. When you learn a new language mundane things such as music, movies, or books take on an entirely new flavor. It’s kind of like being a kid again who has the joy of experiencing everything for the first time. Also it’s good for your neurological health.", "created_utc": "1657724545.0", "edited": "False", "id": "ifzzlun", "is_submitter": "False", "link_id": "t3_vy1nhu", "parent_id": "t3_vy1nhu", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Meal prepping is the shit if you do it with the right kind of food like you said. Soups and stews and rice dishes actually tend to taste better after a day or two imo. Also very easy to portion out.", "created_utc": "1657724241.0", "edited": "False", "id": "ifzyu5t", "is_submitter": "False", "link_id": "t3_vy1nhu", "parent_id": "t1_ifzkrog", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I disagree. It is about both your bodily autonomy and also everyone else’s. It’s just that your right to bodily autonomy ought to be disregarded if acting from that right would cause harm to others.\n\nThis is why the “my body, my choice” argument kind of sucks in my opinion, at least how it is presented most of the time. Because if you get down to it, you’re gonna be stuck in a philosophical discussion about whether a fetus is a person or not. If the fetus is a person, then your right to bodily autonomy becomes nullified as acting from it would cause harm to another person. So (1) you must either deny that a fetus is a person (and also figure out where the cutoff is during the pregnancy). Or (2), argue from a consequentialist stance that having a law that allows for the killing of fetus’s would produce net good. I personally prefer option 2 as it takes all of the strongest points of pro-choice arguments into account. I will say, though, that it is not an optically appealing argument at all. For the sake of public discourse, I would prefer to just say “my body, my choice” and leave it at that, even if I think it is a shit philosophical position.", "created_utc": "1657560802.0", "edited": "False", "id": "ifqx53w", "is_submitter": "False", "link_id": "t3_vwmy2z", "parent_id": "t1_ifqr407", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Think of not getting vaccinated as equivalent to having a condition in which swords grow out of your body. Clearly, this would be a severe problem for people around you. You can bitch about how you shouldn’t have to be forced to remove these swords by claiming it’s your bodily autonomy. But remember, your rights stop where others’ rights begin. You as an unvaccinated person, like the person with swords growing out of their body, are essentially a person walking around about to commit manslaughter. Therefore, your right to bodily autonomy is nullified in these cases.\n\nThink of an abortion like shooting yourself in the foot for fun. Even if it’s harmful, the only person you are harming is yourself. You have the god given right to mutilate yourself as you see fit. (Note: I don’t actually think abortion is like self-harm, I’m just providing this example to compare the different types of harm that might enter the conversation)", "created_utc": "1657560196.0", "edited": "False", "id": "ifqvkhr", "is_submitter": "False", "link_id": "t3_vwmy2z", "parent_id": "t3_vwmy2z", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "It feels like a fever dream", "created_utc": "1657559756.0", "edited": "False", "id": "ifqufdy", "is_submitter": "False", "link_id": "t3_vwlx3b", "parent_id": "t1_ifqlu63", "score": "33", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "What about if a White person opens up an Asian restaurant in a town where there are no Asians. This person loves Asian food, and they want to share it with their community. Do you think this would be problematic?", "created_utc": "1657556748.0", "edited": "False", "id": "ifqmnyh", "is_submitter": "False", "link_id": "t3_vwk9bd", "parent_id": "t1_ifqin4u", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I have a question about this. I work for a Turkish family that owns a pizza shop. Are they doing cultural appropriation of American-Italian culture because this is their business?\n\nOne of my favorite restaurants near me is an Asian fusion place run by White people. Is that cultural appropriation?", "created_utc": "1657553919.0", "edited": "False", "id": "ifqfjj5", "is_submitter": "False", "link_id": "t3_vwk9bd", "parent_id": "t1_ifq9vny", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This is deeply disturbing", "created_utc": "1657509110.0", "edited": "False", "id": "ifoex11", "is_submitter": "False", "link_id": "t3_vw7hmk", "parent_id": "t3_vw7hmk", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This is what every “let’s not freak out” type mf says before a genocide actually happens. Your perspective is ahistorical. Then with the luxury of history, people like you look back at pre-Nazi Germany and think the Jews and Germans were so dumb for not knowing what was about to happen. But you would’ve been that dumb type of person yourself telling the Jews to relax.", "created_utc": "1657508822.0", "edited": "False", "id": "ifoecw0", "is_submitter": "False", "link_id": "t3_vvk2an", "parent_id": "t1_ifnehth", "score": "2", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "notblackmachete", "body": "Optical nightmare regardless of what merit the discussion actually has. Call me crazy, but I personally don’t think the words “White privilege” and “Anne Frank” should ever appear in a sentence together.", "created_utc": "1657499004.0", "edited": "False", "id": "ifnub91", "is_submitter": "False", "link_id": "t3_vw54t7", "parent_id": "t3_vw54t7", "score": "47", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Missed the empire part lol. Thought we were talking about the current state of Russia", "created_utc": "1657479986.0", "edited": "False", "id": "ifmnpsa", "is_submitter": "False", "link_id": "t3_vvsg80", "parent_id": "t1_ifmmwnd", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Probably doesn’t bother most people. But I’ve been told many times to not use “guys” when referring to a mixed gender group. I personally don’t find it to be a big deal, but I avoid it when speaking in formal settings to not piss anyone off", "created_utc": "1657476205.0", "edited": "False", "id": "ifmf08o", "is_submitter": "False", "link_id": "t3_vvr9r4", "parent_id": "t1_ifmdupf", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yep and there are also noun declensions in Polish which are also influenced by gender. I pity whoever actually has to learn this language from scratch. I’m lucky I’m a native speaker, and even I make a ton of mistakes while speaking because of the complexity lol. \n\nI think a lot of Polish people would lose their minds if you told them to complicate their language even more by trying to be respectful to NB folks. It would take a lot of effort to get people on board, but I think it’s an inevitability as long as progress keeps moving forward", "created_utc": "1657468148.0", "edited": "False", "id": "iflw6et", "is_submitter": "False", "link_id": "t3_vvr9r4", "parent_id": "t1_iflu649", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Polish works the exact same way. Everything is gendered. I was just saying that the masculine doubles as the neuter not that it actually is the neuter.\n\nPolish is even more gendered than Spanish actually. Verbs (in the past tense) are conjugated based on the gender of the noun. However, there is a neuter gender (not used to refer to groups, masculine is) which you can use to adapt your language when speaking about NB people. However, it would be extraordinarily unnatural to use a neuter verb conjugation when speaking about a human. But I think you would have to just learn to adapt your language.", "created_utc": "1657466495.0", "edited": "False", "id": "iflsdr5", "is_submitter": "False", "link_id": "t3_vvr9r4", "parent_id": "t1_iflr6n3", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I fully get how weird it is upon reflection. But I think that if you accept that the 3rd person plural masculine doubles as neuter, it’s not that big of a deal. It probably is the case that the origins of this quirk of these languages originate in sexism. I just don’t think that people think about this too much nowadays. Like I said with myself personally, I don’t think many speakers of gendered languages even know that they’re using masculine endings to refer to mixed groups until they learn about grammar. If they don’t realize this, there’s no way that they can find it exclusionary. To find something exclusionary you have to be thinking about it regularly, and we just don’t think about this aspect of our language consciously. And when you become aware of it, I feel like you honestly have to manufacture your outrage. It really seems like you would be making something out of nothing. \n\nI just want to emphasize that this is my opinion informed by my perspectives, and I am open to amending it.\n\nI guess you would have to prove that this aspect of the language actually causes people to suffer. If you could demonstrate that (like how with English we know that using “guys” makes non-males feel annoyed), then I would be on board with some efforts to reform the language.", "created_utc": "1657464871.0", "edited": "False", "id": "iflon44", "is_submitter": "False", "link_id": "t3_vvr9r4", "parent_id": "t1_iflkziu", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Bringing up “you guys” is a good way to think about this some more. The thing in English is that grammatical gender doesn’t exist so saying “you guys” is kind of an oddity, if that makes sense. Many of us can’t help but notice the masculine nature of “you guys.” \n\nBut in a language like Spanish, the plural of every mixed gender group of any animate thing is masculine. It’s just littered throughout the language whether you are talking about dogs, birds, or people. That’s why it’s just not that unusual and doesn’t really make anyone blink twice. \n\nAlthough I feel strongly about this, I would love to hear the perspective of NB and trans people who speak languages like Spanish.", "created_utc": "1657461353.0", "edited": "False", "id": "iflgwom", "is_submitter": "False", "link_id": "t3_vvr9r4", "parent_id": "t1_iflg9hz", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "To me, “Latinx” seems to very much be a term that well-meaning people who do not speak a language with grammatical gender would use. \n\nI am a native speaker of Polish and I also have been learning Spanish for a year. Both of these languages have grammatical gender.\n\nThere is a misconception that grammatical gender actually has anything to do with human gender. When we speak these languages, it is not like we are thinking that this object is manly or this object is womanly. \n\nWe also don’t think this way when we use masculine noun endings to refer to a group of people. When Spanish speakers say “Latinos” to talk about a group of Latinos (or “ellos” to a group of people generally), they are in no way associating these word with patriarchy or whatever. In fact, as a polish speaker, I didn’t even realize I used masculine word endings to refer to groups of people (e.g., they = oni; 3rd person plural masculine version of them) until I started learning Spanish. That is how much we don’t even think about this shit. I really don’t think that any speaker of a language with grammatical gender could even fathom these words to be exclusionary. It just doesn’t make sense to us ,because we don’t think about it that way.\n\nBasically, this language only seems exclusionary to people who don’t speak languages with grammatical gender. I can understand why a progressive English speaker would feel the need to address such issues in a language. But you have to remember that a non-speaker has literally zero clue as to how we as native speakers think about these concepts. To us, it just ain’t that deep. And we get a little frustrated when people use terms like “Latinx” because it somewhat indicates an ignorance of our languages.\n\nEdit: when I say “we” here I’m really speaking from my perspective and the perspectives of other people that I know. I am sure not all speakers feel the same way about this issue.", "created_utc": "1657460098.0", "edited": "1657468422.0", "id": "ifledpq", "is_submitter": "False", "link_id": "t3_vvr9r4", "parent_id": "t3_vvr9r4", "score": "13", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Southern culture is different from these things tho. You can be a lefty and still be super culturally southern. OP isn’t talking about political beliefs", "created_utc": "1657428179.0", "edited": "False", "id": "ifk716j", "is_submitter": "False", "link_id": "t3_vvj1wo", "parent_id": "t1_ifk4j92", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I don’t think it’s inherently any more cringe than any other culture. I think many of us find it cringe because of the political attitudes it is associated with. I think it’s a subconscious thing\n\nEdit: white people are dumb corny tho so u might be right", "created_utc": "1657425958.0", "edited": "False", "id": "ifk3as2", "is_submitter": "False", "link_id": "t3_vvj1wo", "parent_id": "t3_vvj1wo", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Spot on. Big “T” truth either doesn’t exist or is inaccessible given the limitations of how we perceive the world. The way in which a tortoise perceives the world isn’t any more or less accurate than how we perceive it. The only thing that makes humans special is that we have the capacity to actively manipulate our environment consciously to make it more or less useful to us. But our manipulations likely do not get us any closer to big “T” truth they only get us closer to a more robust understanding of little “t” truth, or what is most useful to our ends.", "created_utc": "1657419110.0", "edited": "False", "id": "ifjqipr", "is_submitter": "False", "link_id": "t3_vvfl9k", "parent_id": "t1_ifjpue1", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Interesting take. One of the ways in which you determine whether something is psychologically pathological is whether or not the behavior in question interferes with one’s interaction with their social environment. I would say that murdering a bunch of people is certainly a maladaptive form of interaction with one’s social environment\n\nThis doesn’t take away from the fact that such behaviors have sociological roots. Nonetheless, such behaviors can easily be defined as “mentally ill.” Let’s just say then that the sociological causes of these behaviors themselves are pathological.", "created_utc": "1657333465.0", "edited": "1657334009.0", "id": "iffcozc", "is_submitter": "False", "link_id": "t3_vuqhyc", "parent_id": "t3_vuqhyc", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m a clinical psych doctoral student, and this guy acts like an undergrad freshman who took one research methods class and thinks he can say anything he wants about human behavior using a veneer of science. Pure sophistry", "created_utc": "1657331387.0", "edited": "False", "id": "iff8i6w", "is_submitter": "False", "link_id": "t3_vunnll", "parent_id": "t3_vunnll", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Think of this as the output for a program like DALL-E but made for sentences. The input into this AI sentence generator was “Hegel + witchcraft + black women + twerking”", "created_utc": "1657315278.0", "edited": "False", "id": "ife9mws", "is_submitter": "False", "link_id": "t3_vudlzl", "parent_id": "t3_vudlzl", "score": "7", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Best: that gender does not influence conjugation. I am a native polish speaker, and it amazes me that for many verb forms in polish we have to differentiate between whether we are speaking about a man or woman doing an action. It’s especially interesting because we make these distinctions in the past tense but not in the present. Thank god that this doesn’t exist in Spanish. \n\nWorst: reflexive verbs. To bring up polish again, polish actually makes reflexive verbs much easier. We have one reflexive pronoun that is used for everything regardless of person or number. I don’t think it is that hard in Spanish, though. Also, I find understanding when to use “a,” “en,” “de” (and when not to use them) when linking verbs to each other or linking verbs to nouns in a sentence to be absolutely infuriating. The rules here seem to be arbitrary.", "created_utc": "1657314708.0", "edited": "False", "id": "ife89dv", "is_submitter": "False", "link_id": "t3_vu74lq", "parent_id": "t3_vu74lq", "score": "8", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "I completely agree. Making these distinctions would clear up so much confusion in my opinion", "created_utc": "1657311030.0", "edited": "False", "id": "ifdza5b", "is_submitter": "False", "link_id": "t3_vuhwep", "parent_id": "t1_ifdw54l", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I think the confusion comes from bad and unspecific terminology. What we call gender dysphoria should be renamed sex dysphoria. Gender dysphoria and sex dysphoria need not always occur together but often do. All you need is dysphoria in regards to either gender or sex to be trans. \n\nTrans also needs it be understood as an umbrella term as large as the umbrella of “LGBTQ” or “queer”", "created_utc": "1657308124.0", "edited": "1657308530.0", "id": "ifds4c5", "is_submitter": "False", "link_id": "t3_vuhwep", "parent_id": "t3_vuhwep", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Just watched this. As a clinical psychology doctoral student, I can say confidently that JBP is a disgrace to the field. Since my freshman year of undergrad, the necessity of relying on empirical evidence when making claims on human behavior has been pounded into me. Im sure Peterson learned the same during his training. So it blows my mind that JBP now makes wild claims about the psychology of trans people and transitioning without any evidence. Instead he relies on his own “analysis as a clinician.” WE ARE LITERALLY TAUGHT TO NOT RELY ON OUR OWN “CLINICAL ANALYSES.” This guy would be laughed out of any room of clinical psychologists", "created_utc": "1657301778.0", "edited": "False", "id": "ifdc6x4", "is_submitter": "False", "link_id": "t3_vud61x", "parent_id": "t3_vud61x", "score": "38", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Vaush should become the democratic whip and threaten joe manchin with getting whipped by a giant horse cock", "created_utc": "1657300705.0", "edited": "False", "id": "ifd9f98", "is_submitter": "False", "link_id": "t3_vuacps", "parent_id": "t3_vuacps", "score": "4", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Sure but if you have autism and you exhibit such behaviors it is likely due to the autism. What the original commenter said is the equivalent of insulting a schizophrenic person for their delusions and disordered speech without acknowledging that they have schizophrenia.", "created_utc": "1657299358.0", "edited": "False", "id": "ifd5xyi", "is_submitter": "False", "link_id": "t3_vu8m51", "parent_id": "t1_ifd5jjh", "score": "4", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "*autism\n\nEdit: don’t really understand the downvotes. Deficits in social cognition, like the ones Vaush exhibits, are strongly associated with ASD, which Vaush has. If you downvote you’re ableist", "created_utc": "1657293778.0", "edited": "1657299021.0", "id": "ifcr9ak", "is_submitter": "False", "link_id": "t3_vu8m51", "parent_id": "t1_ifby1u2", "score": "8", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Explain yourself", "created_utc": "1657293725.0", "edited": "False", "id": "ifcr4ar", "is_submitter": "False", "link_id": "t3_vu8m51", "parent_id": "t1_ifcnp8e", "score": "4", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I really like your emphasis here on the effects that our cultural-linguistic environment has on the ways in which we perceive the world. In regards to the periodic table, it is possible that an alien species would not even need to bother with constructing such a schematic to support their civilization. It’s hard to imagine how this might be, but this difficulty in imagination is precisely due to the constraints placed upon us by our linguistic environment. A good movie that makes you think about these topics is “Arrival.”", "created_utc": "1657248609.0", "edited": "False", "id": "ifamkve", "is_submitter": "False", "link_id": "t3_vtw0iw", "parent_id": "t3_vtw0iw", "score": "9", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I watched it without the audio at first and thought a dem had finally sacked up and decided to properly attack republicans. Sadly no", "created_utc": "1657228468.0", "edited": "False", "id": "if9cgjh", "is_submitter": "False", "link_id": "t3_vtnoyz", "parent_id": "t1_if9at8h", "score": "9", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Remember, some people are on the left by pure luck. Born in a different situation, they would be conservatives. The same thought processes are at play with some of these people", "created_utc": "1657228132.0", "edited": "False", "id": "if9bm31", "is_submitter": "False", "link_id": "t3_vtsof9", "parent_id": "t1_if99a5d", "score": "93", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m not too familiar with the intellectual origins of rule utilitarianism, but it definitely seems to be influenced by Kantian ethics. The main difference here is that a categorical imperative has no basis in whether or not following it would produce the greatest good for the greatest number (although some of Kant’s explanations of his examples of the categorical imperative in the “Grounding of the Metaphysics of Morals” sound a lot like rule utilitarianism to me). In a Kantian system, actions are deemed moral or not simply whether or not they come from duty, but duty need not have anything to do with producing positive outcomes.", "created_utc": "1657212410.0", "edited": "False", "id": "if86lht", "is_submitter": "False", "link_id": "t3_vsywku", "parent_id": "t1_if7yo58", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Nope. Because anyone can compete to win as long as they don’t have anti-democratic views. A fascist would simply get rid of democracy whereas my aim is to preserve it", "created_utc": "1657145054.0", "edited": "False", "id": "if4otgh", "is_submitter": "True", "link_id": "t3_vqjbfa", "parent_id": "t1_if4oidz", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Ah yes because critiques of economic systems and their effects on human well-being were invented by redditors and are solely discussed on Reddit", "created_utc": "1657140428.0", "edited": "False", "id": "if4dq5u", "is_submitter": "False", "link_id": "t3_vsduux", "parent_id": "t1_if48pfx", "score": "7", "subreddit": "AcademicPsychology", "subreddit_id": "t5_2sluh"}, {"author": "notblackmachete", "body": "This is a good example through which to think about the differences between rule and act utilitarianism. According to act utilitarianism, we examine the morality of an action based on the consequences of that action alone. Thus, it is possible that under act utilitarianism we can certainly justify imperialism or the exploitation of natural resources.\n\nRule utilitarianism, by contrast, posits that actions are good or bad insofar as they adhere to certain. These rules are established such that if followed, they are meant to produce the greatest good for the greatest number. Say we establish a moral rule that states that imperialism or the exploitation of natural resources should be prohibited. Why would we do so? Well of course, a single act of imperialism or exploitation can produce good. However, if everyone started to engage in such behaviors shit would hit the fan very quickly. Thus, a rule functions to prohibit these actions wholesale in an effort to prevent a sort of slippery slope. \n\nHopefully that makes sense. Strict act utilitarianism can be dangerous and goes against the moral sensibilities of most people. Rule utilitarianism, in my opinion, preserves the positives of a deontological system without making any appeals to metaphysical truths. \n\nThere’s a lot more to talk about in regards to these topics, but hopefully this briefly summarizes some of it.\n\nI would check out the Wikipedia pages on these topics if you’re interested.", "created_utc": "1657139544.0", "edited": "False", "id": "if4blax", "is_submitter": "False", "link_id": "t3_vsywku", "parent_id": "t3_vsywku", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Well not necessarily. In the United States currently the majority of the population supports political positions that are not legislated. I would consider revolutionary action that aims to establish a state in which things are consistent with the will of the people to be implicitly democratic. Contrast this with the formation of the USSR in which the average peasant had zero clue what communism was yet a “communist state” was established supposedly for them.", "created_utc": "1657069274.0", "edited": "False", "id": "if0m5re", "is_submitter": "False", "link_id": "t3_vs9jni", "parent_id": "t1_if0lk30", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "If revolution can be done democratically then I’m in favor of it. However, I believe that previous communists revolutions failed to bring about communism precisely because of their lack of democratic action and focus on vanguardism. Seems kind of strange to try to set up a hyper-democratic system (I.e., socialism, communism) through undemocratic means", "created_utc": "1657060002.0", "edited": "False", "id": "if01qrf", "is_submitter": "False", "link_id": "t3_vs9jni", "parent_id": "t3_vs9jni", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "The sexes or genders of a rape victim or rapist say nothing about sexuality (e.g., think of prison rape). So it wouldn’t be outting. Even if it was then yeah of course", "created_utc": "1657059791.0", "edited": "False", "id": "if0191l", "is_submitter": "False", "link_id": "t3_vs90sf", "parent_id": "t3_vs90sf", "score": "24", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m 100% pro-choice, but I can’t find an abortion argument that satisfies me. I think the parasitism argument is strong (the argument being expressed here). But a giant hole in the argument is when does the fetus/child stop being a parasite and draining your resources? To me, the answer really is never. Once the child is born, they are still a parasite as they cause physical and psychological drain on the caregiver as a means to preserve their own life. The same would go for disabled folk, elderly people, or anyone who needs a caregiver. It seems like those of us who use the parasite argument strongly rely on an indefensible philosophical notion of when personhood begins. \n\nI personally tend to most value a consequentialist argument for abortion. That is, accept that it is murder and that the consequences of murdering a fetus can often be positive. I know this is an optical nightmare of an argument, but it seems the strongest and most consistent to me. I wouldn’t recommend making such an argument to a pro-lifer lol, unless they have some philosophical acumen which is highly unlikely given that they are pro-life", "created_utc": "1657030115.0", "edited": "False", "id": "iexzpz2", "is_submitter": "False", "link_id": "t3_vrriyt", "parent_id": "t3_vrriyt", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Being patriotic means not supporting those things. It means seeing your country being cringe and saying “hey country, stop being cringe and live up to what you claim to value.”", "created_utc": "1656992907.0", "edited": "False", "id": "iewh8t9", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_iewgatn", "score": "8", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Irony or no? The odds of 5 tankies leaving their house (literally touching grass) and finding each other are incredibly low. Conclusion: irony", "created_utc": "1656984919.0", "edited": "False", "id": "iew2nxh", "is_submitter": "False", "link_id": "t3_vrlq8z", "parent_id": "t3_vrlq8z", "score": "125", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "“I’m an anti-imperialist except in the case of the American colonies, which deserved their imperialist subjugation”", "created_utc": "1656983734.0", "edited": "False", "id": "iew0gi3", "is_submitter": "False", "link_id": "t3_vrliro", "parent_id": "t3_vrliro", "score": "29", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Nothing contradictory between Black liberation and patriotism. Patriotic rhetoric was one of the primary weapons employed during the civil rights movement to support Black liberation.\n\nCheck out this poem by civil rights activist Langston Hughes:\nhttps://poets.org/poem/let-america-be-america-again", "created_utc": "1656969481.0", "edited": "1656969772.0", "id": "iev6qik", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_iev5dfq", "score": "4", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Ok but if you want to be politically effective you have to use patriotic rhetoric", "created_utc": "1656969335.0", "edited": "False", "id": "iev6el3", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_iev5xgt", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Patriotism is simply wanting the best for people who share your nationality. Like I said, this isn’t mutually exclusive to supporting the global proletariat", "created_utc": "1656968686.0", "edited": "False", "id": "iev4x5n", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_iev4rex", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Wait. If a given Starbucks location in the US unionized would you start tweaking about how selfish those workers are for unionizing while they sit back and watch the suffering of other Starbucks franchise locations? All I’m saying is that patriotism is the promotion of leftist values within the country that you live in. This doesn’t mean you cannot support leftist worldwide.", "created_utc": "1656968454.0", "edited": "False", "id": "iev4dmr", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_iev39dr", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yes if you do so specifically. But let’s not pretend that we, as average members of the proletariat,  can use the political processes within our country to do shit for others in different county. Wake me up when there’s a bill in Congress that supports the welfare structure of a Latin American or African country. We gotta do what we can, especially when the US is very rapidly slipping into fascism", "created_utc": "1656967688.0", "edited": "1656967884.0", "id": "iev2ky3", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_iev1aqf", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Promoting the wellbeing of people within your country is not the same as nationalism", "created_utc": "1656963339.0", "edited": "False", "id": "ieusk78", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_ieusf0m", "score": "6", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "It doesn’t sound like anything specific to me. Does it mean death to the current establishment? Does it mean death to the people living within the country? Does it mean death to the physical land which is claimed by America?", "created_utc": "1656963301.0", "edited": "False", "id": "ieusgyr", "is_submitter": "False", "link_id": "t3_vrewq0", "parent_id": "t1_ieurvr9", "score": "-3", "subreddit": "swoletariat", "subreddit_id": "t5_35qx1"}, {"author": "notblackmachete", "body": "Patriotism is not the same as nationalism", "created_utc": "1656963057.0", "edited": "False", "id": "ieurwmh", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_ieuro4z", "score": "4", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "What exactly do you mean by this?", "created_utc": "1656963012.0", "edited": "False", "id": "ieursv9", "is_submitter": "False", "link_id": "t3_vrewq0", "parent_id": "t1_ieupkio", "score": "-2", "subreddit": "swoletariat", "subreddit_id": "t5_35qx1"}, {"author": "notblackmachete", "body": "100%. But real patriotism involves living up to the values on which our country was founded (even if the founders were too dumb to realize how they themselves were contradicting those values). Patriotism is loving your country such that you seek to make it a place that promotes the flourishing of the working class and oppressed peoples.\n\nPatriotism isn’t blind worship of one’s nation. It’s the attitude that promotes its constant improvement.", "created_utc": "1656962411.0", "edited": "1656962650.0", "id": "ieuqepm", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_ieupwo0", "score": "14", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Republicans are like a deadbeat dad who says they love their child yet does nothing to support them while simultaneously abusing them", "created_utc": "1656961811.0", "edited": "False", "id": "ieup0uu", "is_submitter": "True", "link_id": "t3_vrb69n", "parent_id": "t1_ieumi5b", "score": "25", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "America (any/all)", "created_utc": "1656956689.0", "edited": "False", "id": "ieud0ry", "is_submitter": "False", "link_id": "t3_vrcm1m", "parent_id": "t3_vrcm1m", "score": "11", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "You might have been talking to a Republican AI simulator", "created_utc": "1656885183.0", "edited": "False", "id": "ieqx204", "is_submitter": "False", "link_id": "t3_vqqe4k", "parent_id": "t3_vqqe4k", "score": "23", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "So would you be in favor of a direct democracy? Obviously I think we are all in favor of abolishing the electoral college. But would you be interested in even more direct democracy. For example, the use of referendums and such", "created_utc": "1656866721.0", "edited": "False", "id": "iepr10z", "is_submitter": "True", "link_id": "t3_vqjbfa", "parent_id": "t1_iepp8ip", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Well it technically is democracy. If the majority of people want to oppress a certain group of people that is certainly democratic. Democracy is a severely flawed system that needs safeguards in place to prevent oppression of minorities and its self-collapse", "created_utc": "1656863513.0", "edited": "False", "id": "iepj7s6", "is_submitter": "False", "link_id": "t3_vq84p5", "parent_id": "t1_iep89ov", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I mean they’re still pretty much outting the kid. Maybe they don’t name the kid explicitly, but the parent now knows that there is a queer kid in the class and they can easily just ask their child or other parents who that kid is", "created_utc": "1656863077.0", "edited": "False", "id": "iepi6wm", "is_submitter": "False", "link_id": "t3_vqaaw5", "parent_id": "t1_iepduci", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "You’re right maybe my mind has been too darkened by the woke academia agenda to make proper assessments of the situation", "created_utc": "1656858774.0", "edited": "False", "id": "iep8dsb", "is_submitter": "False", "link_id": "t3_vpsrve", "parent_id": "t1_iep87i6", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I mean they are fascist. It would potentially happen because even though republicans preach about how much they love not having restrictions on firearm purchases, they can easily just say that those people with left-leaning views are mentally unwell or that they pose a public threat, and thus are unfit to bear arms.", "created_utc": "1656810644.0", "edited": "False", "id": "ien80o3", "is_submitter": "False", "link_id": "t3_vq17wq", "parent_id": "t1_ien6lyt", "score": "33", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "A possible consequence of this is that leftists wouldn’t be permitted to buy firearms.", "created_utc": "1656802559.0", "edited": "False", "id": "iemrto4", "is_submitter": "False", "link_id": "t3_vq17wq", "parent_id": "t3_vq17wq", "score": "156", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This. This is precisely how republicans think", "created_utc": "1656802111.0", "edited": "False", "id": "iemquoy", "is_submitter": "False", "link_id": "t3_vq19al", "parent_id": "t1_iemmifs", "score": "18", "subreddit": "politics", "subreddit_id": "t5_2cneq"}, {"author": "notblackmachete", "body": "North Jersey is the shart stain of NYC", "created_utc": "1656800884.0", "edited": "False", "id": "iemo91p", "is_submitter": "False", "link_id": "t3_vpsrve", "parent_id": "t1_iemh9e5", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This has to be the most useless definition of patriotism I’ve ever seen. I am a psych doctoral student and i can assure you that this definition would never fly in any type of real study.", "created_utc": "1656800813.0", "edited": "False", "id": "iemo3su", "is_submitter": "False", "link_id": "t3_vpsrve", "parent_id": "t1_ielrnor", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Remember, fascism and associated ideologies are inherently irrational. Political decisions are made essentially haphazardly with the only goal being to cause suffering. Think of it like if you were in a fight but only headbutted your opponent. A headbut is effective at dealing out damage but it also backfires very quickly. Fascists are political headbutters", "created_utc": "1656792710.0", "edited": "False", "id": "iem6w6n", "is_submitter": "False", "link_id": "t3_vpzkwh", "parent_id": "t3_vpzkwh", "score": "9", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This unhinged rant is the funniest thing I’ve seen in a while. I’ve been dummy stressed about the state of this country but this provided so much joy", "created_utc": "1656727084.0", "edited": "False", "id": "iej1l33", "is_submitter": "False", "link_id": "t3_vpg2vq", "parent_id": "t3_vpg2vq", "score": "49", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Comrade you are an inspiration to us all", "created_utc": "1656721221.0", "edited": "False", "id": "ieiqa4p", "is_submitter": "False", "link_id": "t3_vpecxk", "parent_id": "t3_vpecxk", "score": "32", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m sorry for that. But you’re probably better off. \n\nI think I also have an interesting story. Started dating my ex when I was alt-right. She was a lib but not a leftie. Because of dating her, I moved to the left and then eventually to the far left due to other influences. She’s Black and bi so those aspects of her identity helped me develop a lot of empathy me being a straight white dude. Nevertheless, she broke up with me, and she said that she did so partially because she held resentment for me for being a former right winger. Fast forward a few months after the break up. SHE STARTS DATING A LIBERTARIAN. That doesn’t last long until they break up and then she STARTS DATING A TRUMPTARD. I’m still on good terms with her and we chat sometimes. But guess what, now whenever we talk politics she just defends the Republican Party and tells me how democrats are just as dangerous as republicans. Keep in mind, this is an extraordinarily smart woman. Like one of the smartest I’ve ever met. I think her mind has been darkened when it comes to politics and I don’t know why LOL", "created_utc": "1656721123.0", "edited": "False", "id": "ieiq340", "is_submitter": "False", "link_id": "t3_vp9p7f", "parent_id": "t3_vp9p7f", "score": "14", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "At the end my man literally says the Republican Party is trying to be a party for all working class Americans across different races. Brain dead take. I’m sorry but when I see marginalized groups supporting republicans, all I can think about is that the only thing they’re getting in return is being put at the back of the line to the death camps instead of going in first.", "created_utc": "1656718428.0", "edited": "False", "id": "ieikn7x", "is_submitter": "False", "link_id": "t3_vpbt17", "parent_id": "t3_vpbt17", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This only applies if the dems in the blue states would mobilize their military forces. That’s a big ask for libs. Like I think they might pull a France and surrender immediately", "created_utc": "1656717268.0", "edited": "False", "id": "ieii8a1", "is_submitter": "False", "link_id": "t3_vpd3ai", "parent_id": "t3_vpd3ai", "score": "56", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Damn I didn’t realize that there gonna be 40% of Americans (seditious traitors) fighting against us in the upcoming Roblox battle after the Supreme Court dicks us with the Moore v. Harper case. Kinda more than I thought", "created_utc": "1656700855.0", "edited": "False", "id": "iehgcdf", "is_submitter": "False", "link_id": "t3_vp5ze0", "parent_id": "t3_vp5ze0", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Don’t report me to the police bc the Republican legislatures are about to pass anti-sodomy laws", "created_utc": "1656688092.0", "edited": "False", "id": "iegkuib", "is_submitter": "False", "link_id": "t3_voxgri", "parent_id": "t3_voxgri", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "notblackmachete", "body": "I think you can go to your closest US embassy", "created_utc": "1656687493.0", "edited": "False", "id": "iegjdx0", "is_submitter": "False", "link_id": "t3_voqle0", "parent_id": "t3_voqle0", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I would consider myself Christian leaning towards Catholic. But I take severe issue with how Christianity is generally understood by most people. Like I think lefties act way more Christ-like  than evangelical psychopaths (obviously). \n\nMy understanding of Christianity comes mainly from the work of Rene Girard. Girard lays out an anthropological analysis of Christianity. He basically explains that all of human culture is founded on the scapegoating of innocent victims and the subsequent concealment of that scapegoating/lynching. Christianity, according to Girard, is the first religion that tells the story of scapegoating through the innocent victim’s perspective (Jesus). therefore Christianity abolishes our ability to ignore the murder of innocent people.\n\nEdit: at the time I was an atheist but went to a Catholic college so I had to take theology classes", "created_utc": "1656687080.0", "edited": "1656687262.0", "id": "iegie0d", "is_submitter": "False", "link_id": "t3_von6qk", "parent_id": "t1_ieghrn1", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This might piss a lot of lefties off but what actually opened me up to leftism was studying Christian theology my freshman year in college. Between the ages of 15-19 I was pretty far right. I genuinely did not give a single fuck about the well-being of other people. Freshman year I had a theology professor who is one of those “Jesus would be a socialist.” The way he presented Christianity as a means through which one sacrifices themselves for the weak and marginalized in society not only made rational sense but also stirred an emotional change within me such that I started to give a fuck about oppressed people. Then I found Voosh and learned about the facts and logic. Given that I was kind of a STEM-lord (currently going for Ph.D in clinical psychology) it was impossible for me to not fully buy into leftism.\n\nAlso I dated a Black person which led me to develop even more empathy.", "created_utc": "1656686729.0", "edited": "False", "id": "ieghj58", "is_submitter": "False", "link_id": "t3_von6qk", "parent_id": "t3_von6qk", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "It’s actually a shame bc if Vaush never became a streamer I think that he easily could have become a highly successful politician. It’s literally impossible for him to run for shit at this point. Imagine the smear campaigns of pedophilia and beastiality  and n-word accusations LOL", "created_utc": "1656686415.0", "edited": "False", "id": "ieggs1y", "is_submitter": "False", "link_id": "t3_vonfws", "parent_id": "t3_vonfws", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yep this would just be a ban against freedom of travel within the US. I can’t see how this would exactly work, though. I mean, it seems kind of unenforceable.", "created_utc": "1656686262.0", "edited": "False", "id": "ieggeur", "is_submitter": "False", "link_id": "t3_vopuiy", "parent_id": "t3_vopuiy", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "We are living in a nightmare.\n\nLet’s enjoy what possibly may be the end of being able to even discuss these issues over the internet.", "created_utc": "1656626080.0", "edited": "False", "id": "iedhu4d", "is_submitter": "False", "link_id": "t3_voc6mw", "parent_id": "t3_voc6mw", "score": "9", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Could be the case as well. However, the study in question did show that a belief in inequality increased in proportion to increases in muscle mass.", "created_utc": "1656613297.0", "edited": "False", "id": "ieclajz", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_iecj7b3", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Gracias España, muy chido", "created_utc": "1656608922.0", "edited": "False", "id": "ieca82i", "is_submitter": "False", "link_id": "t3_vobfwc", "parent_id": "t3_vobfwc", "score": "4", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m gonna roblox if I see libs circle jerking about how today we swore in the first black female justice", "created_utc": "1656607723.0", "edited": "False", "id": "iec75th", "is_submitter": "False", "link_id": "t3_vo9gbu", "parent_id": "t3_vo9gbu", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’m not sure there’s any impeachable crime they’ve committed besides Clarence Thomas’ antics with his psycho wife. Is that even being investigated?", "created_utc": "1656607545.0", "edited": "False", "id": "iec6pd4", "is_submitter": "False", "link_id": "t3_vo9gbu", "parent_id": "t1_iebvyan", "score": "7", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This is beyond based", "created_utc": "1656602570.0", "edited": "False", "id": "iebu3bx", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_iebrqpe", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "The fact that there might be a causative relationship between lifting and conservative views  is fucking hilarious (in a doomer type of way). But it makes sense bc if you feel like you have put on muscle through your own willpower you might extrapolate that and begin to think that anyone can do anything if they just try hard enough. You buy into the myth of meritocracy by becoming a meathead lol", "created_utc": "1656601275.0", "edited": "False", "id": "iebqv3d", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_iebq96d", "score": "22", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I am in a conservative area. And I feel like there HAS to be a correlation between bodybuilding/strength training and conservatism. Maybe not with other types of fitness\n\nHere’s a kind of funny article on this\n\nhttps://www.sciencedaily.com/releases/2018/10/181010105602.htm", "created_utc": "1656600827.0", "edited": "False", "id": "iebpr29", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_ieblyk2", "score": "9", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I think they might be trolling a little lol", "created_utc": "1656597915.0", "edited": "False", "id": "iebiq7o", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_iebiafz", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "People used to be scared of the Chad Leftist yoked coal miner fighting for their rights. Now the right thinks we are a bunch of pussys.", "created_utc": "1656597870.0", "edited": "False", "id": "iebimci", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_iebgfwn", "score": "17", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "To add, bodybuilding/weight training is an expensive hobby. I spend massive amounts of money weekly just to buy enough food to meet my calorie and protein goals. Supplements are also really expensive. Plus gym memberships. So bodybuilding certainly is a hobby that is reserved for the privileged. Nonetheless, I think that there are steps everyone can take to engage in some type of fitness without necessarily spending ridiculous amounts of money.", "created_utc": "1656596709.0", "edited": "False", "id": "iebfysm", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_iebf4of", "score": "9", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I think a problem may also be that some lefties may feel like certain IRL spaces are not for them. For example, fitness (specifically weightlifting) and the world of guns seem to be dominated by people on the right. I’m into fitness. I want to buy firearms and go to shooting ranges, but I don’t really want to be around people who I think would kill me if a civil war broke out lol.\n\nAlso, I think fitness has become associated with the manosphere in the past couple of years. Like dudes start going to the gym to unironically do their sigma male grind set. As we all know this type of culture is strongly associated with capitalist alienation +  is also a gateway into far right thinking.", "created_utc": "1656596466.0", "edited": "1656596899.0", "id": "iebffhc", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_iebdr8d", "score": "24", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I do exactly the same. Nothing like some voosh in the gym.", "created_utc": "1656595466.0", "edited": "False", "id": "iebd9bw", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t1_iebcyxp", "score": "30", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yeah this is not the time for wokescolding.", "created_utc": "1656594921.0", "edited": "False", "id": "iebc49a", "is_submitter": "False", "link_id": "t3_vo629m", "parent_id": "t3_vo629m", "score": "15", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I’ve been on the grind for a while. Every time I’m in the gym I feel like I’m surrounded by trumptards. I use my dislike of them as motivation.", "created_utc": "1656594841.0", "edited": "False", "id": "iebby7o", "is_submitter": "False", "link_id": "t3_vo7qwx", "parent_id": "t3_vo7qwx", "score": "132", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "No clue if this is the appropriate place to ask this question. I have citizenship in the US and Poland. I currently reside in the US and am a doctoral student. If I had to abandon my doctoral work in the US, how easy would it be for me to become a student at a Norwegian university. I currently hold a US Bachelor of Science degree.", "created_utc": "1656534297.0", "edited": "False", "id": "ie8bwuu", "is_submitter": "False", "link_id": "t3_iydv5z", "parent_id": "t3_iydv5z", "score": "1", "subreddit": "Norway", "subreddit_id": "t5_2qwrb"}, {"author": "notblackmachete", "body": "I think they may have quickly backtracked this after public outcry. \n\nCheck this link and lmk if I’m right :\n\nhttps://www.orangecta.com/OCPS--CAMP-LEGAL--AND-IMPLICATIONS-OF-DANGEROUS-LEGISLATION-6-22878.html?fbclid=IwAR08acFCNFUqAqTIp3ozD2m0ZIeQJQgh8cmKOQinm1SPSE12hFG9Ucj-n_Q\n\nEdit: we got vague language here. They say that a teacher “can” display pride stuff, but it is advisable that they don’t in case that it might lead to instruction on gender or sexuality. I wonder how tf investigators of teachers are going to deem what is and isn’t instruction that came from a pride flag.", "created_utc": "1656530973.0", "edited": "1656533191.0", "id": "ie83el2", "is_submitter": "False", "link_id": "t3_vnhck1", "parent_id": "t3_vnhck1", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yep used to love the guy back in the day. I was just thinking this morning whether he is going to fully commit himself to being a conservacuck after having been associated with “the intellectual dark web.” Looks like the answer is yes", "created_utc": "1656466452.0", "edited": "False", "id": "ie4rftk", "is_submitter": "False", "link_id": "t3_vn2b56", "parent_id": "t1_ie4kc75", "score": "13", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "As long as Poland doesn’t leave the EU like Britain lol. I wouldn’t put it past them", "created_utc": "1656460602.0", "edited": "False", "id": "ie4fb5u", "is_submitter": "True", "link_id": "t3_vmv4r5", "parent_id": "t1_ie3g0eo", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "We have so much to be proud of considering our history of getting absolutely pummeled and still overcoming it. Given that, it’s even more of a shame that Poland is going downhill. Guess when you’re not fighting off Germans or Russians you gotta start oppressing gay people :(", "created_utc": "1656460409.0", "edited": "False", "id": "ie4ewa6", "is_submitter": "True", "link_id": "t3_vmv4r5", "parent_id": "t1_ie40v16", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yes I was just about to make and edit saying that we also got Putin knocking on the doorstep there", "created_utc": "1656443502.0", "edited": "False", "id": "ie3b1l9", "is_submitter": "True", "link_id": "t3_vmv4r5", "parent_id": "t1_ie3au2g", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Not ignore the OT. It’s like any other prequel. The Star Wars prequels set the stage for the original trilogy. OT is a very interesting text as it presents the Jewish people beginning the process of demythologizing religion but not fully being able to do it as God does not reveal the truth to them fully. \n\nI’m trying to be nice here and explain things in simple terms, but your views betray a profound ignorance of Christian (more specifically Catholic) theology. Most atheists like you are the equivalent of someone without any education in chemistry making claims about the nuances complexities of the subject. It’s very easy to look at incorrect fundamentalist interpretations of a religion and criticize them. Believe me, I could do that as a 12 year old. It takes effort to actually criticize a religion when it comes down to the complexities of theological study regarding it.", "created_utc": "1656177416.0", "edited": "False", "id": "idphy6g", "is_submitter": "False", "link_id": "t3_vjxyni", "parent_id": "t1_idpam4h", "score": "-1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "The God of the Old Testament is not actually God, at least in most parts of it. God isn’t revealed until Jesus comes around. In the New Testament Jesus calls out the laws of old pretty much saying that the Hebrews had some joker moments in their attempts to understand God.\n\nOf course people look at the God of the OT and decide they’re gonna try to imitate him. But these people are clowns. I believe in the one God revealed by Jesus Christ who was anything but violent.", "created_utc": "1656167868.0", "edited": "False", "id": "idowm52", "is_submitter": "False", "link_id": "t3_vjxyni", "parent_id": "t1_idovjxz", "score": "0", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "The worship and love of God means to live one’s life in imitation of God. What is it exactly that we should imitate? Well Christ is a revelation of precisely the behavior that characterizes God. What did Christ do? Lived and died for victims. \n\nI concede that it likely is easier to get to bigotry from scripture than Marxist texts. But this largely comes from a failure to understand the life and death of Christ as a refutation/demythologizing of the mythology found in many parts of the Old Testament. People who take the OT as anything but a prequel that provides context for the main story that is the New Testament are quite dumb and very uneducated.", "created_utc": "1656166694.0", "edited": "False", "id": "idou73h", "is_submitter": "False", "link_id": "t3_vjxyni", "parent_id": "t1_idotdpx", "score": "-1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Satanists are based lovers of Christ in my book. At least when it comes to the most important shit.", "created_utc": "1656166253.0", "edited": "False", "id": "idotb7e", "is_submitter": "False", "link_id": "t3_vjxyni", "parent_id": "t1_idoiqcw", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Well it doesn’t have anything to do with Christianity. Christianity is simply being concerned for victims of oppression to the extreme extent that you would sacrifice yourself for their good. Most people who call themselves Christians deny this. Hate of minority groups is definitionally anti-Christian. Christianity is most strongly characterized by a closeness and suffering with the most marginalized and hated in any society.\n\nNote: bigotry can be inspired by “Christianity.” But that’s the same case with the USSR being inspired by “Marxism.”", "created_utc": "1656166053.0", "edited": "False", "id": "idoswsa", "is_submitter": "False", "link_id": "t3_vjxyni", "parent_id": "t1_ido0uan", "score": "-1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Used to be an atheist. Former lover of hitchens, Dawkins, etc.  Converted to Christianity after years of theology and philosophy education in college. I am embarrassed to share a classification (I.e., Christian) with these Christ- hating psychopaths. But tbh the nuance between my understanding of Christianity and “pop Christianity” is, at this point, not even worth explication. Atheists and anti-theists are definitionally more Christ-like than the satan spawn trying to destroy the world. So although I think atheism is cringe, I stand in solidarity with all of my brothers in Christ (bc if you act like Jesus, you are a Christian regardless of whether you believe in a “god.” Simple as).", "created_utc": "1656133225.0", "edited": "1656133596.0", "id": "idnk4pc", "is_submitter": "False", "link_id": "t3_vjxyni", "parent_id": "t3_vjxyni", "score": "-1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "This is an interesting topic for me. I am about to start my phd program in the fall. I have been learning Spanish for about a year. Although far from fluent, I can have pretty basic conversations, and I can pretty much understand most things I read. I doubt I’ll have time to really progress with my Spanish in grad school due to being busy. Nonetheless, I hope to serve Hispanic populations in the future, and i just don’t know how much Spanish I might need to apply for jobs that require bilingualism.", "created_utc": "1655757231.0", "edited": "False", "id": "id3nrge", "is_submitter": "False", "link_id": "t3_uzqg13", "parent_id": "t3_uzqg13", "score": "2", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "Thanks! Should’ve scrolled through the sub before posting this.", "created_utc": "1655237532.0", "edited": "False", "id": "icddfr4", "is_submitter": "True", "link_id": "t3_vc9thb", "parent_id": "t1_icd0tdv", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "notblackmachete", "body": "I would say “believe women” is super important because by believing women we actually investigate the situation properly. But “believing women” shouldn’t go so far as to avoid a trial yknow", "created_utc": "1651332656.0", "edited": "False", "id": "i6ssbpa", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6qxjc0", "score": "1", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I think they’re a harm to the movement if they don’t care about good advocacy", "created_utc": "1651332503.0", "edited": "False", "id": "i6srzlh", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6sfbsw", "score": "2", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Also, I didn’t get a chance to respond Bc class ended", "created_utc": "1651280914.0", "edited": "False", "id": "i6qkkk5", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6qifmh", "score": "3", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "So a useful argument using lived experiences would be Black Americans describing the racism they experience in every sphere of life. Then, using that perspective, highlight research proving you are correct. Or, if there is no research, advocate for it. Another would be labor activism. Workers have the lived experience of being oppressed by their working conditions, so they use that lived experience to effectively advocate for worker rights. But a worker can’t just say I feel that my working conditions are shit therefore “boss, do this, do that” without any real political\n\nLived experiences need to inform praxis in light of good arguments. If not, then we have to accept Candace Owen’s arguments from her lived experiences as a Black woman, even though she has nothing to back up her positions. \n\nAnother extension of bad lived experiences logic is that people who say they had a crime committed to them are correct by virtue of them saying so. This is why we have courts and trials (as shit and prejudiced the criminal justice system is).", "created_utc": "1651280887.0", "edited": "False", "id": "i6qkijt", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6qifmh", "score": "8", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I completely agree with you and that’s what I said exactly to some of my classmates. Like it does piss me off. But the only alternative is authoritarian rule in the name of leftism which we have seen many times through history (e.g., USSR, China) works out horribly", "created_utc": "1651279488.0", "edited": "False", "id": "i6qhkch", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6qgewo", "score": "15", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Basically that a lot of leftists don’t even know why they’re leftists. As a result, they don’t actually have good arguments for their positions. Moreover, they don’t like to engage with challenges to their positions. A good recent example would be the beef with non compete.", "created_utc": "1651279083.0", "edited": "False", "id": "i6qgpz1", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6pu1qv", "score": "10", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Our program actually has a banquet with an open bar coming up. I should get trashed and grab the mic and go off hahaha", "created_utc": "1651278862.0", "edited": "False", "id": "i6qg9lq", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6qduou", "score": "19", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "My point isn’t even that lived experience isn’t valuable. Lived experience is necessary to inform the political positions of the marginalized and oppressed. It’s just that lived experience has little worth when it stands on its own", "created_utc": "1651277737.0", "edited": "False", "id": "i6qdwx0", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6q7ee0", "score": "14", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "I wish I could but it would be wildly inappropriate to do that in class lol", "created_utc": "1651277673.0", "edited": "False", "id": "i6qds40", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6q67vw", "score": "14", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "To add, it seems like many of my classmates are shook by the fact that leftism and progressivism have to be fought for and aren’t just common knowledge. Like it’s offensive to them that people don’t share their positions. Yet, they don’t want to engage with the other side.", "created_utc": "1651276229.0", "edited": "False", "id": "i6qaqyo", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t3_ueuo5y", "score": "41", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "The class is an intro to postmodernism/existentialism. We are covering feminism atm so standpoint theory came up", "created_utc": "1651276036.0", "edited": "False", "id": "i6qach7", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6q2oda", "score": "5", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yeah I disavow that post. I made that post when I first started moving from the right to the left.\n\nAnd anyway, what does that have to do with this post???", "created_utc": "1651266401.0", "edited": "False", "id": "i6pprgm", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6pnk9g", "score": "25", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "What is really sad is that my professor, who is an extraordinarily great guy and amazing teacher, has told me privately that he has become so disillusioned by such students that he thinks the far left is as dangerous as the far right. I’ve argued this with him vehemently, but I can understand why he might think that. These people are an optical nightmare for progressivism.", "created_utc": "1651264540.0", "edited": "False", "id": "i6pll9n", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6pl57f", "score": "40", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Hahaha we are seniors so I would expect better but nah.", "created_utc": "1651264201.0", "edited": "False", "id": "i6pkteg", "is_submitter": "True", "link_id": "t3_ueuo5y", "parent_id": "t1_i6pkb7g", "score": "31", "subreddit": "VaushV", "subreddit_id": "t5_10to4u"}, {"author": "notblackmachete", "body": "Yeah I understand that I was in the wrong at the beginning. It’s just indecent for a company to go to such extreme measures. They didn’t even try to communicate about it.", "created_utc": "1648737601.0", "edited": "False", "id": "i2upe3a", "is_submitter": "False", "link_id": "t3_tsdx52", "parent_id": "t1_i2uorox", "score": "1", "subreddit": "americanairlines", "subreddit_id": "t5_2zcaf"}, {"author": "notblackmachete", "body": "Making a credit card dispute is not wire fraud you clown. Credit card disputes can just be denied by the other party????", "created_utc": "1648737439.0", "edited": "False", "id": "i2uozrv", "is_submitter": "False", "link_id": "t3_tsdx52", "parent_id": "t1_i2rrv24", "score": "0", "subreddit": "americanairlines", "subreddit_id": "t5_2zcaf"}, {"author": "notblackmachete", "body": "Yeah well maybe I didn’t understand the terms but disputing a charge shouldn’t result in them just canceling my shit. It would be like if you were in school and took and exam and wanted to argue a question you got wrong with the professor. The policy is that you can’t argue questions, but you do it anyway. Now imagine that for arguing the question, the professor just gives you a zero on the exam. Like that’s so out of line. \n\nAA could have just declined the dispute without fucking me entirely. AA is acting like a little kid who gets angry and literally does the worst thing they can do.", "created_utc": "1648737231.0", "edited": "False", "id": "i2uohck", "is_submitter": "False", "link_id": "t3_tsdx52", "parent_id": "t1_i2um7ud", "score": "0", "subreddit": "americanairlines", "subreddit_id": "t5_2zcaf"}, {"author": "notblackmachete", "body": "Yeah sometimes I think I should’ve just decided to take a gap year but I’m in too deep now. Most of my materials are ready (personal statements, cv, writing samples, etc.). Also it helps to be around my mentors.", "created_utc": "1635046750.0", "edited": "False", "id": "hhtla4h", "is_submitter": "True", "link_id": "t3_qch3a6", "parent_id": "t1_hhrk5kb", "score": "1", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "What would you suggest would be the best way forward in the case of not getting in? What kinds of post-bad positions should I apply to?", "created_utc": "1634834067.0", "edited": "False", "id": "hhib9zc", "is_submitter": "True", "link_id": "t3_qch3a6", "parent_id": "t1_hhh8kcl", "score": "1", "subreddit": "ClinicalPsychology", "subreddit_id": "t5_2sl1j"}, {"author": "notblackmachete", "body": "Nice looking lad", "created_utc": "1633053479.0", "edited": "False", "id": "hexctcm", "is_submitter": "False", "link_id": "t3_pyy2pn", "parent_id": "t3_pyy2pn", "score": "2", "subreddit": "bluetongueskinks", "subreddit_id": "t5_2th2c"}, {"author": "notblackmachete", "body": "I do think that the GRE is unfairly biased against non-native English speakers. I find it ridiculous that non-native English speakers are expected to take this exam and are compared to native English speakers. I find it great that more and more universities are eliminating the GRE as a requirement for admission. I find standardized tests generally to be an antiquated part of applications as they are racist, classist, and biased against non-native speakers.\n\nAnd you are 100% correct when it comes to vocabulary. It truly is a crapshoot. Until I started studying, I had no idea that the English language contained so many words. So I cannot imagine how intimidating it must be for you. Best of luck either way!", "created_utc": "1629469801.0", "edited": "False", "id": "h9nzl7r", "is_submitter": "True", "link_id": "t3_p7g1b4", "parent_id": "t1_h9m7ul2", "score": "2", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": "What makes you say that? I’m referring to the content on YouTube only. I think that Tested Tutor provides a much more organized introduction to Quant topics. GregMat does go over the harder stuff and niche topics though.", "created_utc": "1629399901.0", "edited": "False", "id": "h9kfz0m", "is_submitter": "True", "link_id": "t3_p7g1b4", "parent_id": "t1_h9kbo2b", "score": "3", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": "The quant questions were far more difficult than the two free official PowerPrep exams. But to be fair, I was hit with topics that I was weak in like prime factorization-based problems and some difficult remainder questions. I found the verbal sections to be mostly on par with the PowerPrep exams when it came to the reading passages. The SE and TC were actually somewhat easier than the practice exams.", "created_utc": "1629396987.0", "edited": "False", "id": "h9k908b", "is_submitter": "True", "link_id": "t3_p7g1b4", "parent_id": "t1_h9jndkh", "score": "1", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": "I think I can explain my success with the verbal section almost entirely as a consequence of a strong vocabulary. When I took my first couple of practice tests, my verbal scores were in the high 150s and low 160s. All the TC and SE questions I got wrong had words that I simply did not know. So I would try to get down as many vocab words as possible in the time you have before the exam (that is what I did in the week leading up to it). I know GregMat has a good list and the The Tested Tutor has many vocab videos as well.\n\nWhen it comes to reading comprehension, critical reasoning, and everything else in the verbal section, I cannot offer any concrete advice. Given that I spend 99% of my time in college reading books and articles, I felt pretty confident in my ability to do well on these kinds of questions. So I did not spend a lot of time trying to improve my reading skills before the exam. There are, of course, strategies that people provide when it comes to these types of questions that are helpful. I would again defer to GregMat and the Tested Tutor.", "created_utc": "1629396813.0", "edited": "False", "id": "h9k8m92", "is_submitter": "True", "link_id": "t3_p7g1b4", "parent_id": "t1_h9jji7r", "score": "2", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": "Seems to have been a worldwide thing. Nothing to do with the test centers. It’s ETS’s fault. Apparently they decided to do maintenance on their systems today", "created_utc": "1626730016.0", "edited": "False", "id": "h5su3ic", "is_submitter": "False", "link_id": "t3_ong3yn", "parent_id": "t1_h5shjn4", "score": "6", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": "Wow that’s awful. The best of luck to you as well.", "created_utc": "1626726104.0", "edited": "False", "id": "h5sl5i0", "is_submitter": "False", "link_id": "t3_ong3yn", "parent_id": "t1_h5rssh3", "score": "1", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": "The ETS website probably hasn’t updated yet. Probably won’t let you reschedule until it does. I just hope I can go to the same testing location but it has very few testing dates. The second closes location is over 1.5 hours away.", "created_utc": "1626713827.0", "edited": "False", "id": "h5rsfhv", "is_submitter": "False", "link_id": "t3_ong3yn", "parent_id": "t1_h5rplhb", "score": "1", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": "From what I’ve heard it will take some time for either prometrics or ETS to contact us to reschedule or whatever. Not sure calling is gonna help at this point but hopefully you get some useful info", "created_utc": "1626710570.0", "edited": "False", "id": "h5rku11", "is_submitter": "False", "link_id": "t3_ong3yn", "parent_id": "t3_ong3yn", "score": "1", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": "Same thing happened to me today. So frustrating to be mentally prepared and have this happen", "created_utc": "1626697727.0", "edited": "False", "id": "h5qu660", "is_submitter": "False", "link_id": "t3_on6m9t", "parent_id": "t3_on6m9t", "score": "2", "subreddit": "GRE", "subreddit_id": "t5_2qy5d"}, {"author": "notblackmachete", "body": " I think he may have debris in one of his nostrils. He only has bubbles coming out one of his nostrils and he also keeps wiping his face even when there are no bubbles. He still has no other symptoms. Does anyone know how to clear debris?  \n\n\nI found this passage at this link and it seems consistent with what my baby is going through:\n\n### [Why Does My Leopard Tortoise Have a Bubbly, Wet Nose?](https://pethelpful.com/reptiles-amphibians/Four-Reasons-Your-Leopard-Tortoise-Has-a-Bubbly-Nose)\n\n  \n**Cause 2: Foreign Bodies**  \nA tortoise's nose appears prehistorically tough but is just as sensitive to environmental nasties as a human's. Grass fragments, dust, pollen, too-dry substrate, or a myriad of tiny foreign objects can cause nasal inflammation. Initially not life-threatening, it cannot be ignored either.  \n\n\nSymptomatically, the animal continues to behave healthily and most often maintains a daily routine. In other words, it will eat, drink, browse and snuggle down in a favorite spot. However, there will be signs that something is wrong. At times, the tortoise will be uncomfortable and bothered, especially when the offending piece is a longish piece of grass. To find relief, it might attempt to wipe its nose with a front leg. Needless to say, Leopards don't have fingers to do the job properly and need their owner's assistance to remove whatever is in there.  \n\n\nThe bubbles are a result of irritation of the nasal membrane and if the cause is not dealt with, an infection might ensue. As the article will shortly explain, respiratory infection is not something that should be viewed lightly. When tortoises develop respiratory problems, things go downhill very fast.", "created_utc": "1601417125.0", "edited": "False", "id": "g740v1h", "is_submitter": "True", "link_id": "t3_j1q74q", "parent_id": "t3_j1q74q", "score": "1", "subreddit": "tortoise", "subreddit_id": "t5_2sd1c"}, {"author": "notblackmachete", "body": "So tell me how you expect change to come about. Just scream and insult the other side? That will work wonders to get absolutely nothing accomplished.", "created_utc": "1596917431.0", "edited": "False", "id": "g0tkr8l", "is_submitter": "False", "link_id": "t3_i5pqx8", "parent_id": "t1_g0suaou", "score": "1", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "Yes it does. Pretty bad politics like I said. But no human ought to be defined by the worst things they do. Humans are much more complicated than just what their political ideaologies can reveal.", "created_utc": "1596902576.0", "edited": "False", "id": "g0ss0qc", "is_submitter": "False", "link_id": "t3_i5pqx8", "parent_id": "t1_g0qpn4v", "score": "1", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "I think that aggressive takes like yours here are one reason humans will never agree when it comes to politics. Give everyone some basic human respect no matter what they believe in. If you don’t then the other side will be able to very easily build a persuasive straw man.", "created_utc": "1596902045.0", "edited": "False", "id": "g0sr26b", "is_submitter": "False", "link_id": "t3_i5pqx8", "parent_id": "t1_g0rysgi", "score": "0", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "Don’t criticize the diet hahahah. Everyone’s body functions differently especially when it comes to how we react to food. He doesn’t advocate for an all beef diet he just says it works for him. Just like avoiding dairy works for some people and not others.", "created_utc": "1596901934.0", "edited": "False", "id": "g0squvy", "is_submitter": "False", "link_id": "t3_i5pqx8", "parent_id": "t1_g0qtset", "score": "-1", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "I would say devoting yourself to a single way of understanding the world is always a bad idea. But that doesn’t mean specific ideas should not be explored. When reading a book, there are multiple ways to interpret it. Not one single interpretation is correct but that doesn’t mean we shouldn’t try to explore these different avenues of understanding. Another example would be studying philosophy. Each time period and each philosopher have wildly differing ideas about the world and it’s not like any of them are right but it’s also not like any of them are entirely wrong either. JBP offers a unique perspective on life, literature, and history that though flawed, offers many interesting ideas.", "created_utc": "1596901695.0", "edited": "False", "id": "g0sqfln", "is_submitter": "False", "link_id": "t3_i5pqx8", "parent_id": "t1_g0s0n3f", "score": "-1", "subreddit": "BreadTube", "subreddit_id": "t5_iezap"}, {"author": "notblackmachete", "body": "Thank you for the well written and thought out response!", "created_utc": "1594001468.0", "edited": "False", "id": "fx252t5", "is_submitter": "True", "link_id": "t3_hlmgpf", "parent_id": "t1_fx11svy", "score": "1", "subreddit": "Herpes", "subreddit_id": "t5_2r1yp"}, {"author": "notblackmachete", "body": "Thanks I appreciate it!", "created_utc": "1593967736.0", "edited": "False", "id": "fx0g6m1", "is_submitter": "True", "link_id": "t3_hlmgpf", "parent_id": "t1_fx00da1", "score": "1", "subreddit": "Herpes", "subreddit_id": "t5_2r1yp"}, {"author": "notblackmachete", "body": "Milk", "created_utc": "1577740452.0", "edited": "False", "id": "fcl5u7f", "is_submitter": "False", "link_id": "t3_ehn3ua", "parent_id": "t3_ehn3ua", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "notblackmachete", "body": "The intersection of psychedelics and religions including spirituality.", "created_utc": "1556573227.0", "edited": "False", "id": "em38qe8", "is_submitter": "False", "link_id": "t3_bioh1d", "parent_id": "t3_bioh1d", "score": "1", "subreddit": "Psychonaut", "subreddit_id": "t5_2qplv"}]