[{"author": "nyako-yaki", "body": "You are. I've been learning it off and on for many years---way too long for my current level---and I've spent a lot of time learning *about* Japanese and the types of learning materials that are out there for it. (As a form of procrastination, but it's been helpful also.) \n\nIn the past year, I've learned a lot more than I ever have by finding the right methods and explanations for me. What used to be a bunch of difficult, vague grammar rules have started to make sense and I've started to read regularly in my TL for the first time. These resources are ones that I wish others could find who are in my position, as well as \"true beginners,\" aka not serial restarters.\n\nAll this to say, my Japanese level is currently low, but with the resources I've found and study habits I've built up, I am confident I can learn any grammar point at any level if I need to because I have built a solid foundation and have found the right tools to do so. Just like with any other language.", "created_utc": "1663743044.0", "edited": "False", "id": "ipau1q7", "is_submitter": "False", "link_id": "t3_xjr84s", "parent_id": "t1_ipaqh2g", "score": "-5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "Why so aggressive? This person was talking about their own experience and how easy/difficult they found these languages to be. \n\nI also find Japanese to be systematic and straightforward, based on my own experience. I think if you learn its grammar as it is rather than as if it were a romance language, these extremely nuanced, tiny grammatical variations may not be so difficult to grasp. I'm not saying Japanese isn't hard for native English speakers, but I think *how* you learn Japanese plays a decent factor, as well. And for Japanese, I don't think the clearest explanations and the most-passed-around explanations are always one and the same.", "created_utc": "1663739357.0", "edited": "False", "id": "ipaovqk", "is_submitter": "False", "link_id": "t3_xjr84s", "parent_id": "t1_ipah2b8", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "Perhaps you could pick a theme to write about, like your camping example, then look up a list of words you might use beforehand, *and then* try to use those in your composition. Maybe once you start getting into the flow of writing within these limitations, you'll be able to be more spontaneous with your word choice. The words are there; there might just be a blockage you need to work through.", "created_utc": "1663019401.0", "edited": "False", "id": "io6e621", "is_submitter": "False", "link_id": "t3_xcnzyl", "parent_id": "t3_xcnzyl", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "No problem. :) Yeah, I'm not sure how well-known it is, but I like it so far. Good alternative to Jisho as an online dictionary.", "created_utc": "1662435082.0", "edited": "False", "id": "in9qs1u", "is_submitter": "False", "link_id": "t3_x5w4ph", "parent_id": "t1_in95v2k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "Ah, I see. I might argue that it's not necessarily too late, but I understand what you're saying. In that case, this site might help. https://www.jpdb.io/ \n\nThey claim to do something similar to Heisig's method, but they're a dictionary/SRS service. You might be able to get something helpful out of it at your level/circumstance. Good luck with the N2! \n\nI'm also a fan of kanji. Lol.", "created_utc": "1662416845.0", "edited": "False", "id": "in8o85h", "is_submitter": "False", "link_id": "t3_x5w4ph", "parent_id": "t1_in69prq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "I've used Heisig's Remembering the Kanji 1 to learn to handwrite 1480 kanji in approximately 6 months, taking it really slow. You only learn one meaning using an English keyword, but it helps with vocabulary acquisition and being able to tell the difference between similar kanji. Being able to produce handwritten kanji is important to me, so I recommend this method if you'd like to be able to do so in a reasonably short timeframe as well. You learn how to produce 2200 kanji using this book.", "created_utc": "1662361977.0", "edited": "False", "id": "in5ohbh", "is_submitter": "False", "link_id": "t3_x5w4ph", "parent_id": "t1_in4c4sq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "I've done this with QVC Japan for a long time and realized just recently how much it might benefit the numbers issue. Cool to see I'm not the only one.", "created_utc": "1661894781.0", "edited": "False", "id": "imfv9i1", "is_submitter": "False", "link_id": "t3_x1ajtp", "parent_id": "t1_imcrsyl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "Nice. I feel that course is a must-watch for clearing up a lot of things. I guess I'm an evangelist now. Lol.", "created_utc": "1661388423.0", "edited": "False", "id": "ilo6sea", "is_submitter": "False", "link_id": "t3_wwo088", "parent_id": "t1_ilo4sco", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "Of course. Enjoy!", "created_utc": "1661386493.0", "edited": "False", "id": "ilo2asu", "is_submitter": "False", "link_id": "t3_wwo088", "parent_id": "t1_ilo24i8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "No problem. In that case, I definitely recommend pairing Comprehensible Japanese videos with the [Language Reactor](https://www.languagereactor.com/) browser extension so you can hover over the words in the captions and get a definition as you're watching. Also, Tadoku offers [free, online graded readers](https://tadoku.org/japanese/en/free-books-en/) that start at a very low level. In my opinion, you could give the lowest level a try as soon as you can read kana. There will be kanji, but furigana is provided. Many of these have audio, as well.", "created_utc": "1661386376.0", "edited": "False", "id": "ilo20xh", "is_submitter": "False", "link_id": "t3_wwo088", "parent_id": "t1_ilo06ma", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "Awesome! The grammar can *seem* more complicated than it is since the language tends to be taught through an \"English-language lense,\" so to speak. (Or at least, it tends to be taught to English-speakers as if it were a romance language. Square peg/round hole.) This kind of teaching can lead to explanations that aren't exactly faithful and actually rather vague, which can make someone think Japanese is full of strange rules and exceptions, whereas I've actually found it MUCH more straightforward and predictable than any other language I've studied. The verbs are extremely regular and reliable once you learn the \"conjugation\" patterns.\n\nTo cut through the confusion, I highly recommend [Cure Dolly's \"Japanese from Scratch\" course on YouTube](https://youtube.com/playlist?list=PLg9uYxuZf8x_A-vcqqyOFZu06WlhnypWj). The audio is strange, so many people turn on closed captions, but the information is, in my opinion, too indispensable to pass up. (I got used to the voice.) This course helped me start **really** understanding what I was reading/hearing, even in complicated Japanese sentences. If I could only ever recommend one resource for learning Japanese, it'd be this video course. (Just going to clarify right now that I don't mean this is the only resource you'll ever need, haha.) If you only watch one of Cure Dolly's videos, watch the one on [Japanese conjugation](https://youtu.be/FhyrskGBKHE). It clears up how it works in 15 minutes. 15 minutes that may save you years of confusion.\n\nFinally, once you feel ready for some comprehensible input, I recommend the YouTube channel [Comprehensible Japanese](https://www.youtube.com/c/ComprehensibleJapanese). She caters to multiple levels, each with high-quality videos to go through. She also provides captions.\n\nAnyway, sorry for the text wall, and welcome to a fun, fascinating (and logical!) language.\n\n一緒に頑張りましょう！\n\n(Edited because I said something without considering the title.)", "created_utc": "1661385297.0", "edited": "1661385609.0", "id": "ilnzk3f", "is_submitter": "False", "link_id": "t3_wwo088", "parent_id": "t3_wwo088", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "nyako-yaki", "body": "This looks interesting, even though I'm not much of a fan of FPS games myself. I'd like to find some fun avenues to use my TL before I dive more into native content, so something like this seems perfect for that. Is it all right if I take you up on that free copy? I will give feedback, of course. \n\nEither way, thanks for working on something like this and good luck with further development!", "created_utc": "1653079834.0", "edited": "False", "id": "i9di70w", "is_submitter": "False", "link_id": "t3_uu4a88", "parent_id": "t3_uu4a88", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]