[{"author": "oak_oz", "body": "Agreeing with everyone else to pick the one you're more interested in. \n\nI don't know any Spanish, so maybe it's easier for English speakers than German is, but German has so many cognates with English, it's still definitely on the easier side for English speakers to learn. It feels familiar and related.\n\nMy thoughts on Germans speaking English is... sure, a lot of them do. And in Hamburg it seemed they would choose to speak to me in English rather than bad German, but living in a middle sized university town, it's all German.\n\nEveryone has also been really nice about me learning German. I mean, not, like, excited or anything. But friendly and helpful for sure.", "created_utc": "1666944679.0", "edited": "False", "id": "iu3ior7", "is_submitter": "False", "link_id": "t3_yffovq", "parent_id": "t3_yffovq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Thank you! There are not a lot. It was so wild to switch to German and suddenly have every resource available to me! And I am having fun with German too :)", "created_utc": "1666940754.0", "edited": "False", "id": "iu3e48d", "is_submitter": "False", "link_id": "t3_yeg8dx", "parent_id": "t1_iu0ji9p", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "It’s my dad’s first language! I didn’t learn it as a kid, but it feels so familiar and home-y to me! (I have had to put it on hold to learn German, which on the one hand is sad, but on the other hand, mani vecvecāki also had to learn German so… there is a sense in which this is also a family path…)", "created_utc": "1666890178.0", "edited": "False", "id": "iu0epnq", "is_submitter": "False", "link_id": "t3_yeg8dx", "parent_id": "t1_iu09hgm", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Australien und Indonesien liegt nebeneinander, und Lettisch ist die Muttersprache meines Vaters. Also, ja, ich lerne beides.", "created_utc": "1666861363.0", "edited": "False", "id": "itytkto", "is_submitter": "False", "link_id": "t3_yduk17", "parent_id": "t1_itym27f", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Google Translate extension is another option", "created_utc": "1666853073.0", "edited": "False", "id": "ityjx66", "is_submitter": "False", "link_id": "t3_yehh0m", "parent_id": "t3_yehh0m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "So of the three I’m learning (2 on hold) I think Indonesian is the one I’m most keen to eventually get to C2 and stay there. I want to feel totally comfortable with it and even though I have no plans to live there, so maybe it’s overkill, I just really really want to know it as well as I can.\n\nI’m hoping to get German to C1 and Latvian to at least passive C1 though, so it’s not a major difference in goals and German is in way more of a hurry.\n(edit: typo)", "created_utc": "1666847913.0", "edited": "1666852962.0", "id": "ityd1u7", "is_submitter": "False", "link_id": "t3_yeg8dx", "parent_id": "t3_yeg8dx", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Also, like, feels creepy and fetishising.", "created_utc": "1666797827.0", "edited": "False", "id": "itv5yje", "is_submitter": "False", "link_id": "t3_yduk17", "parent_id": "t1_itux9y3", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "if we knew that with any kind of certainty this reddit would cease to exist.", "created_utc": "1666780083.0", "edited": "False", "id": "itu6zih", "is_submitter": "False", "link_id": "t3_yduk17", "parent_id": "t3_yduk17", "score": "166", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "There are a lot of people who say a lot of things about how to learn a language and it can feel like there's no right way to do it. This can be overwhelming, but I think it's better to think that actually, there's no ONE right way to do it. Let that free you to learn in a way that feels good to you. Lots of people learn another language, but for almost everyone who does, it takes years. That's why there are so many click bait videos about learning quickly, it's not the norm and often a scam.\n\nI would focus on finding smaller goals that are important to you to help you measure progress, rather than estimating on the CEFR scale. What do you want German for? What do you want to do in German? Try to challenge yourself in a specific and attainable way so you can see that your skills are actually improving.\n\nPersonally, I'm way focussed on passive input for German, because I live here and being able to understand what's going on is more important to me than being able to make myself heard. When I was learning Indonesian and Latvian I was more output focussed because I wanted to be able to communicate simple things back and forth rather than needing to understand anything complex.", "created_utc": "1666768177.0", "edited": "False", "id": "itttabx", "is_submitter": "False", "link_id": "t3_ydk7jq", "parent_id": "t3_ydk7jq", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": ">this\n\noh wow, that's a great list! thanks for sharing!", "created_utc": "1666766976.0", "edited": "False", "id": "ittrv0m", "is_submitter": "False", "link_id": "t3_ydk7jq", "parent_id": "t1_itths9t", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "That’s a pretty rough situation… fwiw, I don’t think you need to wait to get to B2 in Telugu before starting Banjara, you can keep it up a little and learn Banjara at the same time. But that’s only if you can find a way to learn Banjara. If your husband is speaking to your kid in Banjara all the time that’s one source of learning at least… Does your husband have any take on all this? Is it that his parents wish you were learning their first language for nostalgic reasons or to pass on to your kid more effectively? Or is it a thing where really they just want the greetings in Banjara? (My grandparents spoke to us entirely in English except for greetings and similar - I think those things only felt real in their first language.) Idk, but you can only do what you can do, and it’s really good that you can communicate with them even if it seems like it’s just a way for them to convey their disappointment right now :/", "created_utc": "1666725091.0", "edited": "False", "id": "itrdlcp", "is_submitter": "False", "link_id": "t3_yd9sqw", "parent_id": "t3_yd9sqw", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Looks neat! If you add more languages I'd be keen :)", "created_utc": "1666703617.0", "edited": "False", "id": "itpvqas", "is_submitter": "False", "link_id": "t3_yd3hpn", "parent_id": "t3_yd3hpn", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I think it‘s pretty normal to want to stop and pretty normal to want to keep learning. \n\nLanguages are political tools. They can be, and are, used to justify invasions and to destroy culutures. They are also communication tools. And often the language you need to use to communicate with the victims of such crimes is the one that was used against them. This is general to all colonial languages. Additionally, it’s also in every country’s best interest to have more foreigners learning their language and putting value on their country. eg Korea, not a colonial country, loves more people learning Korean and being into Korean culture. It gives them power.\n\nPeople learn languages for different reasons (travel, culture, cos it sounds cool, family etc) and some of those reasons will be lessened by Russia invading Ukraine and some won’t.\n\nIt’s not that learning a colonial language is bad - most of us have at least one! That’s the nature of them! They are the languages with the most art, the most jobs, they give you the ability to communicate further.\n\nIn summary, do what you want. You learning Russian is not going to change the outcome of this invasion, but it will change your life: the things you engage with and get to know. And, like English, you also choose what parts of Russian you engage with - like reading Dickens is not the same as watching Fox news…", "created_utc": "1666678446.0", "edited": "False", "id": "itowv44", "is_submitter": "False", "link_id": "t3_ycslcw", "parent_id": "t3_ycslcw", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Yeah I‘ve got like 5 different notebooks scattered around my apartment. I just grab whichever is closest and write stuff down. I don’t actively revise it, it’s mostly for the writing. But every now and then I flick through one and see what I‘ve written. Flashcards are also good for vocab.", "created_utc": "1666676373.0", "edited": "False", "id": "itou4j6", "is_submitter": "False", "link_id": "t3_yckygi", "parent_id": "t1_itnhjop", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "That's true. My personal journey with Latvian was much easier the second time round, after focussing on Indonesian, because I knew a lot more about how to find resources and how to use them effectively.", "created_utc": "1666594079.0", "edited": "False", "id": "itk743b", "is_submitter": "False", "link_id": "t3_ybyhq4", "parent_id": "t1_itk6rm1", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "It‘s a hobby, right? If you‘re doing it for fun then do what‘s fun for you. \n\nIt could also be that swapping languages is a way of counteracting boredom in method. So if you decide there‘s one language you really want to focus on for even, say, one week or month, then when you’re tempted to swap languages, instead swap activities and transcribe some song lyrics or watch a youtube video or listen to simplified news. (Make a list of such activities and specific songs/videos/etc ahead of time so it‘s easier to think of what to do.)", "created_utc": "1666593731.0", "edited": "False", "id": "itk6ong", "is_submitter": "False", "link_id": "t3_yc29xo", "parent_id": "t3_yc29xo", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Natürlich German on youtube", "created_utc": "1666590987.0", "edited": "False", "id": "itk38ip", "is_submitter": "False", "link_id": "t3_yc3f7c", "parent_id": "t3_yc3f7c", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Such an interesting thought.\n\nMy guess is some languages will get way more resources in the next decade or so, but not uniformly. Look at whose population is getting richer and might be seen as a target market. Yoruba, Indonesian, Hindi? Or who are creating the new exciting content? (ie the next Korea) Harder to predict, but a government that values the arts and wants to connect with the rest of the world, probably with a large population. Maybe Thai?\n\nI‘m not kidding myself that it will get easier to learn Latvian, it‘s gotten harder since the 90s, because there’s not the same need/desire for the post-WW2/Soviet diaspora to teach their kids Latvian in a foreign land. Ukrainian, Farsi/Dari, are probably becoming easier to learn for similarly sad reasons - a displaced population will create their own learning materials, particularly if they were wealthy before becoming refugees.\n\nBut beyond the theoretical discussion, I wouldn’t wait for resources because a) they may not come, and b) if they do it could easily be for reasons that will make you wish you knew Zulu already, just like all the people the resources were made for!", "created_utc": "1666588266.0", "edited": "False", "id": "itjzgqp", "is_submitter": "False", "link_id": "t3_ybyhq4", "parent_id": "t3_ybyhq4", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Computer science seems like it would be one of the best! I think you can do it - nothing like a deadline and an exciting opportunity to really get you learning :)", "created_utc": "1666552635.0", "edited": "False", "id": "ithsedi", "is_submitter": "False", "link_id": "t3_ybg7jr", "parent_id": "t1_itghoq4", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "As I think most people here will say: it depends how much time you can devote to German this year, and also what's required of you in German in your course. Is it just understanding lectures or also writing essays? I'd say it's doable in more technical fields, but maybe not language heavy fields. It's easier (still very hard!) to develop the passive skills required to read and listen than it is to write and speak competently. I'm at nearly a year of learning German now, without working to such an intense deadline as you, and if I had another 3 or 4 months to prepare myself for a maths semester, I think I could do that. History, on the other hand, no chance.", "created_utc": "1666532252.0", "edited": "False", "id": "itgete8", "is_submitter": "False", "link_id": "t3_ybg7jr", "parent_id": "t3_ybg7jr", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "For me the biggest advantage of Harry Potter isn't the language level, but the fact that I'm familiar with it, which helps carry me along in extensive reading and develop internal definitions for words without looking them up. I recently switched to Anne of Green Gables, which has way more advanced vocab and grammar, but I'm even more familiar with it, so it's actually working out easier for me. So my two cents is that I think the best thing is to read something you've read multiple times in your NL even if it's a little 'harder'.", "created_utc": "1666531317.0", "edited": "False", "id": "itgcyvi", "is_submitter": "False", "link_id": "t3_yanlj6", "parent_id": "t3_yanlj6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I am Australian and this still sometimes happens to me. I think our accent tends towards not enunciating things very strongly, and with masks it's a nightmare. I would tend to laugh, gesture at my ears, and maybe make a comment like \"sorry, it's so hard with the masks\" in a kind of self-deprecating tone, to make the atmosphere less awkward. So, that's the culture side of things. Easier said than done, but: try to feel less embarrassed about it.\n\nBut, I get that you're probably looking for advice about comprehension, and on that note I have two things. One, try and listen to content that's as casual Australian as possible. So, if you've mostly been listening to British or US content, seek out Australian or NZ stuff (message me if you want particular suggestions catered to your interests) or even just more diverse English from around the world, like Irish/Indian/Caribbean content, just to stretch the different ways English can sound to you. If you've already been listening to Oz content, try and find some that's really casual, like terrible podcasts, twitch streamers etc. The \"standard\" Australian accent found on a lot of tv is a lot more crisp than people speak in real life.\n\nTwo, this is completely unscientific, but I suggest trying to write out the ways Australians actually pronounce phrases. My dad used to have a top that said something along the lines of \"Strain Nashnul Yoonee\" because that's how we all say \"Australian National Uni\". Obviously some of that is common to all English, but Australia -> Straya is an important part of comprehension here. So I think maybe writing some of those sounds down in Australian vs British vs US English might help.  \n\nGood luck!", "created_utc": "1666530805.0", "edited": "False", "id": "itgc0c4", "is_submitter": "False", "link_id": "t3_ybgkpb", "parent_id": "t3_ybgkpb", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "So you didn’t have much of a choice in studying French and you don‘t really care to? \n\nOptions: (a) give up, get the bare minimum grade or drop it for something else, (b) use it as an excuse to learn things about grammar and pronunciation that could be useful for learning other languages you care about in the future, see it as a fact finding mission or (c) find a reason to actually want to know French (eg travel, music, film, literature, food) and visualise how knowing some French could make your future or current life better.", "created_utc": "1666360530.0", "edited": "False", "id": "it7dsa2", "is_submitter": "False", "link_id": "t3_y9tl6y", "parent_id": "t3_y9tl6y", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "German? It's a big language, it's related to English and there are probably lots of Turkish learning resources too.", "created_utc": "1666342193.0", "edited": "False", "id": "it6kq1v", "is_submitter": "False", "link_id": "t3_y9m38k", "parent_id": "t3_y9m38k", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Multilingual, even? Agreed it feels incredibly jarring.\n\nI have no personal advice, but a lot of people swear by cross talk, where you each speak your own native language and therefore pick up each others language through the listening component.", "created_utc": "1666341176.0", "edited": "False", "id": "it6jkyn", "is_submitter": "False", "link_id": "t3_y9g61q", "parent_id": "t1_it6dplc", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Thank you again for all the encouragement. It really is hard! But I can believe you, and it‘s really useful to hear how it was for you :)", "created_utc": "1666332890.0", "edited": "False", "id": "it69c6e", "is_submitter": "True", "link_id": "t3_y8vm0l", "parent_id": "t1_it68f8s", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Thank you! Yeah, I mean, if you‘re not confident with English in Australia you won‘t get far making local friends. I keep wishing I could go back to the international students I used to play soccer with, but with this new understanding of what it‘s like to feel like a drain on the conversation and awkwardly out of place. I plan to be here for a few years at least, it‘s good to have a reminder of how important it is to keep making an effort to be engaged.\n\nThis might feel like a silly question but… it can be done, right? How long til you could communicate in a way that let you make friends? I know we‘re all different, but just looking for some hope that it‘s possible, I guess. I mean, I know it in theory… but it still feels so far and even though I‘m working so hard at it, it has felt slower than I had hoped.", "created_utc": "1666331344.0", "edited": "False", "id": "it6785s", "is_submitter": "True", "link_id": "t3_y8vm0l", "parent_id": "t1_it65vx2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Yeah, you‘re right, my days are mostly in English. I‘ve joined a casual hockey club and everyone speaks German there, but honestly while it‘s a friendly place it‘s not particularly chatty and I‘ve not contributed much. I‘ve also got a once a week conversation class which is really nice! But yeah, for sure, social integration could also do with some work, my social life here is pretty limited and also basically all in English.", "created_utc": "1666330026.0", "edited": "False", "id": "it65b6p", "is_submitter": "True", "link_id": "t3_y8vm0l", "parent_id": "t1_it63utj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I like texting with my Dad in Latvian, I think he finds it less weird than trying to adjust to speaking to me in Latvian. Does he have any fave Tagalog books he could read to you? You want to make it a thing that‘s appealing to him too, rather than just frustrating, so try and find things you can share. Like, my Dad will send me Latvian poems he likes and we went through some of his parents old letters, translating them together - obvs he was doing the heavy lifting there, but he let me have a go first!", "created_utc": "1666286051.0", "edited": "False", "id": "it3dk5d", "is_submitter": "False", "link_id": "t3_y8hh9g", "parent_id": "t3_y8hh9g", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Yeah it's for sure the most stressful for me too! But I mean I guess that's the same in English tbh :'D", "created_utc": "1666276308.0", "edited": "False", "id": "it2ojhk", "is_submitter": "True", "link_id": "t3_y8vm0l", "parent_id": "t1_it2niqi", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Thanks! I'm living in a town rather than a city and most people here have let me stay in German even through my fumbling disasters. It was a total shock when I went to Hamburg and everyone there switched to English immediately, good to know I can ask to switch back next time I go on holiday :)\n\nI'm feeling really excited to move into a more natural way of existing where I can have these little interactions and be more part of the town. And it's encouraging to hear that you think I'll improve faster now, I've been feeling so impatient lately!", "created_utc": "1666275683.0", "edited": "False", "id": "it2n0c7", "is_submitter": "True", "link_id": "t3_y8vm0l", "parent_id": "t1_it2kc5k", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "My biggest gains in comprehension have come from the Natürlich German youtube, simple dubbed English shows (Midsomer Murders, Avatar) and just watching as much simple repetitive subtitled German tv as possible (terra x docos, bares für rares). This has helped my comprehension heaps, way more than actually talking to people. But I‘m in Germany so… the dialect thing is not something I‘m having to contend with at the same level you are.", "created_utc": "1666263742.0", "edited": "False", "id": "it1zbaq", "is_submitter": "False", "link_id": "t3_y7ze7y", "parent_id": "t1_it1yp7o", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "\\*cries in Latvian\\*\n\nPlease take this as a desperate plea for any Latvian comprehensible input you happen to know. All I've got for CI is Tofiks and Palīgā on Youtube (neither of which I'm getting along with very well) and the simplified news on LSM, which I like but obviously it has its limits. I'm sure there are other languages that have it worse, but I didn't know what I was missing til I started learning German and there's just so many resources of all kinds and now I'm spoiled.", "created_utc": "1666260977.0", "edited": "False", "id": "it1vm4s", "is_submitter": "False", "link_id": "t3_y8kl60", "parent_id": "t3_y8kl60", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I completely second listening to music, it'll help your listening comprehension a lot and it gives you a really nice sense of progress when you hear a song you haven't heard in a while and you understand way more of it. \n\nOnce you have a few favourites, I recommend pulling up the lyrics and reading them through with the song playing so you're getting a sense of the flow of words and can start to sing along. When I was a beginner I would translate the first few lines, or the chorus, word by word, for a bit of vocab learning, and then do a quick google translate on the rest so I knew what the song was vaguely about.", "created_utc": "1666250097.0", "edited": "False", "id": "it1jb45", "is_submitter": "False", "link_id": "t3_y8i0gw", "parent_id": "t1_it1a33t", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Also, even if you don't feel comfortable talking, it can be useful to practise listening comprehension just sitting in public spaces, like a cafe or bakery, and listening to the same interactions over and over.", "created_utc": "1666248955.0", "edited": "False", "id": "it1hyzt", "is_submitter": "False", "link_id": "t3_y7ze7y", "parent_id": "t1_isxaktd", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Same. Learn the words while reading, learn to pick them up at real time while watching. I use subtitles when they’re available and match. At the moment I’m watching a lot of dubbed stuff without subtitles - detective shows, avatar - and native stuff with them - mostly reality shows and docos.", "created_utc": "1666190103.0", "edited": "False", "id": "isxvqmy", "is_submitter": "False", "link_id": "t3_y7h24m", "parent_id": "t1_isuwwhr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Corner Gas, Schitt's Creek :)", "created_utc": "1666077260.0", "edited": "False", "id": "isry5ax", "is_submitter": "False", "link_id": "t3_y4yhsu", "parent_id": "t3_y4yhsu", "score": "2", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "oak_oz", "body": "My guess is that you may as well keep up with some French til you leave, it’s more that once you’re actually in Spain I think you’ll want to set it aside because you’ll find it getting in the way when you try to speak Spanish. But it will for sure come back, and feel like an old friend!", "created_utc": "1666072834.0", "edited": "False", "id": "isrsoqv", "is_submitter": "False", "link_id": "t3_y66w6i", "parent_id": "t1_isphpjp", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Changing your accent to fit in and be considered more ~professional~ is 100% different than putting on an accent to mock people in a joke. It’s also a thing many people have to do or choose to do, you’re not alone.", "created_utc": "1666022285.0", "edited": "False", "id": "isoqun2", "is_submitter": "False", "link_id": "t3_y6278l", "parent_id": "t3_y6278l", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "It seems like you’re working really hard and you’ve made a lot of progress. It’s certainly not pathetic to not yet be perfect. And if you do fail the B2 exam again that seems pretty normal because of how little time you’ve had. It’s not that easy to just pick up another language, it doesn’t mean you’re not learning. You’ll get there, you just need more time. I get that you probably need to pass the B2 exam urgently, but try to be kind to yourself about it - you’re in a difficult situation needing to learn a language so quickly.", "created_utc": "1666021907.0", "edited": "False", "id": "isopyvh", "is_submitter": "False", "link_id": "t3_y6470k", "parent_id": "t3_y6470k", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I'm 6 months into my life in Germany, and I started learning German from almost nothing about a year ago. My Indonesian was probably at about the same level as your French. So, some similarities to your situation, but a lot of differences too.\n\nI had to completely pack Indonesian away in my mind to stop it getting in the way when I first got here - for about 3 months I didn't touch it at all. At one point I had a huge panic that it was gone forever because I couldn't even form a basic sentence. Now that I'm more relaxed I interact with Indonesian a little bit on social media, occasional youtube video and I've realised it's basically all still there. So I wouldn't worry about not using French for the time period you're suggesting. But given you kind of want to solidify your French, I have no advice on whether/how that can be done without getting in the way of intensive Spanish.", "created_utc": "1666005663.0", "edited": "False", "id": "isnt9q2", "is_submitter": "False", "link_id": "t3_y66w6i", "parent_id": "t3_y66w6i", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I have the Mittelpunkt B1+ and it says it's designed to prepare you for a B2 course. What that means, precisely, I still don't know. But it has good exercises! (I have no idea what my level is.)", "created_utc": "1665831058.0", "edited": "False", "id": "isehw33", "is_submitter": "False", "link_id": "t3_y4gg16", "parent_id": "t1_ise4rlt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "How are you with writing? If that's fine, then it's probably either a speed or confidence thing. I'd do a lot of shadowing and speaking in low pressure situations, and then deliberately put yourself in harder situations, slowly.\n\nIf your writing is also a struggle, then it's probably a recall/activation issue. I'd keep a regular journal, and find someone to text with. That should help your speaking too.", "created_utc": "1665830891.0", "edited": "False", "id": "isehoc8", "is_submitter": "False", "link_id": "t3_y3yds6", "parent_id": "t3_y3yds6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "The closest I got to exercises was consciously visualising a king (or, more specifically, Anthony Head's King Uther) when I heard sentences with \"will\" in them for a little while, particularly when I felt that my first interpretation had been wrong. And walking around the house overpronouncing simple sentences like \"ich WILL ins Kino gehen\" \"ich WILL Schockolade essen\" in a really petulant whiny princeling voice. (My guess is that the second one won't help at all because if it's overpronounced you probably always get it right anyway.)\n\nI don't think I ever really interpret it wrong now. Though like you say, English is pretty deep rooted, so who knows, the issue may come back at some point. I was probably working on it for about a month, pretty casually while watching tv mostly. It's hard to know because the practise of visualisation naturally died off as I got better at it. But let's say a month.", "created_utc": "1665675973.0", "edited": "False", "id": "is61uoh", "is_submitter": "False", "link_id": "t3_y1ajpv", "parent_id": "t1_is5kv1d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Agreed. Variety is important too. I find I'm more likely to get tired or bored even when I'm interested in the content, presumably because it's still hard work. So I make sure I have a range of books/audiobooks/music/comics/tv shows/movies so I can always find one that suits my mood, or swap if I get tired.", "created_utc": "1665667182.0", "edited": "False", "id": "is5gu3k", "is_submitter": "False", "link_id": "t3_y2v8ki", "parent_id": "t1_is580rc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "It depends what you want, honestly. You can, for sure, keep growing your knowledge in three languages at once. If it's important to you to stretch your German and Japanese, so you can have fun using them while travelling: go for it! You can still learn a little bit of Swahili while doing this.\n\nBut if your main goal is to get conversational in Swahili, it's probably best to focus on that, and only switch to studying German and then Japanese right before you go.\n\nYou do you, there's no 'right' choice here.\n\n&#x200B;\n\nAddition: If you want to keep learning several languages at once, try to build them into your life in different ways/spaces/times. When I was learning Indonesian and Latvian at once, I would: do an app lesson of Latvian in the morning in bed, then after work I would listen to Indonesian podcast/radio and read a bit (with a dictionary) - either in kitchen or on the couch. After dinner, I would more formally study Latvian at my desk, using flashcards, writing sentences, learning grammar, translating song lyrics etc.", "created_utc": "1665666110.0", "edited": "False", "id": "is5eiwe", "is_submitter": "False", "link_id": "t3_y2ghhl", "parent_id": "t3_y2ghhl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Other: necessary first, favourite later :'D", "created_utc": "1665664981.0", "edited": "False", "id": "is5c6h0", "is_submitter": "False", "link_id": "t3_y2vw0f", "parent_id": "t3_y2vw0f", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I don’t have broad advice, but for this specific instance I can tell you what worked for me.\n\nInstead of trying to get to “want”, I rewrote it in my brain as formal/old-timey usage of “will”, like, “i will, that the peasants pay higher taxes”, or “it is my will, that that you attend to your chores”. \n\nIt helped that I grew up in church with “thy will be done” etc, but it’s even used in way more modern circumstances, and that helped me stop forcing it and ~feel~ it. And now the kid crying out that he “will Eis” sounds like a tiny demanding lord :D", "created_utc": "1665553408.0", "edited": "False", "id": "irzltf0", "is_submitter": "False", "link_id": "t3_y1ajpv", "parent_id": "t3_y1ajpv", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I picked Indonesian back up at the start of Covid with a similarly helpful mindset: \"well I know I'm not going to get to travel anywhere in a hurry, so I have time to get good!\" Sometimes you just gotta take that time pressure of yourself so you can enjoy the journey.", "created_utc": "1665506168.0", "edited": "False", "id": "irwp2h2", "is_submitter": "False", "link_id": "t3_y0su7w", "parent_id": "t1_iruteq5", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Yeah, I gather it's pretty difficult for people to start speaking a different language with their partners, it just doesn't really work for most couples, my parents included! Good luck with the subtitles though :)", "created_utc": "1665505810.0", "edited": "False", "id": "irwo5mq", "is_submitter": "False", "link_id": "t3_y0wupm", "parent_id": "t1_irw4l4d", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "If the gap between formal, enunciated speech and the wide range of casual speech is causing heartache, Indonesian is the last language I would recommend. It's not just a variation in speed or accent, but the grammar also changes, and it takes on significant regional variation! (I otherwise wholeheartedly recommend it as a great language to learn, but this is like, a really really hard part of learning Indonesian.)\n\n  \nFwiw, I think shadowing people who are harder to understand would be useful. I get that your partner is not keen on just chatting with you in Spanish, but do you think he could help you on simple sentences? Like, if you don't understand something he says to his family, or vice versa, perhaps get him to say it to you at full speed later, break it down, and then say it at full speed again, so you can shadow him and see how it feels. \n\n  \nIt seems the specific difficulty is likely between \"should we go shopping\" vs \"shweegoshoppin\", yeah? If so, even getting just a few particularly common phrases worked out at blurry-full-speed could really help. If not with your partner, then just try to find any source material you can't understand that has subtitles, and use that for the same purpose. Play a single sentence, slow it down, play it 15 more times, repeat etc, until your brain can hear the ways the words slur together and their rhythm. (Shadowing helps with interpreting meaning so do that too.)", "created_utc": "1665496403.0", "edited": "False", "id": "irw1bmb", "is_submitter": "False", "link_id": "t3_y0wupm", "parent_id": "t1_irv2h14", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Yeah, I like to listen to dubbed (into TL from NL) movies as passive-ish input while I work, it's great with movies I know really well in the original. (I'm working in a non-language based job, ymmv.)", "created_utc": "1665479588.0", "edited": "False", "id": "irvavdm", "is_submitter": "False", "link_id": "t3_y0z33m", "parent_id": "t3_y0z33m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Stick with the language you love. Learning a language is not cultural appropriation, nor is teaching it. \n\nI would say that teaching a language (regardless of whether or not your family is historically from that region) means you should pay attention to cultural nuance and be careful not to misrepresent the region or position yourself as a spokesperson for it. I've heard some incredibly cringe things from language teachers making broad generalisations about countries, speaking with authority because they \\~know the language\\~ . Possibly that kid has heard similar things and that's why he's bristling at you. Btw the less power the language has in its own right the more harmful this kind of stuff has the potential to be, which is one of the reasons people get touchy about Indigenous languages. But it is in no way inherently harmful, and Japanese is a pretty big language.\n\nOn the note that someone made, it is possible this kid doesn't speak Japanese, and if not, that's probably actually really hard to deal with. For some people language learning is a fun game or challenge, but then it's also incredibly personal for others. (For many people: both!) But it can be tiring to have people treat your language really casually, making jokes about how hard it is or how easy it is, or how it's stupid how it does X, or acting like it's just a game to get to the next level. Cross cultural experiences can be hard. As a language teacher of any language, this is going to come up and if you're sensitive, you can handle it well. \n\nAlso, you're... allowed to like Japanese culture. It's not problematic to have been really into anime and manga as a kid? Would you look at a kid getting excited about anime and manga and tell them they're actually problematic because they're finding joy in another culture? Try and see it through an outside lens, rather than assuming judgment of yourself is always the morally correct action.", "created_utc": "1665384975.0", "edited": "False", "id": "irqg2qg", "is_submitter": "False", "link_id": "t3_y00pty", "parent_id": "t3_y00pty", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I agree with all of this.\n\nI would guess that mostly people who can, 5 months later, communicate almost perfectly, already had a strong grounding in English (lessons, tons of native input) but less experience in actual native conversations/output. Maybe they needed to learn to understand the pace or the accent, maybe they'd never had to really speak before. But they were almost certainly better than they seemed to you, in terms of passive understanding, vocab, and grammar knowledge, it would have mostly been a matter of putting it all together.", "created_utc": "1665251535.0", "edited": "False", "id": "irjd8vr", "is_submitter": "False", "link_id": "t3_xyv9wg", "parent_id": "t1_irivf6b", "score": "62", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I voted Dari, but could have gone Gujarati. \n\nMy dad was probably in a similar situation to you but with Latvian - he's English dominant, his parents were fluent in English - and I didn't learn it as a child but I wish I had. Or, rather, I wish it had been considered a serious and valuable option for me even though it's not 'useful'. \n\nInstead my Latvian grandparents taught me German, which they were also fluent in and which they considered a more 'useful' language. I now live in Germany, and hey, maybe those childhood lessons were more useful.\n\nBUT, I think it's a real shame that it took me being an adult, trying to cope with the concept of mortality, to realise that I even /could/ learn Latvian. I love the sound of it, it sounds like my grandparents, and it's valuable to me in a personal way. But I didn't realise it was a thing I could learn. And my dad has, since, really enjoyed sharing it with me.\n\nSo what I'm saying is, even if you decide on Mandarin or Spanish, I recommend you also provide some Dari and Gujarati resources for your kids, and encourage them if they show any interest in learning bits and pieces. Even if they don't take it up seriously, it's nice to feel... familiar and welcome with it.", "created_utc": "1665173394.0", "edited": "False", "id": "irfy211", "is_submitter": "False", "link_id": "t3_xy4u5x", "parent_id": "t3_xy4u5x", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Excuse my late reply, been thinking about this since it was posted. \n\nFor me, it was leaning into my strengths/interests. I'm more into reading than listening in my English-speaking life and always have been. I'm pretty sure it's where I learned most of my English vocab too. So I just gave up trying to learn through audio and focussed on reading. Like, I think the Easy German videos are gold, but I cannot watch a bunch in a row, whereas I can read for hours.\n\nI still watch tv in TL, sometimes actively listen to podcasts as lessons on particular topics, often have TL music/movies playing in background while I work. All these things are useful. But they are now simply building off and solidifying the vast amount of time I spend reading. Reading as my main focus turns language learning into the path of least resistance for me. It's easier to do that than to do any other hobbies/chores/etc. It means I'm not going to spend days without my TL, because I always want to read.\n\nSidenote: I also really enjoy puzzles, so the beginning stages of language learning are really interesting to me, and I'm not really learning the grammar building blocks through this method, I've only found it useful once I've learned those. And of course, the main point is that reading is what I love. Don't fight yourself, work with yourself.", "created_utc": "1665125951.0", "edited": "False", "id": "irdnux6", "is_submitter": "False", "link_id": "t3_xx0ude", "parent_id": "t3_xx0ude", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "There's so much fun to be had with cognates! My favourite is 'verloren' which is pronounced basically like 'forlorn' (with my accent anyway) and means... 'lost'!\n\nComing from Indonesian and Latvian, both of which I have more personal motivation for, the ease with which I can (a) memorise German vocab and (b) find resources, makes it all feel like learning a language on easy\\* mode.\n\n\\*(Obviously learning any language properly is hard... But it was much easier for me to get a foothold in German.)", "created_utc": "1664973339.0", "edited": "False", "id": "ir54zso", "is_submitter": "False", "link_id": "t3_xvzmhn", "parent_id": "t1_ir4ko5x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Indonesianpod 101 have intermediate podcasts/mini lessons, including on colloquial Indonesian, and I've found them really useful. It's not an 'app' per se, though...", "created_utc": "1664968441.0", "edited": "False", "id": "ir4wlsj", "is_submitter": "False", "link_id": "t3_xvs1ix", "parent_id": "t1_ir47t9l", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I'm a talkative person, normally, so I spend a lot of time feeling awkward and not like myself. And I get embarrassed pretty often just handling daily life (deliveries, vet, shopping) because I misunderstand what people are saying or I don't know how to respond.", "created_utc": "1664883394.0", "edited": "False", "id": "ir056v9", "is_submitter": "False", "link_id": "t3_xvbdjl", "parent_id": "t3_xvbdjl", "score": "22", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "My experience is that it depends how much time I'm spending on reading. If I'm reading a lot, the words tend to stick better. If I'm only reading a little (because the content is too hard or I don't have much time) then the words tend to evaporate and I need some more formal revision. Personally, I use flashcards/similar to get quick lists down, with vocab specific to a topic, or if I feel like I'm hitting a plateau. But that's very intermittent, and I've learned tons of words just through reading with a dictionary in the last month.", "created_utc": "1664872096.0", "edited": "False", "id": "iqzquxh", "is_submitter": "False", "link_id": "t3_xv813h", "parent_id": "t3_xv813h", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "This isn't a response to the question, but a bit of advice to help in your goal. Make sure you set up a plan with the host family right at the beginning, especially if they have kids who are learning English, or you could find you get no German practise at all and become quite frustrated. It could be that conversations from between you and the parents is German, with the kids is English. It could be German at breakfast, English at dinner. It could be cross talk all day, where they only speak German and you only speak English. But make sure you're all on the same page and that page includes a big chunk of German!", "created_utc": "1664864120.0", "edited": "False", "id": "iqzhhs7", "is_submitter": "False", "link_id": "t3_xuz1ps", "parent_id": "t3_xuz1ps", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I really thought I was saying “ich” properly, a soft sound at the back of my throat, til i got here and - perhaps specifically where I am in Hessen? - everyone seems to say “ish” (and also “nisht”), and that’s straight up how my private language tutor told me to say it.", "created_utc": "1664780386.0", "edited": "False", "id": "iqutmr9", "is_submitter": "False", "link_id": "t3_xubhxt", "parent_id": "t3_xubhxt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "haha i see, carry on everyone.", "created_utc": "1664777237.0", "edited": "False", "id": "iquppns", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t1_iqsw0ip", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "What’s the Hub? I just did a quick google and couldn’t figure it out…", "created_utc": "1664740127.0", "edited": "False", "id": "iqsj5ng", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t1_iqsewyh", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I voted for three. Two of those are languages that I want to spend a lot of time with and in, more than I want to spend time learning other languages. The third is a language I'm learning for more practical purposes, and so my number is flexible, because if another language becomes particularly useful it would add to my desired total, rather than replacing any. We'll see how life pans out, I guess?", "created_utc": "1664726403.0", "edited": "False", "id": "iqri9su", "is_submitter": "False", "link_id": "t3_xtpozd", "parent_id": "t3_xtpozd", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "German, because my partner had the opportunity to take up an (English speaking) job here. If I could have chosen any country to live in, Germany wouldn't have been first choice (Singapore!!!) but it probably would have been in the top 10, so, easy choice to go! And I'm loving the chance to learn a language in-country, even if it means Latvian and Indonesian are temporarily shelved.", "created_utc": "1664645840.0", "edited": "False", "id": "iqncidh", "is_submitter": "False", "link_id": "t3_xsyw2r", "parent_id": "t3_xsyw2r", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I'm also a foreigner trying to learn a language in-country without a lot of contact with people here (work from home) and so far what's working for me:\n\n\\- find a way to learn the language somewhat regularly at home in your own time (duolingo is fine, but if it's not working for you, try a textbook or pimsleur like someone mentioned. Anything you can do regularly.)\n\n\\- take advantage of being in Turkey to watch Turkish tv (literally just have the tv/radio on at all times and tune in when you can), buy cheap kids books from secondhand stores, read the backs of labels, anything. It feels like 'immersion' should just happen naturally but you still have to work at it, it's just easier to do because there's always Turkish stuff around.\n\n\\- figure out a particular interaction you want to 'solve' and specifically write/recite relevant sentences eg. for me the first one was going to a bakery - what questions will they ask, what will my responses be. Once that one is 'solved' move onto another one. Create more difficult situations for yourself if you need to - challenge yourself to ask a storeperson if they have something in a different size or colour.\n\n\\- find a Turkish conversation space - I pay a private tutor for an hour a week, but sometimes universities will offer free spaces like this, so investigate a little. How are other foreign students learning Turkish? Are some of them learning quicker than you, and you can ask them what their secrets are?", "created_utc": "1664644313.0", "edited": "False", "id": "iqn8u0u", "is_submitter": "False", "link_id": "t3_xsz59e", "parent_id": "t3_xsz59e", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I also want to add that the reason I believed this would work is because it worked for my other uni classes. This is, genuinely, how I learned maths, physics, and chemistry. I never had any reason to think it wouldn't work for language. I did the homework, I applied myself in class. \n\nIt's just that language is different - more like art and sport - and if you want to get as comfortable with it as you need to be to really use it, you need to give it extra time.", "created_utc": "1664630695.0", "edited": "False", "id": "iqme2xu", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t1_iqhug5k", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I say this with kindness, as a person who is also prone to such things: No, it's not particularly normal, it's obsessive in an unhelpful way, and it is almost certainly slowing you down in your language learning journey.\n\nI would suggest finding ways to deal with your anxiety more broadly would likely help with this, as my guess is this is just a particular outlet for those issues but I am not even vaguely an expert, just another person who sometimes has bad anxiety and lets my sometimes helpful obsessiveness go too far at times.", "created_utc": "1664562255.0", "edited": "False", "id": "iqj3kkl", "is_submitter": "False", "link_id": "t3_xs7z51", "parent_id": "t3_xs7z51", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "It does take time out of my other hobbies, especially for the first 2-3 months, and I just accept that.\n\nBroadly I try to get into the \"in-use\" phase as quickly as possible in areas that interest me. So I focus on getting the vocab for my hobbies as quickly as possible - eg learn all the cooking words and then start using new recipes in TL, watch TL cooking channels. Actually running and cooking are not so bad, I used to jog listening to language learning podcasts, and once past the real beginning, listening to simplified news in TL while cooking - pausing regularly when things get a bit noisy. \n\nEvery time I've tried to make a schedule it just makes me not want to do anything, so I don't bother, I just try to make it as easy as possible to maintain contact with all my hobbies and hope it all pans out in the end. This means making playlists of TL music, following TL youtubers/instagrammers, bookmarking language learning websites etc. And do similar things for your other hobbies.", "created_utc": "1664544424.0", "edited": "False", "id": "iqhvvsc", "is_submitter": "False", "link_id": "t3_xryh7n", "parent_id": "t3_xryh7n", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "My advice is not to just enrol in a class, do the work assigned, and think that will be sufficient. It's what I did for Indonesian many years ago, and while I did learn some really useful stuff in that class, it was much slower than it could have been. \n\nAnd I know this because later I decided to learn it again, and this time the class was in addition to my own schedule of learning - it was a chance to practise speaking and pick the brain of my teacher - but most of my listening/reading comprehension happened entirely on my own terms/time. I progressed so much faster and got more out of the classes too.", "created_utc": "1664543762.0", "edited": "False", "id": "iqhug5k", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t3_xrz4tt", "score": "41", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I think you're both right, just coming from different perspectives. \n\n\\- Many people learn languages successfully for employment purposes, particularly English, and/or the primary language of a country they currently live in or for very strong reasons want to migrate to.\n\n\\- Many people who already have English, and/or the primary language of the country they live in, also start learning other languages for employment purposes. This may be to increase potential job opportunities, with the dream of travelling with work, with the goal of getting paid more, or because they want to work in a language specific field... \n\nIn the first group, the language provides many options, not one specific use, and will maintain its importance and availability, regardless of how you're feeling and if your life/career changes. It's easier to stick at this language, even though it's primarily for employment purposes, because it will always seem valuable. In the second group the TL is more likely to suddenly seem less relevant, when things get hard, or your life changes. It's optional in a much more obvious way - the language employment is more of a perk, or an option, rather than a door to many more options.", "created_utc": "1664543086.0", "edited": "False", "id": "iqht157", "is_submitter": "False", "link_id": "t3_xrz4tt", "parent_id": "t1_iqhqijj", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "My Indonesian teacher would sometimes recite bits of English verb tables, as an underlining point, to remind us that all languages have their difficulties, and you just have to learn them. She speaks English at a completely fluent level. She recites these verb tables with the sound of pure memorisation. And it was a useful lesson to me that something that feels unnatural can obviously be a foundation for natural language usage.", "created_utc": "1664475827.0", "edited": "False", "id": "iqecfwc", "is_submitter": "False", "link_id": "t3_xrbhkf", "parent_id": "t3_xrbhkf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "\\^\\^ There are seasons. Relax in the fact that your energy will come back. Broadly, I think it's useful to just keep one aspect going. It's okay if it's not your main focus for a little while, just make sure you're doing something to keep 'in shape', as it were. The language will still be waiting for you when you're ready to give it a little more energy and excitement.", "created_utc": "1664475310.0", "edited": "False", "id": "iqeb3uk", "is_submitter": "False", "link_id": "t3_xrabnw", "parent_id": "t1_iqdvd3q", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "It's definitely one followed by another for me. I start with resources (books, blogs, apps) to get some basics down, and then skew heavily towards immersion. I'm not averse to classes/tutors either, they're just not the main way I ever expect to learn.", "created_utc": "1664364900.0", "edited": "False", "id": "iq81hrj", "is_submitter": "False", "link_id": "t3_xpsypn", "parent_id": "t3_xpsypn", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I'm not at this level, but I definitely vary from day to day and throughout the day. If I'm focussed on something else my German ability plummets. Even things that I know quite well I forget at my social hockey, because my brain seems to be busy with sport. And it's a shame because everyone is nice and I'd like to be able to join in the chatting a little more.", "created_utc": "1664277197.0", "edited": "False", "id": "iq394dq", "is_submitter": "False", "link_id": "t3_xoslru", "parent_id": "t3_xoslru", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Listening to Netflix movies or Comprehensible Input videos during some of my work day (usually 3 hours ish). Reading (extensively) for about an hour every evening - either a book that I know well in English, or from the Dino Lernt Deutsch series. Watching TV for about an hour every evening (either a show I already know, dubbed, or a very formulaic one like a cop show), with subtitles if there are accurate ones. Once a week, private conversation class for an hour.\n\nBut this schedule is changing on a kind of monthly basis at the moment. I've gotten quite good at listening, and my vocab has improved immensely, but I think I need to spend some time on output or solidifying, so that I can actually use the things I know.\n\nI'm also living in Germany, so incidental things like shop labels and interactions with shop staff etc, but I work from home so this is a very small amount of time.", "created_utc": "1663951861.0", "edited": "False", "id": "ipm5ay4", "is_submitter": "False", "link_id": "t3_xkdsqb", "parent_id": "t3_xkdsqb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "My favourite thing about Latvian is the locative case. So to say something is in the kitchen, you change the end of the word for kitchen, instead of adding a preposition. It's a really interesting and different concept for an English native speaker, but so cool! \n\nIn Indonesian I have specific attachments to some of the basic words (yang, ada) and I often wish I could use them in English because they seem neater and more effective.", "created_utc": "1663580476.0", "edited": "False", "id": "ip1lhhj", "is_submitter": "False", "link_id": "t3_xi13p4", "parent_id": "t3_xi13p4", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I think I understand this, though from hobbies outside language learning. \n\nMy advice, ymmv, is to (a) try to romanticise it yourself. Make it cute for you! Daydream a little about how cool it would be to speak Punjabi for real. Find some instagram accounts that you find aesthetic for whatever floats your boat, but make sure they're operating in Punjabi and imagine how cool it would be to meet them and chat in Punjabi. Unfollow all the social media that makes you feel out of place. \n\nAnd (b) I'm guessing you were hoping positive reinforcement would come from your boyfriend and it's not really working out that way because he just wants to speak in English. If the point of learning it is to speak it with him... I get the feeling that's not how relationships (family, romance, and friends) tend to pan out. It seems people tend to speak the language they've always spoken together. So maybe it's important to find another reason - even if that's just to watch Punjabi media with him and share Punjabi songs.", "created_utc": "1663517470.0", "edited": "False", "id": "ioxxoxd", "is_submitter": "False", "link_id": "t3_xhhrev", "parent_id": "t3_xhhrev", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I jump all over the place. The goal for me is always quantity over quality, and in as many different directions as possible. \n\nI started German before Christmas, with only a little knowledge from childhood lessons. First I went to Duolingo for basic vocab, and read Wikipedia + a concise grammar textbook + blog posts to teach myself the basics of the grammar. (Fortunately I'd been studying Latvian so I didn't have to learn the concept of declensions.) I do this because I enjoy it and it's a fun puzzle. The patterns of languages are really interesting to me and I find it helpful to learn the broad rules. At the same time, I found some German music to listen to and watched a bunch of Easy German videos. After a while I listened to some audiobooks of books I'd recently read in English/knew well. Sometimes followed bits, sometimes didn't at all.\n\nCut to now, in Germany, actually learning to get by, and I'm mostly going with comprehensible input, just trying to get as much reading and listening in as possible. Some of this is designed (the Dino books, Natürlich German) and some is just English shows dubbed into German and re-reading books I know in German. I occasionally write myself little scripts to get through particular interactions. I have a textbook that I sometimes do exercises from. I have a private one hour conversation language class each week. I am planning to take a formal evening course at the uni when it starts, which will be 4 hours a week, if I get a spot. I go through brief phases of doing anki/flashcards but only when I feel like I need a sudden burst of vocab.", "created_utc": "1663499456.0", "edited": "False", "id": "iowurxc", "is_submitter": "False", "link_id": "t3_xh5x9p", "parent_id": "t3_xh5x9p", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I have no advice, just commenting because I, too, am curious to read any answers.", "created_utc": "1663337637.0", "edited": "False", "id": "ioo232z", "is_submitter": "False", "link_id": "t3_xfp3xv", "parent_id": "t3_xfp3xv", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "I was using it for Latvian because it was the only app I could find. I don't have any strong feelings other than general gratefulness that I had somewhere to learn pronunciation and basic vocab. It was pretty limited - I worked my way through the entire course over a few months, just doing a little each day - but it seemed fine to me for what it was. It had a few conversational sections where you could record yourself. There were no grammar explanations at all. When I go back to Latvian I will probably run through it all again, to give myself a refresher. But I would never suggest anyone use it if they had duolingo as an option...", "created_utc": "1663326253.0", "edited": "False", "id": "ionf188", "is_submitter": "False", "link_id": "t3_xecwxr", "parent_id": "t3_xecwxr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Definitely go for some kids content if you still find it interesting. Ponyo and Totoro are good starting films imo. \n\nNetflix's selection of terrible christmas/romance movies are among the easiest I've found for content that's actually made for adults. In general, dramas tend to be slower spoken than comedies, and films slower than tv. (Not always!) If you decide to watch a procedural or a fantasy show, it's worth specifically learning a short vocab list of relevant words (murder, body, magic, dragon etc).\n\nDubbed language is often more clearly spoken but, as you've noticed, the downside is the subtitles won't match, so I generally turn them off.\n\nOne thing I find really useful is a simplified news channel, preferably with a transcript. \n\nThere might be French youtubers who specialise in \"comprehensible input\", which is worth watching if you find it. Oh, one French language learning show is Extra (I watched the German version). It's very cheesy, but ... give it a go? It's on youtube.\n\nHope some of this helps!", "created_utc": "1663321871.0", "edited": "False", "id": "ion8y1p", "is_submitter": "False", "link_id": "t3_xfkk8n", "parent_id": "t3_xfkk8n", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "oak_oz", "body": "Duolingo: Don't worry about maxing out lessons, keep moving on to new stuff whenever you personally want to. Go back to old lessons and move them up a level if you feel like you're not remembering things. The stories are the best bit, so make sure you check them out. Also click the thing that says something like \"Tips\", for little grammar lessons to help you understand what's happening. \n\nOther thoughts: One of the great things about learning German is that there are tons of resources. I have been really enjoying Natürlich German on youtube. (Disclaimer: I started at the intermediate level because I had some prior knowledge, so i don't really know what the beginner videos are like.) If you're feeling really enthusiastic and excited, use that excitement to try out tons of resources and find some that you really enjoy. If you're feeling more on the hesitant side, focussing on just building a routine is probably key, so worry about finding new resources later. I'm also a big advocate for just having your TL in the background, even if you don't understand it yet, so find a few German artists you like and add them to your Spotify for example.", "created_utc": "1663079560.0", "edited": "False", "id": "io9ge80", "is_submitter": "False", "link_id": "t3_xcnt76", "parent_id": "t3_xcnt76", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}]