[{"author": "Ok-Hat-8759", "body": "This has to be one of the most divisive and differing of opinion threads I’ve read here in AITA. \n\nNTA", "created_utc": "1666884606.0", "edited": "False", "id": "iu00dfz", "is_submitter": "False", "link_id": "t3_yes5gy", "parent_id": "t3_yes5gy", "score": "5", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Ok-Hat-8759", "body": "That last part hit me. 🥹", "created_utc": "1666321827.0", "edited": "False", "id": "it5qswf", "is_submitter": "False", "link_id": "t3_y9dn7j", "parent_id": "t1_it52w1j", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Ok-Hat-8759", "body": "This was a massive adjustment for me when I started backpacking after coming from the USA, where pretty much everything is open late or 24 hours", "created_utc": "1665664512.0", "edited": "False", "id": "is5b8sw", "is_submitter": "False", "link_id": "t3_y2sfiu", "parent_id": "t3_y2sfiu", "score": "1", "subreddit": "AusFinance", "subreddit_id": "t5_2uo3q"}, {"author": "Ok-Hat-8759", "body": "My HELOC is fixed and I can borrow whatever I want (up to my limit) whenever I want. Credit Unions are the shit man.", "created_utc": "1665556319.0", "edited": "False", "id": "irzpkcg", "is_submitter": "False", "link_id": "t3_y1rtum", "parent_id": "t1_irzjxn0", "score": "6", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "Ok-Hat-8759", "body": "My HELOC Is fixed at 3%.", "created_utc": "1665556267.0", "edited": "False", "id": "irzpi17", "is_submitter": "False", "link_id": "t3_y1rtum", "parent_id": "t1_irzfvo6", "score": "3", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "Ok-Hat-8759", "body": "I’m in Australia, unfortunately 😅😬", "created_utc": "1665041030.0", "edited": "False", "id": "ir963dy", "is_submitter": "True", "link_id": "t3_xwsous", "parent_id": "t1_ir91cpu", "score": "2", "subreddit": "rooftoptents", "subreddit_id": "t5_3ggjm"}, {"author": "Ok-Hat-8759", "body": "The 2,5 year one is a 4 person iKamper for just under 2k. Not bad honestly 👀", "created_utc": "1665040950.0", "edited": "False", "id": "ir96020", "is_submitter": "True", "link_id": "t3_xwsous", "parent_id": "t1_ir89owo", "score": "3", "subreddit": "rooftoptents", "subreddit_id": "t5_3ggjm"}, {"author": "Ok-Hat-8759", "body": "This is such great information. I was unaware of your prior post here until these more recent comments, so I’ve now referenced that as well. \n\nI’ve been contemplating TEFL certs for several months now but this… this may be a game changer for me. I’m an American that has been “stuck” in Australia through Covid and so long as these Covid visas keep me here (or at least until I find a reliable sponsorship opportunity), a CELTA seems like a solid investment. \n\nOnce I’ve decided on my own personal direction for the next several months, I think I’ll be pursuing this (just a matter of whether I stay in WA or relocate back to QLD). \n\nThanks again mate. 👍🏻", "created_utc": "1664374114.0", "edited": "False", "id": "iq8jlgs", "is_submitter": "False", "link_id": "t3_xq6a9o", "parent_id": "t1_iq7m74o", "score": "2", "subreddit": "TEFL", "subreddit_id": "t5_2qq76"}, {"author": "Ok-Hat-8759", "body": "I was taking granola bars from home and selling them to classmates at school when I was like 8. It’s not out of the realm of possibility for kids to develop a hustle or ideology to make some money.", "created_utc": "1662650095.0", "edited": "False", "id": "inljlx2", "is_submitter": "False", "link_id": "t3_x915kp", "parent_id": "t3_x915kp", "score": "2", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "Ok-Hat-8759", "body": "Echoing a lot of comments here. \n\nPay off remaining debts in USA (student loans/mortgages/ etc). Pay off my mother’s house. Pay off most of my sister’s student loans. Maybe 500k spent there at max. \n\nInvest 2-3 mil in investment properties, cash. As an American citizen, I seriously think investing in real estate where I’m from may be more beneficial than investing in Australia. \n\nAs someone on a sponsorship track to stay in Aus long term, I’d have to give some serious thought as to whether or not I’d want to continue that commitment or find another Avenue to stay that would be a bit more aligned with my interests. \n\nI’d love to travel more anyway. Get that passive income going and off I go for a while.", "created_utc": "1661921412.0", "edited": "False", "id": "imhg4p2", "is_submitter": "False", "link_id": "t3_x1zshs", "parent_id": "t3_x1zshs", "score": "1", "subreddit": "AusFinance", "subreddit_id": "t5_2uo3q"}, {"author": "Ok-Hat-8759", "body": "These are all valid and well articulated points. It was not my intention to come off as though I expected her to teach me (hence my quotation marks above) but alas I may not have articulated that well myself. \n\nIt’s not so much for me of any expectation of teaching me or submersing me, I think my hang up is the overall lack of little pushes or the lack of encouragement for making the attempt at something my partner knows or is familiar with. \n\nWe are at a very rudimentary level of communication in her native languages. She loves it when I do say things to her in Russian and she adores my accent, so I find the lack of encouragement to keep going somewhat odd. \n\nBut perhaps this is a trait that boils down to personality more than anything else, but I digress.", "created_utc": "1661696403.0", "edited": "False", "id": "im4pbsa", "is_submitter": "True", "link_id": "t3_wztv6z", "parent_id": "t1_im4b5oy", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "I’ve got a mate in the UK who just bought a beginners book for Bulgarian. I’ll reach out to him on this.", "created_utc": "1661525960.0", "edited": "False", "id": "ilvlrey", "is_submitter": "False", "link_id": "t3_wy0ly6", "parent_id": "t3_wy0ly6", "score": "2", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Ok-Hat-8759", "body": "I have about 15k in savings, but I’m now in Australia. Honestly, backpacking through Covid has completely changed my outlook on life (and finances) and I have more in savings now than I ever did in the states, despite now earning about 35% less.", "created_utc": "1661426305.0", "edited": "False", "id": "ilpw6ji", "is_submitter": "False", "link_id": "t3_wwj4sm", "parent_id": "t3_wwj4sm", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "Ok-Hat-8759", "body": "I purchased a home in a small midwestern college town in 2017 near the peak at that time.  It was cheaper to buy a house than rent a similar or even smaller apartment. Qualifying for that mortgage was several times more difficult but at that time my initial mortgage payment was around 870$ /month and renting a similar house was around 12-1400$ a month. 2 bedroom apartments were 800-1100$.", "created_utc": "1659496192.0", "edited": "False", "id": "iiqh0kp", "is_submitter": "False", "link_id": "t3_weprwp", "parent_id": "t3_weprwp", "score": "1", "subreddit": "RealEstate", "subreddit_id": "t5_2qipl"}, {"author": "Ok-Hat-8759", "body": "I’ve always been fascinated by Russian but lacked the motivation to make a proper attempt to learn it. \n\nHaving a significant other now that speaks Russian drastically increases my motivation 😅", "created_utc": "1657116281.0", "edited": "False", "id": "if2qdly", "is_submitter": "False", "link_id": "t3_vs4tlh", "parent_id": "t3_vs4tlh", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "Is it too easy to say that my biggest hurdle with learning a new language is motivation? \n\nI have enough of a foundation with German that I can jump back into it pretty quickly when I’m around native speakers. That said, I still feel like I’m not advanced enough to structure a sentence properly to respond. Text it or write it, no problem. Speaking, not so much. \n\nBut with some of the other various languages I’ve tried to learn, the motivation doesn’t sustain. In full disclosure, I tend to try and learn the language of whichever partner I’m dating at a point in time so if we part ways or our level of communication drops, what motivation do I have to continue learning?   🤷🏻‍♂️😅\n\nAt least my current partner does actually speak some Russian with me.", "created_utc": "1656511743.0", "edited": "False", "id": "ie6r3eb", "is_submitter": "False", "link_id": "t3_vn9vsb", "parent_id": "t3_vn9vsb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "With you on this. My ex was Slovenian so I’m interested in the region. Czech is probably the closest and I don’t mind that but it’s not what I’m after.", "created_utc": "1656319562.0", "edited": "False", "id": "idwpda2", "is_submitter": "False", "link_id": "t3_vlc7m5", "parent_id": "t1_idubjw7", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "Ok-Hat-8759", "body": "Well, I’ve already moved… to Australia. But, I’ve kept both of my properties in my midwestern college town and utilize them as rental properties. One property at 2.4% and the second refinanced at 2.8%. HELOC on the larger property is 3.3%. \n\nDon’t plan on moving them anytime soon, but should I start a family or consider purchasing property in Australia, I’ll reassess then (next 3-5 years).", "created_utc": "1656318891.0", "edited": "False", "id": "idwom84", "is_submitter": "False", "link_id": "t3_vldwua", "parent_id": "t3_vldwua", "score": "1", "subreddit": "RealEstate", "subreddit_id": "t5_2qipl"}, {"author": "Ok-Hat-8759", "body": "Seconding this. I’ve used Wise a number of times between AUD USD and EUR up to 5 figures. Trying to avoid sending large amounts overseas right now as AUD/USD is terrible at moment.", "created_utc": "1656255910.0", "edited": "False", "id": "idta2wa", "is_submitter": "False", "link_id": "t3_vkzxmo", "parent_id": "t1_idslbr3", "score": "3", "subreddit": "AusFinance", "subreddit_id": "t5_2uo3q"}, {"author": "Ok-Hat-8759", "body": "American here. Tried taking some language courses in my university days but nothing ever stuck. Started backpacking in my early 30s and spent the last couple years in Australia. Before Covid, I met SO MANY Germans that I decided to start learning it purely for small chat and basic greetings. I kept at it during my travels and dated a couple Germans in that time so it became pretty useful. \n\nMy ex was Slovenian and I’ve got a basic grasp of that. My current partner is Kazakh. I struggle a bit with Russian (I’m trying 😅) but I honestly find Kazakh more interesting. She rarely speaks the latter to me so she always trips up when I drop a random Kazakh greeting in conversation.", "created_utc": "1656251603.0", "edited": "False", "id": "idt13p7", "is_submitter": "False", "link_id": "t3_vl1avk", "parent_id": "t3_vl1avk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "Thanks for sharing this. I’ve saved this to read through the comments thoroughly when I have a bit more time. \n\nI’m an American backpacker in my mid 30s riding the wave of free (Covid) pandemic visas while searching for a sponsorship opportunity. I’ve got until spring or summer 2023 to get something figured out and if I do not have any long term options to remain in Australia by that point in time, changing gears for my MBA is something that is already on my radar. I’ve had a pretty diverse set of careers already, ranging from meteorology to environmental consulting to finance & real estate, with the latter appealing to me the most these days. Might even just get my accounting credentials or something. I feel like there’s probably a fair amount of options available to me that I just haven’t researched yet.", "created_utc": "1655832887.0", "edited": "False", "id": "id7enc6", "is_submitter": "False", "link_id": "t3_vh7j7l", "parent_id": "t3_vh7j7l", "score": "2", "subreddit": "AusFinance", "subreddit_id": "t5_2uo3q"}, {"author": "Ok-Hat-8759", "body": "Not super super obscure, but my ex was Slovenian so I invested a fair amount of time learning a bit of that. \n\nMy current girlfriend is Kazakh. Her first language is Russian so I’ve been working on that but she’s also fluent in Kazakh and teaches me some things there now and then. I’ve very recently (like this week recently) started looking into Kazakh language resources.", "created_utc": "1655739450.0", "edited": "False", "id": "id2ip0l", "is_submitter": "False", "link_id": "t3_vgexiv", "parent_id": "t3_vgexiv", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "My ex was Slovenian and I forked out about €100 for Slovenian as a second language textbooks from the university there in Ljubljana. Fun investment.", "created_utc": "1655739279.0", "edited": "False", "id": "id2iat8", "is_submitter": "False", "link_id": "t3_vgexiv", "parent_id": "t1_id1voi6", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "I’m an American that “got stuck” backpacking in Australia during Covid. Ive virtually tuned everything out back home. I have no intention of leaving Australia anytime soon and actively working towards getting sponsorship to stay here, but even here it’s not easy. Lots of stress", "created_utc": "1653624546.0", "edited": "False", "id": "ia5kvug", "is_submitter": "False", "link_id": "t3_uy7ms1", "parent_id": "t3_uy7ms1", "score": "1", "subreddit": "antiwork", "subreddit_id": "t5_2y77d"}, {"author": "Ok-Hat-8759", "body": "Spanish. Since I started traveling I’ve learned more German and basic greetings in several languages. I had Spanish all around me in my uni days and tbh it’s just boring to me. I like learning things that are outside the norm. Personally", "created_utc": "1644537087.0", "edited": "False", "id": "hwfq6ed", "is_submitter": "False", "link_id": "t3_sowpu5", "parent_id": "t3_sowpu5", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "Sophisticated? LOL up here in the Midwest we view southern accents as idiotic, redneck and lacking intelligence. \n\nUnless you get into the tidewater of Virginia or spots in Louisiana where you have that old plantation owner / southern belle kind of southern drawl, that’s my personal exception.", "created_utc": "1641203556.0", "edited": "False", "id": "hr20rj2", "is_submitter": "False", "link_id": "t3_rujho9", "parent_id": "t1_hr0p02b", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "I finally cracked 1k kills (1012 I think), mid 80s wins, 350k ish damage \n\nRecalling from memory, got a two week stretch here working on the road.", "created_utc": "1640790626.0", "edited": "False", "id": "hqf0n96", "is_submitter": "False", "link_id": "t3_rr09zq", "parent_id": "t3_rr09zq", "score": "1", "subreddit": "WattsonMains", "subreddit_id": "t5_wn4z8"}, {"author": "Ok-Hat-8759", "body": "I’m basically working on two languages right now. My German has become a bit overwhelming; I can understand and write/type a fair amount but my speaking is abysmal. I’ve basically gotten to a point that if I’m not around my German friends regularly and trying to engage and have a dialogue with them, I’m losing ground. I’m basically just plodding through my Duolingo lessons at the moment just to keep my daily streak. \n\nThe other language I’m working on, randomly enough, is Slovenian (recently dated a Slovenian girl). I’m now super intrigued in the language, (beyond my love interests🤪) but the problem I’m running into with this one is there is absolutely a limit on the materials available to learn it. I’m still intrigued, spending a fair amount of time on getting some basics down, but hopefully I’ll still have that interest by the time some text and work books arrive to me in the coming weeks, directly from Slovenia. \n\nMy advice is hey do some kind of lesson or repetition each day to keep something flowing in your mind, but you don’t have to go gung-ho and rock out 500 XP a day on Duolingo. Progress is progress. One step at a time. Maybe something comes along to give you motivation. You never know.", "created_utc": "1640699914.0", "edited": "False", "id": "hq9zue7", "is_submitter": "False", "link_id": "t3_rq64p4", "parent_id": "t3_rq64p4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "When I started backpacking I was meeting a ton of Germans and wanted to learn a few basic phrases and such. I ended up dating a couple Germans along the way so that just exacerbated it. Now I’m kind of at a stage where I really need to engage with native speakers regularly to have some dialogue and That’s just not an option right now. \n\nThe most recent girl I dated was Slovenian… so guess what language I’m more intrigued with at the moment 🤪", "created_utc": "1640416705.0", "edited": "False", "id": "hpw9e6u", "is_submitter": "False", "link_id": "t3_rnohhm", "parent_id": "t3_rnohhm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "https://www.reddit.com/r/Slovenia/comments/muul9s/best_resources_to_learn_slovene/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nCheck out charming-date’s post for the Center of Slovene as a second language on this thread. I found this a few days ago and literally just ordered some textbooks and workbooks from them. \n\nFellow American here that recently started dating a Slovenian so… yeah. 😉😅 /fistbump", "created_utc": "1640084635.0", "edited": "False", "id": "hpeu5a4", "is_submitter": "False", "link_id": "t3_rkrs8y", "parent_id": "t3_rkrs8y", "score": "1", "subreddit": "Slovenia", "subreddit_id": "t5_2s18h"}, {"author": "Ok-Hat-8759", "body": "Untitled Art has a ton of good options. I also really like Urban Artifact.", "created_utc": "1640011982.0", "edited": "False", "id": "hpat9ux", "is_submitter": "False", "link_id": "t3_rjzrsv", "parent_id": "t3_rjzrsv", "score": "1", "subreddit": "CraftBeer", "subreddit_id": "t5_2rmyr"}, {"author": "Ok-Hat-8759", "body": "This is freakin hilarious. Was not expecting that.", "created_utc": "1639839181.0", "edited": "False", "id": "hp1wook", "is_submitter": "False", "link_id": "t3_rix8u6", "parent_id": "t3_rix8u6", "score": "1", "subreddit": "apexlegends", "subreddit_id": "t5_rgzzt"}, {"author": "Ok-Hat-8759", "body": "Love to see me some Toppling Goliath. \n\nIowa represent.", "created_utc": "1639494111.0", "edited": "False", "id": "hoimth8", "is_submitter": "False", "link_id": "t3_rfv0kw", "parent_id": "t3_rfv0kw", "score": "1", "subreddit": "CraftBeer", "subreddit_id": "t5_2rmyr"}, {"author": "Ok-Hat-8759", "body": "I got in at the end of season 1. I had really good seasons in 2 and 3 but I’ve been hit or miss since then. Hell, I’ve been backpacking and traveling most of these last two years (avoiding Covid for the most part) so my priorities haven’t been playing this game. So, when I do I’m just trying to chill after a day of work or something. And I’ve been playing with Wattson since season 2. Still don’t have 1,000 kills. Don’t care that much. I just enjoy playing with her. \n\nI’m so glad the arenas mode was added. It’s not as “hardcore” as trios or duos and gives me an avenue to improve my own game play. Ive spent a lot of my recent time there. Maybe give that a shot. \n\nKeep your chin up my dude. Despite the bullshit in the gaming world, there’s still some of us out there that have the backs of other players.", "created_utc": "1639464672.0", "edited": "False", "id": "hohet17", "is_submitter": "False", "link_id": "t3_rfg58j", "parent_id": "t3_rfg58j", "score": "1", "subreddit": "WattsonMains", "subreddit_id": "t5_wn4z8"}, {"author": "Ok-Hat-8759", "body": "Bro you have 3x as many kills and damage as me and I’ve been playing Wattson since season 3 (minus a couple seasons while I’ve been traveling). I just like playing and I don’t worry about the stats too much. But good stuff my dude.", "created_utc": "1639135482.0", "edited": "False", "id": "hnz49m9", "is_submitter": "False", "link_id": "t3_rcsaaj", "parent_id": "t3_rcsaaj", "score": "1", "subreddit": "WattsonMains", "subreddit_id": "t5_wn4z8"}, {"author": "Ok-Hat-8759", "body": "I often watch Netflix series in German with English subtitles. Aside from the dubbing sometimes being terrible, I find it a pretty valuable resource, *especially* when I’m watching on my phone and I can slow the viewing speed down to 0.75x. If I hear words I’m not familiar with, I’ll occasionally tap back and switch to German subtitles briefly to see what was said.", "created_utc": "1639134443.0", "edited": "False", "id": "hnz2xfi", "is_submitter": "False", "link_id": "t3_rcyw5b", "parent_id": "t3_rcyw5b", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ok-Hat-8759", "body": "What on earth. The bird is a Galah, a species of cockatoo found throughout Australia. Is there some sort of Australian connection with Wattson I’ve missed? Or maybe some kind of interaction with Fuse?", "created_utc": "1638975502.0", "edited": "False", "id": "hnq1zyo", "is_submitter": "False", "link_id": "t3_rbdyfj", "parent_id": "t3_rbdyfj", "score": "3", "subreddit": "WattsonMains", "subreddit_id": "t5_wn4z8"}, {"author": "Ok-Hat-8759", "body": "I honestly just mute my entire squad most of the time. I am traveling a lot and also working a lot so I don’t want to suck up my free time by listening to a bunch of a bullshit when I want to play. I’m playing as a release at the end of the day and to relax. And I only really talk back when I hear people actually being insightful and perhaps even having an actual conversation, not just stupid shit about the game or their skills or blah blah.", "created_utc": "1638453024.0", "edited": "False", "id": "hmxir82", "is_submitter": "False", "link_id": "t3_r6nz8v", "parent_id": "t3_r6nz8v", "score": "1", "subreddit": "apexlegends", "subreddit_id": "t5_rgzzt"}, {"author": "Ok-Hat-8759", "body": "I’ve been learning German for about a year and a half now and when I get a bit burned out, I often do a couple lessons and then switch to (predominantly) something else for a few days or even a couple weeks, such as Russian. I recently dated a Slovenian so I’d been giving that most of my attention in recent weeks. I find it nice to have a couple options to bounce between as it keeps the motivation high to at least learn something", "created_utc": "1638450717.0", "edited": "False", "id": "hmxebwz", "is_submitter": "False", "link_id": "t3_r6vi27", "parent_id": "t3_r6vi27", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "Ok-Hat-8759", "body": "Runaway by Linkin Park is my current ear worm.", "created_utc": "1638023942.0", "edited": "False", "id": "hma05uf", "is_submitter": "False", "link_id": "t3_r39j05", "parent_id": "t3_r39j05", "score": "3", "subreddit": "moreplatesmoredates", "subreddit_id": "t5_2mohet"}, {"author": "Ok-Hat-8759", "body": "Well done. I’m still trying to crack 1,000 🤣", "created_utc": "1637648340.0", "edited": "False", "id": "hlqmcyv", "is_submitter": "False", "link_id": "t3_qzeppi", "parent_id": "t3_qzeppi", "score": "1", "subreddit": "WattsonMains", "subreddit_id": "t5_wn4z8"}, {"author": "Ok-Hat-8759", "body": "I just I inquired about the special tracker backgrounds the other day and never knew this event ever took place or that this skin existed. I’ve never seen anyone use it since I came back to apex in the past couple months. I would rock it all the time", "created_utc": "1637239522.0", "edited": "False", "id": "hl44fl8", "is_submitter": "False", "link_id": "t3_qvyyef", "parent_id": "t3_qvyyef", "score": "1", "subreddit": "WattsonMains", "subreddit_id": "t5_wn4z8"}, {"author": "Ok-Hat-8759", "body": "Thanks y’all! This helped keep me relaxed until she woke up.", "created_utc": "1616279902.0", "edited": "False", "id": "grn1ked", "is_submitter": "False", "link_id": "t3_m9ex1g", "parent_id": "t3_m9ex1g", "score": "1", "subreddit": "Drugs", "subreddit_id": "t5_2qh7l"}]