[{"author": "okayamerican", "body": "This was exactly my issue. Admin wanted to see a discrete \"objective\" written on the board, taught and mastered in a single class period. No wonder so many kids hate reading!", "created_utc": "1666522849.0", "edited": "False", "id": "itfzh3c", "is_submitter": "False", "link_id": "t3_y95ob3", "parent_id": "t1_it70njf", "score": "2", "subreddit": "ELATeachers", "subreddit_id": "t5_2vvc8"}, {"author": "okayamerican", "body": "Yes, came here to day this. My old district told us they wouldn't buy us novels anymore because state testing only has short stories. I wanted to scream.\n\nI teach in a French school now. There is one test at the end of middle school (US 9th grade) and another at the end of high school. My 9th graders have to give a 10 minute oral presentation tracing a theme through multiple texts of their choice (novels, poems, movies, visual art) followed by a 10 minute question and answer period with an examiner. In high school, they do a deep analysis of several of the texts they've studied over the past two years, mostly novels, in both an oral and written exam. I didn't do anything like that until grad school. Imagine if the American education system valued this sort of exam instead of multiple choice!!! More chance for students to follow their interests, think outside the box, and go deeper.", "created_utc": "1666307151.0", "edited": "False", "id": "it4u84f", "is_submitter": "False", "link_id": "t3_y95ob3", "parent_id": "t1_it4plau", "score": "10", "subreddit": "ELATeachers", "subreddit_id": "t5_2vvc8"}, {"author": "okayamerican", "body": "Thank you so much for taking the time to reply. This app sounds like exactly what I've been waiting for all these years!!\n\nAlso, just want to say that I've always loved your humility and positive attitude when it comes to language learning. There can be a lot of negativity in these online spaces, and you've always been a bright spot. I'm sorry to hear about your illness, too-- I hope you can find healing and relief quickly, Best of luck with that AND with this app!", "created_utc": "1661208047.0", "edited": "False", "id": "ilds7e7", "is_submitter": "False", "link_id": "t3_wv304j", "parent_id": "t1_ildr0nh", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Since it's possible to import decks from Anki, does that mean you could use this app with ANY language as long as you have a deck already made for it? I get that it wouldn't have certain features, but I think a lot of Anki users rely on sentence mining more than pre-made decks, especially at more advanced levels. Could I import my Japanese deck, for example, even though it isn't one of the first available languages?\n\nBecause the one thing I need more than anything else from an app right now is a more interesting way to do my Anki reviews. I really like the idea of mini games created using the decks. Quizlet does that, but their \"games\" are so bad that it isn't really an improvement on using Anki. So having a versatile app that can be used for any language even at the advanced level (again, like Anki, but better) would be a huge game changer for my studies.", "created_utc": "1661205451.0", "edited": "False", "id": "ildmbow", "is_submitter": "False", "link_id": "t3_wv304j", "parent_id": "t3_wv304j", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Actually, looking at your subreddits, it's actually possible lol", "created_utc": "1658332034.0", "edited": "False", "id": "igxhuko", "is_submitter": "False", "link_id": "t3_w333b0", "parent_id": "t1_igx4rbx", "score": "2", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "okayamerican", "body": "🤔 Yes.", "created_utc": "1658331990.0", "edited": "False", "id": "igxhqds", "is_submitter": "False", "link_id": "t3_w333b0", "parent_id": "t1_igx4rbx", "score": "3", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "okayamerican", "body": "That's one of the reasons I prefer living abroad. When I feel like I don't belong here, it makes sense. When I'm in the States and feel that way, it just depresses me.", "created_utc": "1658265956.0", "edited": "False", "id": "igu04rr", "is_submitter": "False", "link_id": "t3_w333b0", "parent_id": "t1_igtxs65", "score": "43", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "okayamerican", "body": "The absolute best quote from Dracula is this one:\n\n\"We met some time ago a man that would just do for you, if you were not already engaged to Jonathan. He is an excellent parti, being handsome, well off, and of good birth. He is a doctor and really clever. Just fancy! He is only nine-and-twenty, and he has an immense lunatic asylum all under his own care.\"", "created_utc": "1656487153.0", "edited": "False", "id": "ie5q4bk", "is_submitter": "False", "link_id": "t3_vmkq96", "parent_id": "t3_vmkq96", "score": "3", "subreddit": "DarkAcademia", "subreddit_id": "t5_th6q5"}, {"author": "okayamerican", "body": "I don't live very far from there. It's fine-- as safe as anywhere else in Tokyo, convenient enough but not like living in central Tokyo or anything. I like it, but I'm married with a kid. Single people might find it boring.", "created_utc": "1655325305.0", "edited": "False", "id": "ici052m", "is_submitter": "False", "link_id": "t3_vcvsl1", "parent_id": "t3_vcvsl1", "score": "3", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "Yes, I pair it with that Adichie video too. And I try to place the novel in context since it's a reply to typical portrayals of Africa by Westerners. Achebe wrote an essay about Joseph Conrad that can help students see why alternative perspectives are so valuable.", "created_utc": "1652584693.0", "edited": "False", "id": "i8nkphz", "is_submitter": "False", "link_id": "t3_upvbpu", "parent_id": "t1_i8nk56d", "score": "7", "subreddit": "ELATeachers", "subreddit_id": "t5_2vvc8"}, {"author": "okayamerican", "body": "You have to be physically present in France under a proper student or work visa for the 5 year residency requirement count. After five years of living in France, you can apply for citizenship or permanent residency. There are some graduate programs in English, though probably not in the field of education.", "created_utc": "1652564697.0", "edited": "False", "id": "i8mguin", "is_submitter": "False", "link_id": "t3_up1f1d", "parent_id": "t1_i8lix9t", "score": "2", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "Sorry, I don't know why my text is huge - not trying to shout or be annoying!", "created_utc": "1652564490.0", "edited": "False", "id": "i8mgef3", "is_submitter": "False", "link_id": "t3_up5a0x", "parent_id": "t1_i8mgade", "score": "1", "subreddit": "LateStageCapitalism", "subreddit_id": "t5_39qgx"}, {"author": "okayamerican", "body": "#1 is necessary, but doesn't always apply. My daughter's birth parents were not uninformed about contraception or how pregnancy happens, yet pregnancy still happened. More education is great and sorely needed, but it won't solve everything. Some people have a moral stance against abortion or choose not to abort for other reasons. One of those reasons could be the difficulty of access, which is also a problem that should be remedied but is only getting worse unfortunately. Even under ideal conditions of education and abortion access, though, some adoptions would still be necessary.\n\n#2 In this particular case, when I said they weren't \"ready\" I mean that they did not want to have a child at their age and at that point in their relationship. I'm not sure either of them ever want to have kids, but I haven't discussed that with them. Having kids is a tremendous amount of work even if you have the financial resources, so I don't think it's surprising that people decide to make an adoption plan if they don't abort. Of course we live in a society where too many people end up feeling forced to choose adoption for financial reasons, and that's awful. As I said, the adoption agency offers assistance with finding resources for mothers who do decide they want to parent. Birth parents have a social worker assigned to them whose job is to explore the options and help them make the best decision for themselves under the best conditions possible. That's part of what the fees adopting parents pay are used for, not to make someone rich. (The fees are also on a sliding scale, by the way-- they're not about maximizing profit but about facilitating a process that requires the help of many professionals).\n\nThere are also laws in place (they vary by state) that give the birth parents at least a day or two after the birth to change their mind about the adoption placement. Our agency continues to support the birth mothers with counseling for free even if they decide to parent. The goal isn't to snatch up their baby; it's to support the birth mother through whatever decision she makes, including facilitating adoption if that is her choice.\n\n#3 Again, only speaking from personal experience, but my daughter's birth parents both had very strained relationships with their families (and I've heard of similar cases with people I've met). If they had wanted to place their child with a family member, they could have definitely done that. Instead, they chose my husband and I. Again, they CHOSE us. We are still in contact with them and have video chats or meetups a couple of times a year. This is supposed to be the norm with most adoptions these days except in cases where the birth parents are a risk for the child. And even in those cases, it's encouraged that the child still be able to meet with any extended family if possible to maintain those cultural connections you mention. I know someone who adopted through foster care and she takes her daughter every month to spend time with half-siblings, an aunt, and grandparents. Family is typically given priority in these kinds of situations, but if they don't want to adopt the child, then the search has to move elsewhere.\n\nI know that there are some very bad adoption agencies, especially in the United States, that run with more of a profit motive, and they should absolutely be shut down and the process better regulated. But those places (many of them religion based and focused on \"saving\" children by giving them good Christian homes), are not how the process is supposed to happen, and I don't think it's helpful to paint adoption in that way as a norm or claim that the trauma to the child is something no one is aware of; it's a reality that is supposed to be dealt with at every step of the way. I really feel like the agency we used was as close to ideal as possible, while also recognizing that adoption is never ideal.", "created_utc": "1652564438.0", "edited": "False", "id": "i8mgade", "is_submitter": "False", "link_id": "t3_up5a0x", "parent_id": "t1_i8kui9z", "score": "1", "subreddit": "LateStageCapitalism", "subreddit_id": "t5_39qgx"}, {"author": "okayamerican", "body": "Adoption is traumatic, and any good adoption program will train parents to understand that reality. In my daughter's case, we have an \"open\" adoption, meaning she remains in contact with her birth parents (we can them her \"first family\" since they are more to us than just a person who gave birth and her partner), and we speak openly about her story. In her case, the parents did not feel ready for the responsibility of taking care of a child. It was a difficult decision but one that they thought about carefully, and I don't think they regret it. Yes, it was expensive, but the agency we went through is not profit based, and they offer counseling and support services for all parties involved, including support with resources for mothers who end up deciding to parent. There is absolutely no \"guarantee\" of a child, and adoptive families are chosen by the birth families after meeting at least once. The number of adoptive families on the register is limited depending on how many parents on average seek adoption placement services. So this isn't an issue of finding a supply of children to meet a demand and generate more money. The agency doesn't profit, and the fees they take are used to pay social workers and counselors.\n\nThere are certainly less scrupulous agencies out there, especially when you look at international adoptions where society-wide poverty is an issue. However, international adoption has become illegal virtually everywhere for these reasons. There are some people who have regretted their decisions or felt burned by adoption, including some adopted children whose parents hid their adoption from them or did not give the child space or support to deal with that trauma. But I believe that when done right, adoption can have a generally good outcome for all involved (without negating the fact that yes, trauma is present; our agency really emphasized that to us; they weren't just trying to paint a rosy picture to make some cash).\n\nAnd the alternative to adoption is what? Orphanages? Forcing people who don't want children to parent? Painting adoption with this broad brush of children being a \"commodity\" is harmful. It would be great if adoption and the social workers who facilitate it were supported with government funding and costs to adoptive parents weren't so high, but I don't expect that to change anytime soon.", "created_utc": "1652506033.0", "edited": "False", "id": "i8jnc0m", "is_submitter": "False", "link_id": "t3_up5a0x", "parent_id": "t3_up5a0x", "score": "3", "subreddit": "LateStageCapitalism", "subreddit_id": "t5_39qgx"}, {"author": "okayamerican", "body": "You could do a graduate degree maybe?", "created_utc": "1652495239.0", "edited": "False", "id": "i8j4y8y", "is_submitter": "False", "link_id": "t3_up1f1d", "parent_id": "t1_i8igdnr", "score": "1", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "Quick follow-up: there is an English language teaching assistant program that Americans can apply for. I know someone who did it. The pay isn't more than a stipend, but it would allow you to live in France for a year or two, which could potentially count toward the 5 year requirement to apply for citizenship.", "created_utc": "1652482747.0", "edited": "False", "id": "i8ifow2", "is_submitter": "False", "link_id": "t3_up1f1d", "parent_id": "t1_i8ifh9b", "score": "2", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "I work at a French school outside of France, so I have a bit of familiarity with the French educational system, and overall I'd say it isn't going to be easy unless you are an EU citizen or you can manage to snag one of the (extremely competitive) international school jobs in France. French public school teachers are considered civil servants, so the system is pretty much closed to international hires. Because of EU work agreements, non-French EU citizens can still apply, but if you're an American, it won't really be possible.\n\nIf it's something you truly want to do (and you can afford it), I would recommend going to France to study, finding a way to stay for at least five years (since you have family there, that could help), applying for citizenship, and then starting the teaching credential process from there. I don't know if foreign credentials will be transferable, but at a minimum there will be exams you have to pass (I think they're called CAPES or something). The certification isn't possible for American citizens.", "created_utc": "1652482645.0", "edited": "False", "id": "i8ifh9b", "is_submitter": "False", "link_id": "t3_up1f1d", "parent_id": "t3_up1f1d", "score": "5", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "It means the Olympics. You say it when someone is a sporty spice type.\n You're welcome.", "created_utc": "1651385357.0", "edited": "False", "id": "i6vl7o8", "is_submitter": "False", "link_id": "t3_uf7frr", "parent_id": "t3_uf7frr", "score": "0", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "Harold Bloom talked mad shit about Sylvia Plath; he wrote a scathing introduction to his \"Bloom's Guide\" to her work, while at the same time acknowledging that other critics don't share his opinion. Even a lot of Plath fans hate her poem \"Daddy\" (one of her most well-known) and find the Holocaust imagery totally inappropriate.", "created_utc": "1650365078.0", "edited": "False", "id": "i5br5do", "is_submitter": "False", "link_id": "t3_u6j7eb", "parent_id": "t3_u6j7eb", "score": "1", "subreddit": "AskLiteraryStudies", "subreddit_id": "t5_2tltc"}, {"author": "okayamerican", "body": "I agree. I took classes at the Alliance off and on for a while. They weren't bad, but I think I got a lot more out of italki classes and self study, especially considering the price.", "created_utc": "1645914704.0", "edited": "False", "id": "hykj6xp", "is_submitter": "False", "link_id": "t3_t21l2m", "parent_id": "t1_hykim3s", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "I was feeling the same way. I set limits on Anki to just 25 reviews a day, max 5 new words. It completely changed how I feel about SRS. I can do my reviews in 10 or 15 minutes now and move on. No more anxiety about missing a day and having hundreds of reviews waiting for me. And I honestly feel like I'm getting more out of Anki than before because I'm much more consistent and have a much easier time recalling the words because they're limited in number. If you want to ditch it entirely, do it! But if you feel like it does have a benefit for your studies (I definitely do), setting down some boundaries can be a really great compromise.", "created_utc": "1643961819.0", "edited": "False", "id": "hvjc7v4", "is_submitter": "False", "link_id": "t3_sjfed8", "parent_id": "t3_sjfed8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Not sure if someone else already mentioned this cause it's a long thread, but there is a Facebook group called \"Parents with kids in Japanese schools\" that is very active and has been an invaluable resource for me. My daughter is 3 and goes to Japanese kindergarten.", "created_utc": "1639084370.0", "edited": "False", "id": "hnwgn8d", "is_submitter": "False", "link_id": "t3_rciznu", "parent_id": "t3_rciznu", "score": "4", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "I really liked 'Why Poetry'  by Matthew Zapruder.", "created_utc": "1638950197.0", "edited": "False", "id": "hnp0sq2", "is_submitter": "False", "link_id": "t3_rbi8xe", "parent_id": "t3_rbi8xe", "score": "4", "subreddit": "AskLiteraryStudies", "subreddit_id": "t5_2tltc"}, {"author": "okayamerican", "body": "France (and French schools abroad) has a two week vacation every seven weeks, plus July and August off for summer vacation. It's hard to get burnt out knowing a vacation is always around the corner.", "created_utc": "1637922069.0", "edited": "False", "id": "hm53b0j", "is_submitter": "False", "link_id": "t3_r2gvm4", "parent_id": "t3_r2gvm4", "score": "1", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "I just came here to say the same thing.about my former district. So sick of school districts chasing all of these programs that promise an easy fix to all of their problems instead of just paying teachers well and giving them the planning time and resources they need to be effective.", "created_utc": "1636234051.0", "edited": "False", "id": "hjlk9et", "is_submitter": "False", "link_id": "t3_qnbouy", "parent_id": "t1_hjfgphw", "score": "2", "subreddit": "Teachers", "subreddit_id": "t5_2qqcs"}, {"author": "okayamerican", "body": "Not really. The US spends more on healthcare than most developed countries but with worse outcomes.", "created_utc": "1636095912.0", "edited": "False", "id": "hjdyy5y", "is_submitter": "False", "link_id": "t3_qmzqa0", "parent_id": "t1_hjdtscg", "score": "6", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "okayamerican", "body": "We tried renting out our home in the States when we moved, and it was a total disaster. Our management company was terrible (which is apparently super common), and our tenant never paid rent. We had to eventually evict them, and they stole our refrigerator and washing machine on the way out- haha. It ended up costing us a lot of money, and after a few months we decided we didn't want to go back anyway and sold the home. It was a ton of stress trying to manage a rental property from abroad, and I felt much better when we had that burden lifted. I always hated owning a home, though, so i was glad to be free of it.", "created_utc": "1634590902.0", "edited": "False", "id": "hh5ld0r", "is_submitter": "False", "link_id": "t3_qai8de", "parent_id": "t3_qai8de", "score": "1", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "Just do it. It's not THAT hard to move back if you decide you don't like it, but you might find it's the best decision you ever made.\n\nI have a family and owned a house before moving to Japan. We sold almost everything we owned, including the house, quit our jobs, and came over with our one year old daughter. I was a nervous wreck beforehand, literally throwing up, dealing with major anxiety, not sure if we would land on our feet financially, etc. But I also felt bored out of my mind in my home country, like I was living someone else's life, not my own. Life was \"easy,\" but it felt pointless. Taking the plunge was so, so worth it. I'm so much happier here and don't ever want to go back.", "created_utc": "1632310518.0", "edited": "False", "id": "hdtz38z", "is_submitter": "False", "link_id": "t3_pt3a10", "parent_id": "t3_pt3a10", "score": "2", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "okayamerican", "body": "Came here to say exactly this.", "created_utc": "1632000204.0", "edited": "False", "id": "hddq6vo", "is_submitter": "False", "link_id": "t3_pqg5rp", "parent_id": "t1_hdc52oi", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "okayamerican", "body": "These are various degrees of dark and/or academia, but here are some i rarely or never see mentioned that give me the vibez:\n\n-The Talented Mr. Ripley\n\n-Wit (amazing, based on a play)\n\n-The Chair (on Netflix)\n\n-Sylvia (the Sylvia Plath movie with Gwenyth Paltrow)\n\n-An Angel At My Table (one of my favorite movies of all time based on the autobiography of Janet Frame, a New Zealand writer)", "created_utc": "1630492482.0", "edited": "False", "id": "hb662oi", "is_submitter": "False", "link_id": "t3_pff8yv", "parent_id": "t3_pff8yv", "score": "3", "subreddit": "DarkAcademia", "subreddit_id": "t5_th6q5"}, {"author": "okayamerican", "body": "Oh, that's great that you have a tutor! I think that would have helped a lot of things stick for me. My problem once I got to Genki II was mostly remembering which constructions use short form, which use te-form, etc., plus the conjugations. I had to take a week to go back through all of the grammar lessons from the very beginning to make them click. I had a temper tantrum about that, but I'm doing much better now- haha.", "created_utc": "1628589585.0", "edited": "False", "id": "h8e5wtq", "is_submitter": "False", "link_id": "t3_m42riu", "parent_id": "t1_h8dq20g", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "Way to go! I literally just finished Chapter 17 (of 23) in Genki II right before I opened up my laptop and saw your comment. This was after a 3-month break when things got really busy at work. Progress has been slow for me, but I'm hoping to finish this book by the end of the year; it's been really helpful, but I've definitely had to slow my pace from Genki 1 and go back and review a lot of things I forgot. Worth it, though-- we can do it!", "created_utc": "1628575260.0", "edited": "False", "id": "h8dpclc", "is_submitter": "False", "link_id": "t3_m42riu", "parent_id": "t1_h8dmazr", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "Okay, yeah, going to a cafe for a few hours is my kind of \"having a life\" too- haha. Definitely no shortage of cafes and arcades here, and not too expensive as long as you don't develop a Pachinko addiction.", "created_utc": "1628113243.0", "edited": "False", "id": "h7q96tn", "is_submitter": "False", "link_id": "t3_ox3az9", "parent_id": "t1_h7oysyg", "score": "1", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "In my opinion, the cost of living isn't bad. There are some high up-front costs, such as paying all the fees to rent an apartment, but your school will usually give you a settling-in allowance that helps with that. But rent isn't as bad as you would think if you are flexible with your location. I don't live in central Tokyo because my school is in a northern part of the city, so I pay a lot less. But even at this location, I can get just about anywhere in 30 minutes or less. But I'm renting a two-bedroom detached house here for about US$1200/month. A two-bedroom anything in Dallas (where I lived before) for less than that was almost impossible to find (unless you were willing to live in a run-down and dangerous part of town). If you're single, you can easily find somewhere decent for $800/month. And although I'm supporting my husband and kid on one income, we've still managed to put a lot of money in savings, probably as much as we would have saved on two incomes living in Texas. That's due to not having to own a car, cheap healthcare, and how easy it is to find free or cheap things to do.\n\nIt depends a lot on your lifestyle, though. There are some things that are very expensive. Like, if you want to eat cantaloupe all the time, you're going to go bankrupt pretty quickly- haha. Eating out is also relatively expensive in general, so we do almost all of our cooking at home (generally preferable since we have a toddler, too, and restaurants  can be cramped). I feel like that's more of a matter of preference than a financial choice, though. We also don't go out to bars or clubs or anything, so if that's what you mean by having a life, then that could possibly get costly (no idea, to be honest). I have coworkers with similar family situations who struggle a lot more to save, but I haven't found it very difficult at all, and I don't feel like I'm making any sacrifices or denying myself anything I really want. This is on an international school teacher's salary, though, not an ESL teacher's. People who work as ALTs or in conversation schools make about half (or less) of what my school pays (and I'm not at one of the super high-paying ones).\n\nI think one of the major reasons Japan (and especially Tokyo) is considered so expensive is because those surveys of cost of living look at typical expat packages for people high up in multinational corporations, which doesn't really compare to the more humble lives led by international teachers. The expat packages try to maintain a \"Western\" lifestyle, meaning those people tend to live in one of the (very expensive!) expat hubs in apartments that are way bigger than what most Japanese people are used to or what is really necessary in my opinion. If you live a bit more like a local, it's very affordable! \n\nIf you look online, you can find average salaries of locals to get an idea of what to expect. My salary is roughly in line with that of the average man my age in Tokyo, or a bit higher depending on the source and how you look at it. It's common for only one spouse to work here while supporting a family, something that I think would have been impossible for my family in the States. Honestly, if I were single and didn't have a kid, I think I could live rather luxuriously- haha.", "created_utc": "1628049368.0", "edited": "False", "id": "h7n03wh", "is_submitter": "False", "link_id": "t3_ox3az9", "parent_id": "t1_h7mmxgy", "score": "3", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "No, it doesn't, but I think that's unusual, and most schools do seem to offer tuition. The reason mine doesn't is a bit complicated, so feel free to DM if you want more information about that.\n\nRight now, my daughter is in Japanese public preschool (she's three), and it's been absolutely amazing. I feel like Japan is a paradise for elementary age kids; she plays in the mud, hunts bugs, sings songs (all Japanese preschool teachers can play the piano), and is just absolutely thriving while learning the language. Once kids get to middle school, though, it can be a mixed bag. We're planning to switch to the school I work at in a couple of years, when my daughter's kindergarten age. That will be a bit of a stretch financially, but I think we will be able to afford it when the time comes, and if my husband can find work, it won't be much of a problem at all.\n\nIf you look online, you'll find a lot of people saying you need crazy amounts of money to be able to support a family here, but I haven't found that to be the case at all, as long as you can be happy living in a more family-focused area (i.e. not Shinjuku, Shibuya, or the other expat havens) and are okay with smaller living quarters. And there are so many amazing public parks and things to see and do that staying at home isn't that appealing anyway- haha.", "created_utc": "1628040077.0", "edited": "False", "id": "h7mi6dz", "is_submitter": "False", "link_id": "t3_ox3az9", "parent_id": "t1_h7mgnfz", "score": "1", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "Japan has a reputation for being a very expensive place to live, but I've found it to be much more affordable than where I'm from (Texas) in a lot of ways. Healthcare is affordable, and housing is actually cheaper than you would expect, especially considering that you don't have to pay more to live in a \"safe\" neighborhood like you do in so many other parts of the world. Housing is smaller, of course, but with the right expectations and some adjustments, it isn't really a problem. There are so many free or cheap things to do, and the schools here tend to pay well. I have a non-working spouse and kid and am not at one of the highest paying international schools, but we are able to live comfortably and save money every month.", "created_utc": "1628028994.0", "edited": "False", "id": "h7lv568", "is_submitter": "False", "link_id": "t3_ox3az9", "parent_id": "t3_ox3az9", "score": "3", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "I only have another anecdote to offer, but my daughter (3 years old) had a very slight fever and cough today, and they immediately tested her for Covid when we took her to the doctor. She didn't have any other symptoms (such as loss of taste or smell), and she hasn't been around anyone else who has tested positive. Not sure if testing protocol has changed since the Olympics or if the place we went has different policies, but in our case they were definitely proactive about testing.", "created_utc": "1626261056.0", "edited": "False", "id": "h554b5h", "is_submitter": "False", "link_id": "t3_ojt1ij", "parent_id": "t1_h550lo3", "score": "4", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "Hey, don't get too down about this! Some of the teachers in the international school teaching subreddit mentioned that it's possible to get a teacher's certification while living abroad and even complete your student teaching requirement at an international school (which would also be a great networking opportunity). So don't give up hope- I started my career teaching ESL in a cram school, and so did a lot of my colleagues and the friend I mentioned. It's true that you will have to earn some additional qualifications, but you might not have to leave Japan at all for that. International teaching can be competitive, but if you're open to working in different countries, it shouldn't be any trouble at all. There are usually plenty of openings in China, Taiwan, SE Asia, and Latin America, so you can skip the two years of experience in your home country. You can always travel, try some other places, and eventually make your way back to Japan if that's what you really want. It's doable; 頑張って!", "created_utc": "1625569162.0", "edited": "False", "id": "h483zcr", "is_submitter": "False", "link_id": "t3_oe1bu4", "parent_id": "t1_h447up8", "score": "3", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "okayamerican", "body": "A better place to ask for help would be the international teachers subreddit.\n\nThat being said, I work at an international school in Tokyo. I had a teacher's certification from my home country, an MA, and 6 years of experience teaching at public schools in the US before I was hired. Your work teaching in cram schools or conversation schools usually doesn't count for anything- it shows that you can adapt to living abroad, which is a positive, but it generally won't count as experience when it comes to the minimum requirements for the position or salary.\n\nMost international schools require a minimum of a teaching certification and two years of post-certification teaching experience. If you don't want to go back to your home country for the two years, it's possible to find work on a \"less desirable\" country or in a bilingual school (which is considered less prestigious than a true international school). That wasn't my route, but I know someone who racked up several years of cram school work in Korea, went back to Canada for teacher's certification and an MA in education, then found work in Indonesia and China. Now she's back in Korea at an international school. \n\nJapan is considered a very desirable country, so there is usually more competition. Without the minimum requirements, you probably won't have a shot.", "created_utc": "1625477049.0", "edited": "False", "id": "h443135", "is_submitter": "False", "link_id": "t3_oe1bu4", "parent_id": "t3_oe1bu4", "score": "7", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "okayamerican", "body": "I started reading French after learning Spanish, so the similarities between the two languages made it much, much easier. But I started with a trashy romance novel once I had finished the Duolingo course. I feel like it's a good idea to have at least seen all of the major grammar points, even if you haven't totally mastered them (the mastery will be assisted a lot by the reading anyway). The book was easy, juicy, and about 100 pages, which helped motivate me to finish it. It gave me a huge sense of accomplishment to be able to finish a complete book written for native speakers.\n\nI did the same thing with the first book I read in Spanish (Harry Potter, which I had never read in English): I looked up EVERY single word I didn't know, wrote it down in a word document, then added it to an SRS program and studied the words before moving on with my reading. It was time consuming in the beginning, but a lot of that vocabulary is recycled, so by the time you get halfway through the book, your reading speed and comprehension will improve quickly. There are also a lot of vocabulary words that you encounter in fiction that are rare in other genres of writing (words like \"chortle\" or \"grimace\" or \"sigh\"). I ended up learning a lot of words that people might not consider particularly useful, but if you're aiming for fluency comparable to your first language, you will eventually need all of those words anyway, so I didn't consider it wasted time. Sometimes that one obscure word can be the key to understanding something you're reading too, so it all helps.\n\nWith any book, though, the first few chapters will take some extra work because you have to figure out certain words the author uses and what's happening, so if you can make it through the beginning, it will get easier as you keep going. This is still true for me, and I'm on my 30th book in French right now. If you love reading in English, you will be able to persevere I think. People who don't like reading much in their first language should probably take a different route to make things easier for them, though. It's challenging but really rewarding!", "created_utc": "1625396916.0", "edited": "False", "id": "h40glpu", "is_submitter": "False", "link_id": "t3_odehae", "parent_id": "t3_odehae", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "Children need at least 20% of their waking hours in a language to pick it up to a native level. Since you live in the US, you absolutely don't need to worry about English. And since that's the language you and your wife use to communicate with each other, your child will have that reinforcement at home anyway. If you're serious about teaching another language, you will have to be very committed and strategic. Unfortunately, it doesn't happen casually. Putting a kid in front of a TV program in another language, for example, won't do anything if they don't have a human being they regularly interact with in that language. It will just sound like gibberish to them. Maybe they will be able to pick up a few words or phrases, but that's it.\n\nA common strategy is One Parent, One Language (OPOL), where each parent speaks a single language with the child at all times. The \"at all times\" part is really crucial because many children will resist the language and want to default to what's easier (English in this case). They won't make the effort to learn unless they feel the language is absolutely necessary for them. The fewer languages, the easier this is to manage. So if you want to just go Portuguese, that's fine. If you want to do Portuguese and your wife Farsi or Ukrainian, that will allow your kid to grow up trilingual. But you have to be very conscientious and strict, and you will have to bring in outside resources to build vocabulary beyond the basic words used for daily life in the home. Once the language is established, then TV and movies can have a benefit. Reading books can also have a tremendous impact, and sometimes you can find playgroups with other families who speak that language, which is even better.\n\nThere are a lot of books and support groups online, so definitely seek those out. I'm also raising my kid to be multilingual, and this is the advice I've gathered from talking to a lot of parents and reading the research they've recommended. It can definitely be done, but it's more work than many people seem to realize.", "created_utc": "1621823773.0", "edited": "False", "id": "gz8cphd", "is_submitter": "False", "link_id": "t3_niwbqb", "parent_id": "t3_niwbqb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Japan was only closed briefly, and I don't think that will happen again.", "created_utc": "1620739796.0", "edited": "False", "id": "gxq689c", "is_submitter": "False", "link_id": "t3_n9ns1p", "parent_id": "t3_n9ns1p", "score": "1", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "Is Michel Thomas similar? I used it when I first started and liked it, but it won't get you very far.", "created_utc": "1617875748.0", "edited": "False", "id": "gtsiq9f", "is_submitter": "False", "link_id": "t3_mmhhce", "parent_id": "t3_mmhhce", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "My daughter is also starting yochien this month with limited Japanese. For this age, I've mostly only heard positive things from other foreign parents. The kids are too young to really start bullying yet, and they pick up the language pretty quickly without too much trouble. My daughter started at a Japanese daycare four months ago, and the transition was pretty smooth. She made friends quickly on spite of the language barrier. She's picked up some Japanese (and her friends have picked up some English). It depends a lot on the kid and the yochien, but overall I think the teachers do a good job of integrating the kids and making it work. \n\nIf you have Facebook, there's an excellent group called Parents with kids in Japanese schools. Lots of advice there, and you can read other people's experiences and ask for help if you ever run into problems with adaptation, bullying, or whatever else.", "created_utc": "1617828659.0", "edited": "False", "id": "gtqdrcg", "is_submitter": "False", "link_id": "t3_mm6i76", "parent_id": "t3_mm6i76", "score": "6", "subreddit": "japanlife", "subreddit_id": "t5_2rg2o"}, {"author": "okayamerican", "body": "they dead.", "created_utc": "1617794035.0", "edited": "False", "id": "gtobn1x", "is_submitter": "False", "link_id": "t3_mlulw1", "parent_id": "t3_mlulw1", "score": "1", "subreddit": "PublicFreakout", "subreddit_id": "t5_2yrq6"}, {"author": "okayamerican", "body": "I could never teach my kids something called Raggedy Dick. They could probably handle it, but I'm definitely not mature enough.", "created_utc": "1616151713.0", "edited": "False", "id": "grgu9ah", "is_submitter": "False", "link_id": "t3_m8drpt", "parent_id": "t1_grgr4xg", "score": "3", "subreddit": "ELATeachers", "subreddit_id": "t5_2vvc8"}, {"author": "okayamerican", "body": "I love teaching Medea, and the kids get really into it. Very easy to touch on contemporary issues: feminism, immigration, etc.", "created_utc": "1616051402.0", "edited": "False", "id": "grbujco", "is_submitter": "False", "link_id": "t3_m77pck", "parent_id": "t3_m77pck", "score": "3", "subreddit": "ELATeachers", "subreddit_id": "t5_2vvc8"}, {"author": "okayamerican", "body": "I think it took me about 6 or 7 months to get through Genki 1.\n\nMost colleges that use Genki do one book in two semesters, and a lot of people say that you can pass N4 after finishing Genki 2. The next book in the series (the first Quarter book) claims to take you to N3. \n\nSo finishing five semesters in college would probably help you pass N4 without too much trouble and N3 if you put in the extra work.", "created_utc": "1615629451.0", "edited": "False", "id": "gqsbeet", "is_submitter": "False", "link_id": "t3_m42riu", "parent_id": "t3_m42riu", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "Those are exactly the resources I use! I'm on Genki 2 right now and have a workflow that is working well for me. Once I get through all of the steps, I feel pretty confident with moving forward, especially knowing that many of the topics will be reinforced later on.\n\nHere's my workflow for each chapter:\n\n1. Textbook grammar and vocab\n\n2. Tokini Andy explanation on YouTube\n\n3. Textbook practice exercises (using Seth Clydesdale website)\n\n4. Workbook lesson\n\n5. Reading and writing section of textbook (using Seth Clydesdale website to check)\n\n6. Workbook reading and writing section\n\nI also do Wanikani daily (I'm on level 14 and mostly just have time for reviewing, not adding new kanji. It's helped tremendously with vocab retention when I encounter the words in Genki, though). I also started the Tango N5 Anki deck once I was close to completing Genki 1. That helped a ton, and I plan to keep reviewing that and starting the N4 deck soon.\n\nWhen I was on vacation, I was doing about one chapter a week. Now that I'm back at work (also have a 3 year old at home), I'm aiming for one chapter every two weeks, though some chapters are more challenging and are being pushed to three weeks. But I agree with others who have said it depends so much on the person and the time they have available. My only additional advice is to not wait until you understand and remember everything 100% before moving on. Many concepts won't fully sink in until you've encountered them again in future chapters or in the wild. If something doesn't click immediately, try your best but don't let it hold you up too long.", "created_utc": "1615608088.0", "edited": "False", "id": "gqrmssw", "is_submitter": "False", "link_id": "t3_m3vqzy", "parent_id": "t1_gqrl9xe", "score": "7", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "Not every county will recognize your relationship, and I imagine the majority will require a marriage certificate to issue a visa. I'm in Japan, and my school told me it wasn't possible to bring my spouse because Japan wouldn't recognize our marriage. Some research online told me that wasn't true, but we would have to apply for a special visa (\"designated activities\" instead of \"spouse\"). We hired a Japanese immigration lawyer at our own expense and managed to get the visa without much of a problem (just a ton of extra documents to prove our relationship was real, even though we are literally married and adopted a child together). It was annoying, but it worked. I imagine Thailand won't be much of a problem, but I don't know for sure. I know a same-sex couple living in Bangkok now with only one person working, but he works for the US State Department, and they are married. You'll have to do your research.", "created_utc": "1615148967.0", "edited": "False", "id": "gq4uwxy", "is_submitter": "False", "link_id": "t3_lzm1sk", "parent_id": "t3_lzm1sk", "score": "1", "subreddit": "Internationalteachers", "subreddit_id": "t5_37htm"}, {"author": "okayamerican", "body": "The words are used in the lessons and the workbook, so you will have a chance to practice them that way. Just refer back to the vocabulary section when you forget the meaning, and it will start to stick after a while. I definitely wouldn't slow yourself down by trying to memorize all the vocab first.\n\nIf you feel like the vocab isn't sticking after finishing the lesson, though, you can find Anki decks with Genki vocabulary. That's a good way to reinforce everything you learn.", "created_utc": "1613970314.0", "edited": "False", "id": "gob55j8", "is_submitter": "False", "link_id": "t3_lpagwa", "parent_id": "t3_lpagwa", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "Hahaha same!", "created_utc": "1613969396.0", "edited": "False", "id": "gob3po0", "is_submitter": "False", "link_id": "t3_lp8817", "parent_id": "t1_gob14m3", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I have a toddler and a full-time job, so I wake up at 5am every day to study. It's the only way I can carve out dedicated time for my target languages. Im a beginner in Japanese, so I use a textbook and workbook; it saves me a lot of time that I would otherwise use looking for materials and figuring out what to study. If I have time, I supplement with podcasts. \n\nFor languages I know well, I read in the language most nights before going to sleep, and I watch TV shows or YouTube videos when I have some spare time.\n\nIt's been tough TBH...way easier before becoming a dad!", "created_utc": "1613939282.0", "edited": "False", "id": "go9hqhu", "is_submitter": "False", "link_id": "t3_lp4nbq", "parent_id": "t3_lp4nbq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "My feeling is that \"lover\" in English has a sexual connotation 100% of the time, and usually carries a moral judgment as well (unless someone chooses to call their own partner their \"lover,\" but even in that case the sexual connotation would still be there).", "created_utc": "1613731267.0", "edited": "False", "id": "gnzseg3", "is_submitter": "False", "link_id": "t3_ln7cho", "parent_id": "t1_gnzs62m", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "This is identical to how the word is used in English though... Or am I missing something?", "created_utc": "1613730186.0", "edited": "False", "id": "gnzraj2", "is_submitter": "False", "link_id": "t3_ln7cho", "parent_id": "t1_gnzhbcf", "score": "5", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "Yes, that's true for me, too! I just wish it was like Chinese where you didn't have so many different readings for each kanji. That's such a big headache. 😫", "created_utc": "1613682180.0", "edited": "False", "id": "gnxiulz", "is_submitter": "False", "link_id": "t3_lm8j9v", "parent_id": "t1_gnw4qow", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "😂😂😂....😭😭😭", "created_utc": "1613651454.0", "edited": "False", "id": "gnvnl4s", "is_submitter": "False", "link_id": "t3_lml2tn", "parent_id": "t3_lml2tn", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I'm the same way, and audiobooks were a challenge for me (another reason I prefer podcasts). \n\nFor podcasts, there's a gay (and sometimes lesbian and trans) podcast called Homomicro that is no longer produced but has over 200 older episodes to listen to. I've gotten some good book and movie recommendations from it because they usually have a segment about that.\n\nIf you need something a little slower and easier, Inner French and Français Authentique are really great.\n\nFor true native content, Slate.fr has a ton of podcast options, and quite a few are queer-centric or have episodes that deal with gender, sexuality, and similar topics. France Culture also has a ton of options, depending on your interests. If you're interested in world news, Le monde devant soi that I like.\n\nAnother good idea is to find a podcast app that lets you search by language. I use Podcast Addict, and it's been very useful for discovering new things. And when you find a podcast you like, it will suggest similar ones in that language.", "created_utc": "1613651259.0", "edited": "False", "id": "gnvnbse", "is_submitter": "False", "link_id": "t3_lmjt40", "parent_id": "t1_gnvj7ht", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "I agree that you should pick the one you are most interested in (language, culture, lifestyle if you had a chance to live there, everything). That's really the most important factor if you're going to undertake learning something so challenging.   \n\nIf you really can't decide, Korean is easier because you don't have to learn kanji. Korean and Japanese grammar seem about equal to me. Although Korean pronunciation might be more challenging than Japanese, not having to learn kanji will save you SOOOOO much time. You can use all of that time and energy to build vocabulary, do more reading, learn more grammar, focus more on listening and speaking, etc.\n\nIn terms of opportunities, though, I feel like there are a lot more Koreans who speak English already, so it might be more beneficial to learn Japanese. I've lived in Korea before and live in Tokyo now, and that's been my impression. Japan seems more inward-facing, and the emphasis on learning English isn't quite so high which would make you more valuable as an employee. Japan also has better working conditions from what I've seen, and it seems easier to get a work visa with fewer restrictions. Japan also has a bigger population and economy (at least at the moment), so that could be an additional factor for you.\n\nWhatever choice you make, though, I think there will be benefits. And the languages have a lot of similarities, so if you learn one and decide you want the other one, you will have a big boost already. So don't stress too much; just go with your gut and your interest!", "created_utc": "1613646542.0", "edited": "False", "id": "gnvhmnn", "is_submitter": "False", "link_id": "t3_lm8j9v", "parent_id": "t3_lm8j9v", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Comprehensible Japanese\n\nThe Authentic German Learning Podcast\n\nInner French\n\nFrançais authentique\n\nSimple Italian\n\nComprehensible Slovak", "created_utc": "1613645760.0", "edited": "False", "id": "gnvgru0", "is_submitter": "False", "link_id": "t3_lmfodo", "parent_id": "t3_lmfodo", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I've had trouble finding non-English audiobooks on Audible and Google Play, too. If you search for \"Français,\" you get a lot of results, but for some reason they are mostly TERRIBLE quality. Like the \"self-published\" lev of audiobooks. I did see Call Me By Your Name on there, though (Appelle-moi par ton nom), and that's fine. But not originally in French. Even for Spanish, offerings are very limited.\n\nI haven't had a lot of luck with free audiobooks, though there are some options in French if you search. But those also seem to be mostly low quality or titles that are so old that I don't think I'd be able to understand them without being able to see the words and access a dictionary. I've resigned myself to just listening to podcasts, and luckily there are plenty of good ones.", "created_utc": "1613645510.0", "edited": "False", "id": "gnvghxy", "is_submitter": "False", "link_id": "t3_lmjt40", "parent_id": "t3_lmjt40", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "I get it! I have a 20 minute WALK to work and love it. Being in a train is so energy-draining!", "created_utc": "1613624535.0", "edited": "False", "id": "gnur1a0", "is_submitter": "False", "link_id": "t3_llbfc2", "parent_id": "t1_gntfm6m", "score": "2", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "Oh yeah, if you work in Ariake, Kita-ku would be a miserable commute. But there might be another place closer that could work.", "created_utc": "1613594114.0", "edited": "False", "id": "gnt02y6", "is_submitter": "False", "link_id": "t3_llbfc2", "parent_id": "t1_gnsac77", "score": "2", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "There's a Facebook group called Parents with kids in Japanese schools, and they get questions like this all the time. Someone there might be able to help you. There's also the Tokyo Mother's Group. \n\nIf you are willing to live in a different ward, it might be easier to find an opening. We live in Kita-ku, and there were plenty of openings when it was time to put our daughter in hoikuen.", "created_utc": "1613558225.0", "edited": "False", "id": "gnr39f2", "is_submitter": "False", "link_id": "t3_llbfc2", "parent_id": "t3_llbfc2", "score": "4", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "A lot of people have recommended this audio course called Language Transfer (https://www.languagetransfer.org/), and they have a Swahili course! Duolingo also has Swahili, so those two resources might be a good place to start.", "created_utc": "1613211671.0", "edited": "False", "id": "gn6i84u", "is_submitter": "False", "link_id": "t3_liwbl8", "parent_id": "t3_liwbl8", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "There's a chrome extension called Language Learning with Netflix that you can use to watch any Japanese language show on Netflix. Might be what you're looking for (good for Terrace House!)", "created_utc": "1612349388.0", "edited": "False", "id": "glujoq7", "is_submitter": "False", "link_id": "t3_lbjgke", "parent_id": "t3_lbjgke", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "I do teach English, but it's at an international school, so I teach like I did in the States (not really an ESL type job). It''s very different from eikaiwa/ALT jobs (more difficult to get a job but much better pay and benefits). If you want to teach another language, there are options, but they are limited. If you're a certified and experienced foreign language teacher from the States or the UK, you could also find work teaching that in an international school. To teach it outside of an international school setting, though, you definitely have to be a native speaker and will also need experience and certificates. Since Tokyo has a huge economy, there are language institutes for most major languages (there an Institut Français, Instituto Cervantes, Goethe Institut, and an Italian language and cultural center). But if you're a native English speaker, that's where 99% of the job opportunities are. Japanese students very rarely take a language other than English in school, so that's where all the focus is. ALT jobs seem like a pretty good introduction to Japan to me, and several of my colleagues got their start doing that.", "created_utc": "1612095227.0", "edited": "False", "id": "glh24yl", "is_submitter": "False", "link_id": "t3_l83si1", "parent_id": "t1_gldlrf9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Yeah, there's a German school in Yokohama, too, but not many non-English options overall.", "created_utc": "1612002045.0", "edited": "False", "id": "glct14c", "is_submitter": "False", "link_id": "t3_l83si1", "parent_id": "t1_glcb949", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "B2 is a self-assessment, so I don't know for sure. I took a French teacher certification exam back then that was supposed to be about B2, and I passed. It's possible my French was higher (especially in reading) when I did the interview because I was working really hard to improve at the time. Now all of my time is spent on Japanese, and my French has deteriorated a lot. I do use French at work, but not nearly as much as I expected since I don't have to be at work that often, and we only very rarely have meetings (hence why I have so little stress!). I want to improve my French again one day, but Japanese is a beast and I have a toddler, so it's not as easy to find the time as it once was.\n\nI teach English writing and literature (my school has a lot of students who are fluent English speakers).", "created_utc": "1611985099.0", "edited": "False", "id": "glc93wf", "is_submitter": "False", "link_id": "t3_l83si1", "parent_id": "t1_glc3ii0", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I'm a teacher. Learning Spanish helped me tremendously at work. It didn't increase my pay, but it gave me more varied opportunities and made me a much more valuable employee. I learned French next to be able to communicate with students and their families from west African countries. Now I have a job at a French school in Japan. It's the best job I've ever had, much less stress than working in an American school. I'm learning Japanese now of course.\n\nI know plenty of people who have found new career opportunities because they spoke French or Spanish, so I disagree that it's pointless. It just depends on your field and what you're interested in doing. It definitely opens up opportunities to live abroad, and you have less competition since so few English speakers bother to learn another language well.", "created_utc": "1611959175.0", "edited": "False", "id": "glat83t", "is_submitter": "False", "link_id": "t3_l83si1", "parent_id": "t3_l83si1", "score": "186", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "If you're a beginner, pick a good textbook and just go through it from beginning to end. Set goals for yourself (like one chapter a week or whatever works for you) and just commit to finishing it. A good textbook will have vocabulary, grammar, listening activities, maybe an accompanying workbook for writing, etc. so you don't have to figure out how to hit all of those areas on your own.\n\nI think a lot of people get overwhelmed with all of the different resources available nowadays, so it's important to pick one and fully commit yourself to it. If you have extra time or get bored with just one thing, maybe alternate a second one. But don't try to do everything at once or you'll lose focus and motivation.", "created_utc": "1611877859.0", "edited": "False", "id": "gl5z43t", "is_submitter": "False", "link_id": "t3_l7aelm", "parent_id": "t3_l7aelm", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "It's not just pronunciation problems.", "created_utc": "1611694956.0", "edited": "False", "id": "gkvafg2", "is_submitter": "True", "link_id": "t3_ir11ra", "parent_id": "t1_gkr02cq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Well it's definitely not number 1. They understand English very well. They also live their lives mostly in English day after day, with no noticeable improvement in their grammar after more than a year.", "created_utc": "1611606935.0", "edited": "False", "id": "gkqxu0u", "is_submitter": "True", "link_id": "t3_ir11ra", "parent_id": "t1_gkqrh3x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "It varied by school. I think this is the website I used to choose what schools to study at: https://www.languagecourse.net/schools--guatemala.php3\nThere is a lot of detailed information as well as reviews.\n\nThe first time I went, I traveled around the country and didn't stay at one school for more than a week and a half. The school in Quetzaltenango (Proyecto Linguistico) was very good, and the teachers seemed very well-trained (they cooperatively own the school). That's the one I would recommend (although keep in mind this was over 15 years ago haha). Also, if you aren't very left-leaning, you could feel uncomfortable there (we sang Bella Ciao at one of our gatherings, and there were former guerilla fighters from the civil war among the teaching staff).\n\nMany schools in Antigua also have a good reputation since it's more of a tourist town (and the safest place to study for sure).\n\nI heard some disparaging remarks about some of the teachers in the more indigenous communities, including that Spanish wasn't their first language. Unless you're at a very high level, I don't think that matters, and the teachers I had were wonderful and very effective. The Lake Atitlán area was also very laid-back and beautiful, with great weather, restaurants, and accommodation. I liked studying there best. But it was true that I had teachers who didn't know some of the vocabulary I used when we played Scrabble...it didn't affect my learning, but since there are fewer educational opportunities in some of those communities, you could run into that. \n\nIn general, though, most schools seem to have some kind of professional development for their teachers, even if many of them don't have university degrees for teaching Spanish. The schools often post pictures on Facebook of their teachers doing these classes.", "created_utc": "1610344301.0", "edited": "False", "id": "giui34i", "is_submitter": "False", "link_id": "t3_kur5t5", "parent_id": "t1_giu7e0e", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "When I looked, that's pretty much what I found too. But I think there's enough in your list to keep you busy for N5. JapanesePod101 has a ton of content, so I don't think there's much need for additional stuff at the N5 level.", "created_utc": "1610337394.0", "edited": "False", "id": "giu6kvd", "is_submitter": "False", "link_id": "t3_kut61v", "parent_id": "t3_kut61v", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "There are a lot of great, affordable language schools in Guatemala if Spanish is your target language. They all involved staying with a host family and 4 hours of daily one-on-one lessons (not group classes). My brother and I studied there and both had good results. I had studied Spanish before, but my brother went from zero Spanish to conversationally fluent, and we were there for about a month. He was 13 years old at the time. \n\nAs always, though, results vary by person. I met people who had been attending those schools for more like 6 months and made very little progress. A lot of people just wanted to party, so they spent a lot of time drinking, skipping class, and hanging out with other students. My brother and I studied and drilled vocabulary every night, and I did a lot of intensive reading outside of class hours. My Spanish still isn't perfect, but I feel confident about my level and think my time in Guatemala had the biggest impact on my success (if for no other reason than it allowed me to prioritize learning Spanish for an extended period of time). Also, just as a bit of extra information, I didn't get much from my homestays. The families were mostly interested in earning cash, and I didn't interact with them so much (they had lives of their own and we're paid more to provide room and food, not to be our best friends).\n\nSo it's impossible to answer your question definitively, but the right kind of person can make significant progress in one or two months. It's more about dedication that anything else, though.\n\nEdit: just to add to this, I also did group French classes at a language school in Paris and didn't get nearly as much out of it. I had a good teacher and the class size was small, but one-on-one was significantly better, especially for speaking practice. You can't hide or keep quiet when you don't feel confident about something, and you won't be slowed down by other people who don't know certain words or grammar points. Two weeks of one-on-one is worth at least a month (or more) of group classes in my opinion.", "created_utc": "1610337009.0", "edited": "1610337217.0", "id": "giu5u6o", "is_submitter": "False", "link_id": "t3_kur5t5", "parent_id": "t3_kur5t5", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Not sure if you live in Japan, but it's very much behind the times when it comes to adopting new technology (you can still buy burnable CDs at the pharmacy, as if that's an essential item these days!). So I had the same problem with Japanese textbooks, and I ended up just buying an external CD player that plugs into my Macbook. I think it was only $5 or $6, and it's easier than trying to find mp3 versions of all the audio I need.", "created_utc": "1609819360.0", "edited": "False", "id": "gi59duh", "is_submitter": "False", "link_id": "t3_kqlrqp", "parent_id": "t3_kqlrqp", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "okayamerican", "body": "D'accord is used all the time- it's extremely common. I don't think I've heard anyone say \"d'acc.\" \"OK\" is used, but I think d'accord is still more common (maybe depends on context and register).", "created_utc": "1609545110.0", "edited": "False", "id": "ghrvnjh", "is_submitter": "False", "link_id": "t3_kom13j", "parent_id": "t3_kom13j", "score": "31", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "1. Spanish (incredibly good and diverse options)\n2. French (lots of good stuff)\n3. Japanese (mostly just city pop, which is kind of cheesy, but in a good way; a few other minor gems I've found)\n4. Mandarin (not studying currently but found a few good Taiwanese bands, especially this one called Jade Eyes)\n5. German (soooo bad. I've tried REALLY hard to find German music I like and only have a handful of tolerable songs, nothing I'm super excited about except some Marlene Dietrich and, like, opera haha)\n\nI'm not studying Italian or Portuguese, but I've run across a lot of good music in those languages, too. But never, ever German 😂😂😂", "created_utc": "1609236167.0", "edited": "False", "id": "ghdpeun", "is_submitter": "False", "link_id": "t3_klrhc9", "parent_id": "t3_klrhc9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "You can find Disney songs in both languages, though it's not a 1-to-1 translation since they have to make the song rhyme. That's probably true for most songs anyway, though.", "created_utc": "1607852968.0", "edited": "False", "id": "gfo8r06", "is_submitter": "False", "link_id": "t3_kbyger", "parent_id": "t3_kbyger", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "I've heard Indonesian is relatively easy, but I have no experience learning it.", "created_utc": "1604868383.0", "edited": "False", "id": "gbnezkb", "is_submitter": "False", "link_id": "t3_jqg81h", "parent_id": "t3_jqg81h", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Best of luck! Sounds exciting.", "created_utc": "1604725885.0", "edited": "False", "id": "gbfd63l", "is_submitter": "False", "link_id": "t3_jpky5p", "parent_id": "t3_jpky5p", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I tried if for a couple of weeks and hated it. It was just a lot easier to use Anki or Memrise. I think people like it because it's so complicated that it makes you feel productive. Maybe it would have useful in 1998 or something.", "created_utc": "1603361913.0", "edited": "False", "id": "g9mtz8s", "is_submitter": "False", "link_id": "t3_jfmg2i", "parent_id": "t3_jfmg2i", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Booo", "created_utc": "1603361817.0", "edited": "False", "id": "g9mtvwd", "is_submitter": "False", "link_id": "t3_jfq5n6", "parent_id": "t3_jfq5n6", "score": "1", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "I have this problem too sometimes. I think when you are beginning, it's totally fine to just remember one meaning of the word. You can add secondary meanings when you're more advanced and doing lots of listening and reading practice. It will be much easier to add one additional meaning to a word you already know than to remember multiple meanings for a word you're learning for the first time.\n\nAnother option is to learn with sentences instead of words. That way the word is in context and you can understand the different meanings from that. There are usually good flashcard decks on Anki that are totally made up of sentences. I'm not a Russian learner, but I have a feeling that's especially the case with Russian since the grammar can be so difficult with the many cases you have to learn.", "created_utc": "1603361398.0", "edited": "False", "id": "g9mthy0", "is_submitter": "False", "link_id": "t3_jfwsnc", "parent_id": "t3_jfwsnc", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "It sounds very dramatic, like a character from a fantasy novel. If you need to use your English name for professional purposes (like at work at an English-speaking company, dealing with English-speaking clients, doing graduate studies at an English university, etc.), then I'd recommend a different name. Actually, most Chinese (and Korean) people I know with English names only have an English first name and keep their Chinese or Korean last name. I've never met someone with a full English name.\n\nSo basically, I think your name sounds cool but it might not be practical!", "created_utc": "1602840342.0", "edited": "False", "id": "g8zjb6i", "is_submitter": "False", "link_id": "t3_jc4z4v", "parent_id": "t3_jc4z4v", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "It's secondary level. I'm certified to teach French and Spanish in Texas, but other places require either a college major or 12 upper level hours in the language.", "created_utc": "1602412236.0", "edited": "False", "id": "g8gsl6u", "is_submitter": "True", "link_id": "t3_j7tn15", "parent_id": "t1_g8ghfnl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Thanks- they have some advanced level online courses...couldn't find anything that wasn't a degree program, though. Maybe it would be possible to enter as an undergrad and just take some courses without completing a degree, though...", "created_utc": "1602285180.0", "edited": "False", "id": "g89it5n", "is_submitter": "True", "link_id": "t3_j7tn15", "parent_id": "t1_g88wxrg", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Thanks--- I'm not sure if those kinds of courses would qualify for this situation, but I'll check it out to see.", "created_utc": "1602254279.0", "edited": "False", "id": "g87xgzg", "is_submitter": "True", "link_id": "t3_j7tn15", "parent_id": "t1_g87ukyb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I love Édouard Louis, Didier Eribon, and Pierre Bourdieu. Books, podcasts, interviews on YouTube...would love to discover some more if you have any to recommend.", "created_utc": "1602240527.0", "edited": "False", "id": "g87cz2l", "is_submitter": "False", "link_id": "t3_j7wbme", "parent_id": "t3_j7wbme", "score": "3", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "okayamerican", "body": "Sorry people are being jerks to you for no reason. I guess they think living in Tokyo makes them super cool and they have to lord it over someone.", "created_utc": "1601719161.0", "edited": "False", "id": "g7i1ven", "is_submitter": "False", "link_id": "t3_j3ukxu", "parent_id": "t1_g7h0a00", "score": "1", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "We also went with Taka and had a fantastic experience!", "created_utc": "1601081439.0", "edited": "False", "id": "g6lbilo", "is_submitter": "False", "link_id": "t3_izfhah", "parent_id": "t1_g6l8l8r", "score": "4", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "There's a video someone made that can give you that experience! It's called something like \"how english sounds\" or something, and it's a conversation made up of nonsense words that follow English sound structure, so you can get an idea of what it would sound like to non-native speakers. It's very cool!", "created_utc": "1600758528.0", "edited": "False", "id": "g66z401", "is_submitter": "False", "link_id": "t3_ix7kpr", "parent_id": "t1_g65ksny", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Way to go!", "created_utc": "1600600442.0", "edited": "False", "id": "g5yo95h", "is_submitter": "False", "link_id": "t3_ivyiy4", "parent_id": "t3_ivyiy4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Wow, I love this! Thank you for sharing.", "created_utc": "1600245084.0", "edited": "False", "id": "g5gcbv7", "is_submitter": "False", "link_id": "t3_itjj3t", "parent_id": "t3_itjj3t", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I think that's great advice and similar to my experiences: having a kid felt almost like rapid cognitive decline😩😩. I have a 2.5 year old, and sometimes I get really jealous hearing child-free polyglots talk about their language routines. \"Use your downtime,\" they say, and I can only laugh. For me, though, I actually had a little more of that downtime the first six months or so (if you have maternity leave, that means less work pressure, and newborns sleep a lot, even if it's not at the most convenient times). Once my daughter was able to crawl and was sleeping a bit less, that's when I really found my time constrained. So you might have a transition period where you can experiment and figure out what will work best for you. For me, my husband and I take turns giving each other some dedicated parent-free time each week, and I use most of that for studying my target languages. It's usually only a couple of hours a week, but better than nothing.", "created_utc": "1600117454.0", "edited": "False", "id": "g5aaeag", "is_submitter": "False", "link_id": "t3_isotrx", "parent_id": "t1_g59cbai", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "LOLOL, Larissa explains it all.", "created_utc": "1599880469.0", "edited": "False", "id": "g4w97k1", "is_submitter": "True", "link_id": "t3_ir11ra", "parent_id": "t1_g4vp2b2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I used to be an ESL teacher and went to a talk Krashen gave as part of my professional development. I loved what he had to say and felt really inspired, but it just didn't coincide with what I actually saw happening in the classroom. Maybe it was just because we weren't an audience of linguists and scholars, but he seemed to really oversimplify things. I would love to just do input all the time...but I've found that it can really only take me so far.", "created_utc": "1599880445.0", "edited": "False", "id": "g4w968k", "is_submitter": "True", "link_id": "t3_ir11ra", "parent_id": "t1_g4vr2gu", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Wow, that sounds like it could be exactly what's happening here. I'm definitely going to check out this book---- thank you!", "created_utc": "1599880001.0", "edited": "False", "id": "g4w8hfq", "is_submitter": "True", "link_id": "t3_ir11ra", "parent_id": "t1_g4w2l2v", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "That's really interesting because on this show it seems to be more of an issue for the Brazilians than for people from other places (a lot of whom come from other parts of Latin America, so it's not even a wildly different language or anything). I've met Brazilians who speak wonderful English, so of course I wouldn't want to generalize, but maybe there's some element at play.", "created_utc": "1599879950.0", "edited": "False", "id": "g4w8eps", "is_submitter": "True", "link_id": "t3_ir11ra", "parent_id": "t1_g4vtna3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Yeah, this whole review reads like marketing copy.", "created_utc": "1599684149.0", "edited": "False", "id": "g4l15kn", "is_submitter": "False", "link_id": "t3_iplg9j", "parent_id": "t1_g4kz48q", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "That's pretty much what I was going to say, too. There are still a lot of countries that use English because of colonial history, but maybe English would have a status more like French, Spanish or Portuguese.", "created_utc": "1599567829.0", "edited": "False", "id": "g4fnsti", "is_submitter": "False", "link_id": "t3_ionbms", "parent_id": "t1_g4ew5b7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I've heard of English speakers learning Dutch very, very quickly.", "created_utc": "1598856271.0", "edited": "False", "id": "g3fxxc0", "is_submitter": "False", "link_id": "t3_ijpgl3", "parent_id": "t3_ijpgl3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Haha, you're right. \"De les\" doesn't exist when \"les\" is an article (doesn't apply for object pronouns). Hopefully the link I posted makes that clear.", "created_utc": "1598722630.0", "edited": "False", "id": "g39f655", "is_submitter": "False", "link_id": "t3_iivwt8", "parent_id": "t1_g39ee7e", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "The secret is just hard work and consistency.\n\nHow long did you stick to all of those different resources you tried? It sounds like you are looking for a magic bullet and giving up on your study materials before they've had a chance to prove their worth.", "created_utc": "1598721837.0", "edited": "False", "id": "g39d8b2", "is_submitter": "False", "link_id": "t3_iiuacy", "parent_id": "t3_iiuacy", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "\"de les\" doesn't exist in French; it always changes to des. There are other words that do this in French too, like \"à les\" becomes \"aux.\"\n\nMore info here:\nhttps://french.kwiziq.com/revision/grammar/contractions-of-articles-a-le-au-a-les-aux-de-le-du-de-les-des", "created_utc": "1598721198.0", "edited": "False", "id": "g39bpd0", "is_submitter": "False", "link_id": "t3_iivwt8", "parent_id": "t3_iivwt8", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "\"New\" is probably just a newer edition (maybe check the publication date) but not sure. \n\nMy advice is to not buy a dictionary, though. It takes a long time to look up a word in a paper dictionary. Paper dictionaries are also less complete than online dictionaries (otherwise they would be 2000 or more pages) and are less likely to contain a lot of slang and non-standard forms of the language that you might encounter in authentic materials. They're less portable, and you also won't be able to search by the conjugated form of a verb or a variant of an adjective or noun like you can in an online dictionary. Unless you have a very specific reason you need a paper dictionary (I can't think of any personally, but I don't know your situation!), you'll have more luck with WordReference.com (which also has an app you can download on your phone).", "created_utc": "1598714477.0", "edited": "False", "id": "g38x15e", "is_submitter": "False", "link_id": "t3_iirc1m", "parent_id": "t3_iirc1m", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "French people usually drop the \"ne\" in spoken language, so don't bother listening for that.\n\nI don't know if I heard every single bolded word or not, but I understood what she was saying because those basic words just get melded together in conversation. Your brain fills in the gaps once you get used to hearing the language a lot. \n\nWe do the same thing in English. And I'm learning Japanese now and have noticed the same thing in Japanese as well...words that just completely disappear, but people who know Japanese well can still understand without a problem.", "created_utc": "1598619689.0", "edited": "False", "id": "g34ou9i", "is_submitter": "False", "link_id": "t3_ii6g61", "parent_id": "t3_ii6g61", "score": "10", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "Just looked up the name of the group I was talking about on Facebook--- it's called Japan Transgender Expat Community. They'll be able to answer any questions you might have. :)", "created_utc": "1598414994.0", "edited": "False", "id": "g2vmug5", "is_submitter": "False", "link_id": "t3_idapq5", "parent_id": "t3_idapq5", "score": "2", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "okayamerican", "body": "My husband and I live in Tokyo with our daughter (which means we can't easily pass as straight friends) and haven't encountered any problems so far (it's been a year). A lot of people on Reddit warned us that Japanese culture is very judgmental and conformist and we would have a lot of problems, and that just hasn't turned out to be true. It's been very \"live and let live\" here.\n\nWith that being said, we are both cis men, so our experiences aren't the same. I know there's a group on Facebook for trans foreigners in Japan, and they'd have a lot more information. I can't remember the name of the group, but if you ask in the Stonewall Japan group, someone can direct you there (and there are plenty of trans people in that group as well). I've heard some encouraging stories about employers accepting pronoun and name changes without any issues, though I can't say if this is the \"norm.\"\n\nI think you'd be able to find a community in Tokyo, and living here has been a dream for us. Good luck!", "created_utc": "1598392790.0", "edited": "False", "id": "g2uj1h5", "is_submitter": "False", "link_id": "t3_idapq5", "parent_id": "t3_idapq5", "score": "2", "subreddit": "expats", "subreddit_id": "t5_2rhwp"}, {"author": "okayamerican", "body": "I just want an SRS (with the option to create my own lists) that is more like a game. It doesn't have to be complicated, just something more addictive and interesting than typing a word on or doing multiple choice. I learn a lot from my SRS, but I get so bored that it's hard to do more than one language consistently. It would be great if it weren't so painful.", "created_utc": "1597822770.0", "edited": "False", "id": "g22wedc", "is_submitter": "False", "link_id": "t3_ic8txk", "parent_id": "t3_ic8txk", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Yes, I often feel like some kind of needy boyfriend who requires constant reassurance that I'm doing a good job. I'll read a novel or watch a YouTube video and say to myself, \"See? You can understand this language. You're good!\" But then I'll have trouble understanding one thing someone says to me at work or I'll mix up something I want to say and feel like all of my language abilities are a total lie. \n\nI've never taken a standardized proficiency test before (aside from teacher's certification exams for Spanish and French, but those don't give you an exact CEFR level, they're just supposed to check that you're minimum B2). Now I've decided to use exams to motivate me and serve as a progress marker. I'm hoping it will make me feel like less of an impostor if I have a benchmark I can refer to, and I won't worry that I'll be accused of lying on my C.V. when I list my language proficiency. It sounds like the certificates didn't totally make this problem go away for OP, though, so that worries me. :-/", "created_utc": "1597623820.0", "edited": "False", "id": "g1sebfh", "is_submitter": "False", "link_id": "t3_iavdpl", "parent_id": "t3_iavdpl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Hahahaha - I could totally see myself doing this!", "created_utc": "1597623133.0", "edited": "False", "id": "g1sd6dw", "is_submitter": "False", "link_id": "t3_iavdpl", "parent_id": "t1_g1ro0ci", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Wow, I've had this exact experience so many times. I thought it was just me!", "created_utc": "1597623067.0", "edited": "False", "id": "g1sd2gi", "is_submitter": "False", "link_id": "t3_iavdpl", "parent_id": "t1_g1rbifj", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Sorry, but you already write better than plenty of native speakers, and it doesn't sound robotic at all. If you still aren't satisfied with your level, you will need to take some courses designed for native speakers of English, such as a composition course. Maybe check out YouTube videos for high school and college students who want to improve their writing, or try your hand at creative writing. It sounds like you're being waaaay too hard on yourself, though.", "created_utc": "1597141601.0", "edited": "False", "id": "g137f31", "is_submitter": "False", "link_id": "t3_i7nkv3", "parent_id": "t1_g12zdoi", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "It was Inner French.", "created_utc": "1597141325.0", "edited": "False", "id": "g13753f", "is_submitter": "False", "link_id": "t3_i7novh", "parent_id": "t1_g1326kz", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Lol is this a joke?", "created_utc": "1597133366.0", "edited": "False", "id": "g12zaup", "is_submitter": "False", "link_id": "t3_i7nkv3", "parent_id": "t3_i7nkv3", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Have you tried drinking iced coffee? \n\nAnyway, the same thing applies, even if it's not a lack of enthusiasm. I get really busy at work sometimes and would rather go straight to bed than do a language lesson, but I always try to at least keep a streak going on Duolingo or work through some flashcards. Even if it's just 10 or 20 minutes, it adds up.", "created_utc": "1597133306.0", "edited": "False", "id": "g12z8px", "is_submitter": "False", "link_id": "t3_i7novh", "parent_id": "t1_g12z25y", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I totally feel this, and I think it's a good idea to take a break so you don't get totally burnt out. A podcaster I like said he has a rule that he never skips his language study more than one day in a row. If he still doesn't feel up to it, he will do something light and not too demanding, just so long as he never goes two days in a row without studying something. Those little efforts do add up over time, so I think there's the value in his advice.", "created_utc": "1597133012.0", "edited": "False", "id": "g12yyiy", "is_submitter": "False", "link_id": "t3_i7novh", "parent_id": "t3_i7novh", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Relatable!", "created_utc": "1596858230.0", "edited": "False", "id": "g0r8bjn", "is_submitter": "False", "link_id": "t3_i57694", "parent_id": "t3_i57694", "score": "1", "subreddit": "Tokyo", "subreddit_id": "t5_2r812"}, {"author": "okayamerican", "body": "100% agree with both recommendations!", "created_utc": "1596613018.0", "edited": "False", "id": "g0f7hkl", "is_submitter": "False", "link_id": "t3_i3t3je", "parent_id": "t3_i3t3je", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "The first thing I ever read in French was a really crappy romance novel. The plot and language were all very simple, so it was easy to follow. Harry Potter is also a good option, though a little more difficult. I read through all of the Harry Potter books in Spanish, looking up every single word I didn't know and putting it into Memorise, and for me that was a huge breakthrough. I had studied Spanish in high school and college for years without ever feeling competent in the language, and that sort of \"unlocked\" the language for me.", "created_utc": "1596579233.0", "edited": "False", "id": "g0ds3ob", "is_submitter": "False", "link_id": "t3_i3jdxv", "parent_id": "t3_i3jdxv", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "Yeah, I know that conjugation and tense aren't the only ways grammar manifest, thanks. Also, by the way, you don't have to be an asshole.\n\nI'm obviously not saying Mandarin is an \"easy\" language to learn, but I'm saying that the grammar isn't the most difficult aspect of it. To give an example: if you wanted to say \"My mother gave me a big cookie\" in German, you would have to choose the correct form of the word \"my\" based on gender and number, verb tense for \"give\" the right case for \"me,\" and choose the correct adjective ending for \"big\" based on the number and gender of \"cookie.\" That isn't a very high-level, formal, academic sentence, but it requires a LOT of grammar knowledge to execute correctly, and you'll have to study a lot to get to that level. Saying that exact same sentence in Mandarin doesn't require that much forethought.\n\nThat doesn't mean that EVERYTHING about Mandarin grammar is simple, but it's actually not actually a controversial statement to say that English speakers have an easier time learning Mandarin grammar than a lot of European languages that are more closely related to English. \n\nI'm also saying this from my PERSONAL experience as someone who has studied Mandarin and found the grammar to be easier to learn than German, Spanish, or French.", "created_utc": "1596434615.0", "edited": "False", "id": "g06kpjl", "is_submitter": "False", "link_id": "t3_i29b8x", "parent_id": "t1_g064rm5", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Yeah, actually Mandarin grammar IS easier to use than English. That doesn't mean Mandarin is less rich or can't express complex ideas, but not having conjugation or tons of overcomplicated tenses does make it easier to learn. I absolutely love Mandarin grammar: no noun gender, no complicated rules of agreement, no verb conjugation: it all feels very intuitive and stripped down to the necessities. When I was learning Mandarin, grammar was the thing I had to focus on the least. Not true for when I've studied Spanish, French, German (!!! Oh my God !!) or Japanese.", "created_utc": "1596408618.0", "edited": "False", "id": "g05gfh5", "is_submitter": "False", "link_id": "t3_i29b8x", "parent_id": "t1_g054vti", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Can you leave your rural area one day? Like, are you a high school student or are you an adult who has chosen to stay there and can't easily pack up and leave?\n\nA lot of people told me learning French was useless, and now I work for a French company in Tokyo. I have the best job I've ever had because I speak French. There probably aren't many French people in a rural area, but many major cities have a French community of some kind. Check Meetup to see if there's something a reasonable drive away. You can also use the Internet to talk to French people if that will motivate you. With that being said, if you feel passionate about it, that's reason enough to keep learning. It's normal to go through phases where you doubt your reasons for learning and want to give up-- just take a break. Maybe study something else you are interested in, and then come back to French after a while.", "created_utc": "1596179326.0", "edited": "False", "id": "fzu8py0", "is_submitter": "False", "link_id": "t3_i12zov", "parent_id": "t3_i12zov", "score": "25", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "I haven't really used any of the language pod websites because their interface confuses me, so I don't really know. There are a lot of free resources available for French listening, though. I don't think it's necessary to spend money on FrenchPod personally.", "created_utc": "1596150303.0", "edited": "False", "id": "fzsv85j", "is_submitter": "False", "link_id": "t3_i07pvm", "parent_id": "t1_fzqyr6a", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "I think the biggest benefit of reading something that hasn't been translated is that you learn culture along with language, and that could go a long way toward better understanding what people are talking about in your target language. That could range from a particular bureaucratic procedure in a French government office to the way a particular subculture speaks in Mexican Spanish; things that might not exist at all in your culture or that might have different nuances in your target language. A lot of those things are not really translatable and wouldn't otherwise be possible to experience without living in another country. I think that's one of the reasons comedy in another language can be so difficult to understand: there's a lot of context that's required, and you need a lot of exposure to things created in the target culture before you can understand it.\n\nWith that being said, I think it also depends on your motivation and level. If you're still a beginner, the added burden of understanding new cultural elements could slow you down and confuse you. And if you're not a big reader or not very motivated to read in general, it will be important to find something you really want to read, which might be a popular series translated from English. Finding \"fun\" reading materials in another language can sometimes be difficult because it's usually the \"great literature\" that's easy to find in lists or in local bookstores (without having to make a special order). So I think for most people, reading widely is more important that what you actually choose to read, even if reading things from the target culture does give you an added bonus.", "created_utc": "1596099811.0", "edited": "False", "id": "fzpndvn", "is_submitter": "False", "link_id": "t3_i0brui", "parent_id": "t3_i0brui", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Unless there have been major changes since I last used it, KwizIQ is just for improving your grammar. It's not going to help much at all with listening or speaking skills. FrenchPod will be better for that.", "created_utc": "1596098888.0", "edited": "False", "id": "fzpmh3r", "is_submitter": "False", "link_id": "t3_i07pvm", "parent_id": "t3_i07pvm", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "Real talk: you can't do much at all with just a language degree, especially if your languages are Korean or Japanese.\n\nIf you're an American and you learn Spanish, French, or German, you could possibly find work teaching the language. Especially Spanish (French and German programs are being cut all the time). As a Spanish speaker, there are also some good opportunities working as a bilingual teacher in elementary schools. But you will need to also take education classes and get a teacher's certification. The language alone wouldn't be enough.\n\nFor Korean and Japanese, teaching isn't really an option. There might be a few posts here and there, but they'll be very rare. You could find some translation work if you're lucky, but that generally won't pay very well unless you can pair it with a technical skill such as engineering, medicine, law, etc. Translation work does exist, but it's not as lucrative as many people believe, especially if you don't have a technical writing degree or other skills.\n\nIf you want to get a Ph.D. in the language, you have some options teaching and doing research at the university level, but that's a commitment of 10+ years, it isn't for everyone, and jobs in academia are cutthroat and few and far between as well.\n\nMy advice is to double major. If you're really passionate about Korean or Japanese, then go ahead and study them and do your year abroad. There are lots of opportunities to teach English in Japan and Korea, so you could spend more time there, improve your language skills, and really become fluent while earning a decent living. But you will need an additional skill to get a more long-term job (and you shouldn't make the mistake of considering English teaching a long-term job unless you're willing to get additional degrees and certifications). Your language skills will be a HUGE bonus if you study something such as business, but on their own they won't do much for you at all.\n\nI currently live in Tokyo, and there are plenty of job opportunities here for foreigners who speak Japanese and English IF they have other skills. If I had to do it all over again, I would have studied software development in college. People who do that can live pretty much anywhere they want in the world because there's a major demand. If you speak Japanese or Korean and have that kind of technical background, you'll have tons of opportunities.", "created_utc": "1595936903.0", "edited": "False", "id": "fzi578m", "is_submitter": "False", "link_id": "t3_hzc72t", "parent_id": "t3_hzc72t", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Hello,\n\nI have similar issues. To be totally honest, I'm not actually that interested in SPEAKING languages. I don't really enjoy meeting new people that much, and I'm more interested in reading books and watching videos in my target language. Depending on your needs, that's totally valid. Lindie Botes has an interview about this topic that really helped me feel more comfortable with accepting this about myself: [https://www.youtube.com/watch?v=vAYM5rrLwnQ](https://www.youtube.com/watch?v=vAYM5rrLwnQ)\n\nThat being said, sometimes you NEED to speak a language (to pass a proficiency exam or for work, travel, etc.). If you really want to improve your speaking skills without having to meet a bunch of random people, I think it can totally be done. These are my tips for socially anxious language learners from most anxiety-inducing (#1) to least (#3).\n\n1. For me, talking to a tutor on iTalki (or similar sites) makes me less anxious than talking to language exchange partners. I think it's because I'm actually paying someone, so the pressure  I feel (due to anxiety) to be interesting or cool or whatever is gone. They're getting something from the conversation (i.e. my money) no matter what. If I'm boring or they can't understand me or I say something really stupid that insults seven generations of their family, at least they're still getting paid. Tutors are also almost universally kind and patient people who do their best to make you feel comfortable. If I'm talking to strangers, that's always more difficult (especially since one of my target languages is French and French people can be really intimidating!). That being said, even talking to tutors can make me anxious sometimes, and the cost can add up. Which is why I recommend...\n\n2. Record yourself speaking. You can achieve a pretty high level of passive knowledge through a lot of input and vocabulary study, but that doesn't always transfer automatically to speaking (despite what some people like to claim). The problem is usually that you can understand what other people are saying, but you can't find the words or the grammar to say what you need to when it's your turn to talk (you have passive, not active knowledge). But you can practice making this knowledge active without necessarily having another person directly in front of you. Just give yourself some topics and make a recording of yourself talking for a certain amount of time. You could also prepare in advance by looking up some words you know you will need beforehand so you don't struggle as much when it comes time to speak. Honestly, this can be a lot MORE effective than having an actual conversation because you have time to stop and think and prepare. Obviously you can't do that in a \"real\" conversation, but with enough practice actively speaking, that problem will go away because you've taken your passive knowledge and made it active. \n\nA lot of people recommend talking to yourself throughout the day, which is great, but a recording helps you to go back and analyze problem areas, get help when you run into trouble, and track your progress. After a month of recording yourself talking, you can go back to your first video and see how you've changed; this is great for a higher level because often the changes happen too slowly for us to realize them and we become demotivated. If you can post your video on YouTube or a website like HiNative to get feedback on pronunciation, grammar, etc., that's ideal. It's much less pressure than a live conversation, and you can still get your corrections that way. If posting a recording makes you too anxious, I still think you can make a lot of progress just by forcing your brain to actively pull up the vocabulary you need to use (especially if you're getting a lot of input).\n\n3. If opening your mouth to speak still makes you too anxious, you can still improve your speaking skills by writing. Just like reading can help your listening skills and vice versa, writing and speaking are both output and are complementary. So you can practice responding to writing prompts, journaling, etc. You will still need to move your mouth to develop the muscle memory for pronunciation, so you should also read aloud what you wrote (and preferably record it so you can listen to it). Again, asking native speakers to correct your writing (or recording) will also help.\n\nI really think it's possible to be decent at speaking without having to have a ton of conversations with strangers. In fact, sometimes talking to strangers is a waste of time because it takes a lot of work to find someone you enjoy talking to who can actually help you with problem areas. And you have to get past the initial phase of \"where are you from, what do you like, how old are you, etc.\" which becomes redundant really quickly. And if it's a language exchange, half of your time is spent in English, so that also takes away time from using your target language.\n\nHonestly, if you have social anxiety, speaking will probably always be your weakest skill no matter what (it is for me), but that's okay: everyone has their individual strengths and weaknesses. For example, I've met English language learners who have a LOT of confidence and will talk to anyone even though their grammar is a mess and sometimes it's difficult to understand what they are trying to communicate. A lot of them will continue making the same mistakes for years and years because they never study grammar and never read in the language. I think that's totally valid if it serves their purpose. And if you prefer to read and study grammar and you don't speak so well, that's also totally valid as long as you're able to do what you want to do with the language.", "created_utc": "1595749911.0", "edited": "False", "id": "fza7bnt", "is_submitter": "False", "link_id": "t3_hy1x3z", "parent_id": "t3_hy1x3z", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I live in Japan, so that's why I'm learning Japanese. I can tell you that there are a LOT of opportunities here for foreigners, and Japan is increasing the number of foreign workers they are allowing in to work. The economy here might not be the most vibrant, but it's still the third largest in the world, and there are people here from everywhere opening businesses, advancing in their careers, and enjoying the safety and high quality of life here. It's a great place to live, especially for kids (I have a two year old daughter). I wouldn't want to raise her in China, frankly, and I think we have a better life here than we did in the US. So learning Mandarin wouldn't have been useful (it's actually what I was studying before I got this job), and learning Spanish wouldn't help me find a job in a country where I would make much money (I already speak Spanish and have looked at opportunities in Mexico).\n\nI had some of the same misconceptions about weeaboos before I came here, and I can tell you that there's some truth to that, but it's not the whole story. Yeah, there are a lot of foreigners here who are obsessed with anime, but there are also plenty of us who aren't. I'm not, the majority of my coworkers are not, and actually I don't meet many people who are (I guess they stick together somewhere else). You didn't mention anything about Japanese culture except otaku stuff. Japan is full of interesting history, art, literature, cinema, beautiful nature...it's not hard to find something for anyone. I live in Tokyo, the largest city in the world.\n\nAlso, what exactly is the point of questioning someone's desire to learn a language in the first place? If someone wants to learn Old Church Slavonic or Cherokee, good for them! And if people like anime, good for them too. I'm not going to question what gives someone joy when this world is already so full of misery.", "created_utc": "1595628886.0", "edited": "False", "id": "fz4z5mu", "is_submitter": "False", "link_id": "t3_hjg9uu", "parent_id": "t3_hjg9uu", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "The course I took didn't meet live (I mean, no Zoom meetings or anything), which is why they don't have meeting times. We had a syllabus with deadlines to submit voice recordings and homework, but no chance to practice conversation or listening skills aside from what the textbook provided. That was my biggest problem with the course, especially since I wasn't sure about my pronunciation. My teacher would send feedback, but it was written feedback, so it wasn't that helpful tbh. The course is good for giving you structure and keeping you on track with a study schedule, but not a great fit for everyone.", "created_utc": "1595576870.0", "edited": "False", "id": "fz2j2dt", "is_submitter": "False", "link_id": "t3_hwscib", "parent_id": "t1_fz1nafv", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "Oh they had Korean too--- almost forgot.", "created_utc": "1595554148.0", "edited": "False", "id": "fz1m2t2", "is_submitter": "False", "link_id": "t3_hwscib", "parent_id": "t3_hwscib", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I took the first semester of Mandarin through Dallas County Community College District. I don't know if non-residents Of Dallas can take their courses, but they offered Mandarin, Japanese, German, French and Spanish (maybe Italian and Russian too?) online even before the pandemic. If you are taking beginner and intermediate level courses, local community colleges are definitely more cost-effective than universities if you're in the States, but not always going to offer a wide selection of languages.", "created_utc": "1595554110.0", "edited": "False", "id": "fz1m0kr", "is_submitter": "False", "link_id": "t3_hwscib", "parent_id": "t3_hwscib", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "I've had way more success with language learning than with going to the gym- haha. Maybe for me, reversing your statement will help me achieve more: going to the gym is like language learning 😂😂😂", "created_utc": "1595553682.0", "edited": "False", "id": "fz1la5y", "is_submitter": "False", "link_id": "t3_hwbfcr", "parent_id": "t3_hwbfcr", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "When I read or watch TV shows in my target language, it's always really difficult at first. Even if you know the context, you won't know a lot of the vocabulary, and it's a struggle. When I start something in Spanish or French, I usually feel demoralized at the beginning because I have to go slowly and look up a lot of words. After some time, though, those words and ways of speaking are repeated again and again, and I can usually zoom through the last 75% of the book or show. Each book or series has its own unique set of words that will be important, so that's a big stumbling block at the beginning. That might be all this is. Or maybe not!", "created_utc": "1594460445.0", "edited": "False", "id": "fxn6m9s", "is_submitter": "False", "link_id": "t3_hp6jwk", "parent_id": "t3_hp6jwk", "score": "27", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "The Sims in French was super helpful!", "created_utc": "1589783543.0", "edited": "False", "id": "fr04k42", "is_submitter": "False", "link_id": "t3_glr6ta", "parent_id": "t3_glr6ta", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "okayamerican", "body": "😂😂😂", "created_utc": "1589783470.0", "edited": "False", "id": "fr04h2o", "is_submitter": "False", "link_id": "t3_glfvd9", "parent_id": "t3_glfvd9", "score": "2", "subreddit": "rance", "subreddit_id": "t5_2um6i"}, {"author": "okayamerican", "body": "Oh nevermind, just saw that you listed the video, and it's not her. She's really funny, though- on YouTube. I leaned a lot of slang from her haha", "created_utc": "1589783387.0", "edited": "False", "id": "fr04dj9", "is_submitter": "False", "link_id": "t3_glvz3u", "parent_id": "t3_glvz3u", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "Do you use WordReference.com? It's a really good translation dictionary that includes a lot of slang terms, including débauche. And if it doesn't have a word you need, there are active forums where you can ask for help. Just a tip! As for the word, it's kind of like debauchery in English. She probably means a party, but it could also mean \"orgy\" or any kind of party that's kind of wild. Is this from Marie s'infiltre by the way? Cause it sounds like something she would say.", "created_utc": "1589783324.0", "edited": "False", "id": "fr04axw", "is_submitter": "False", "link_id": "t3_glvz3u", "parent_id": "t3_glvz3u", "score": "1", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "okayamerican", "body": "I came here with the same question, and I think I've figured it out. In the subtitles, the word is written in italics. Since the director's name is Gabor Rajevsky (or something) and he doesn't speak much, I'm guessing he's not French, and \"outjet\" is a word in his first language, which they all repeat.", "created_utc": "1491678983.0", "edited": "False", "id": "dg08is9", "is_submitter": "False", "link_id": "t3_5lgj6x", "parent_id": "t3_5lgj6x", "score": "3", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}]