[{"author": "OpinionBeneficial864", "body": "Bem vindo ao clube, amigo. Eu desisti de apps, também acho um ambiente tóxico e nojento. Tô esperando dar sorte de cruzar o caminho de alguém que eventualmente demonstre interesse. Sim, é MUITO difícil encontrar outros caras foras de apps ou ambientes de festas/baladas/bares nichados. Tenho a impressão que 90% dos gays/bissexuais na rua e no dia-a-dia simplesmente desistiram de flertar ou de ir falar com outros caras. Recebo olhares, vez ou outra tem caras relando em mim dentro do ônibus, já ouvi coisas que possivelmente eram indiretas, etc. Mas como já tive experiências muito frustrantes anteriormente (de eu achar que estava lendo alguma intenção e quando cheguei na pessoa, o cara era 'hétero'), eu tendo a ficar na minha até alguém dizer com todas as letras que tem interesse por mim. Eu sei que é 99% provável que eu vá morrer sozinho me comportando desse jeito, mas até lá, vou curtindo minha solitude e que se foda o mundo e sua hipocrisia/homofobia.", "created_utc": "1666898509.0", "edited": "False", "id": "iu1085t", "is_submitter": "False", "link_id": "t3_yenvw3", "parent_id": "t3_yenvw3", "score": "2", "subreddit": "arco_iris", "subreddit_id": "t5_frznt"}, {"author": "OpinionBeneficial864", "body": "Não sou médico nem nada mas acredito que seu problema seja o refluxo mesmo. Devo assumir que não entendo a lógica entre 1) \"a parede do meu esôfago está queimando porque estou com refluxo - leia-se: ácido do estômago destruindo o epitélio do meu esôfago\" e 2) \"vou tomar vinagre de maçã - substância fortemente ácida - para melhorar.\" É recomendação médica ou crendice de leigos?\n\nDe toda forma, eu imagino que o ataque do ácido gástrico proveniente do refluxo é o que está destruindo suas barreiras imunológicas, aí qualquer microorganismozinho safado que estiver perambulando ali pela sua garganta facilmente acha um canal para se proliferar. Procure um gastroenterologista, talvez você precise de cirurgia para resolver esse problema de refluxo.", "created_utc": "1666783953.0", "edited": "False", "id": "itucjwr", "is_submitter": "False", "link_id": "t3_ydnq0t", "parent_id": "t3_ydnq0t", "score": "3", "subreddit": "arco_iris", "subreddit_id": "t5_frznt"}, {"author": "OpinionBeneficial864", "body": "Interpretação 1 - Meu namorado é um machista escroto punheteiro que acha que só ele tem direito a consumir pornô e eu não.\n\nInterpretação 2 - Minha namorada é um ser escroto e que gosta de me irritar porque eu SEI que ela não curte pornô e mesmo assim ela está baixando as fotos só para me cutucar. Ela não entende que, diferentemente dela, eu realmente APRECIO o pornô, acredito que isso não seja um problema e gosto de ter minha liberdade para assistir respeitada.\n\nInterpretação 3 - Mesmo eu demonstrando abertura para fazer de TUDO com ele na cama, meu namorado não tem mais interesse sexual em mim e eu ainda não percebi que, portanto, devo terminar esse relacionamento.\n\nDiscordo de todos os comentários moralistas dizendo que pornô é um problema/desvio. Acredito que tudo que for conversado e combinado entre o casal é válido e sei de outros casais em que um (ou os dois) tem a liberdade de assistir um pornôzinho garantida e ninguém se fere por isso.\n\nUm problema real que você relata é ele não estar satisfazendo as suas necessidades sexuais. Também acho que vocês dois são imaturos e não sabem conversar um com o outro. Nesse caso, acho que a melhor alternativa é tentar explicar essa sua frustração, tentar fazer ele te entender através do diálogo ao invés de irritar. Se não resolver, é só mais um pé na bunda mesmo. Sinto muito.", "created_utc": "1666782601.0", "edited": "False", "id": "ituah1f", "is_submitter": "False", "link_id": "t3_ydpuki", "parent_id": "t3_ydpuki", "score": "1", "subreddit": "relacionamentos", "subreddit_id": "t5_vp2cd"}, {"author": "OpinionBeneficial864", "body": "Acho que tô no sentido reverso (gay a vida toda mas...), hoje andei assistindo uns pornô de bissexuais aqui tá me fazendo perceber que quando tem só os caras eu não curto, se tem uma mina é 1000% melhor... Não sei se tô me descobrindo bissexual tardiamente... Meu Deus, o que colocaram na minha água...", "created_utc": "1666398792.0", "edited": "False", "id": "it9wupp", "is_submitter": "False", "link_id": "t3_ya5jnn", "parent_id": "t3_ya5jnn", "score": "2", "subreddit": "sexualidade", "subreddit_id": "t5_29k2vv"}, {"author": "OpinionBeneficial864", "body": "Vou falar dos que eu já li:\n\n\"1984\", \"A Revolução dos Bichos\", \"O Senhor das Moscas\" --> para falar de qualquer coisa sobre sociedade e política.\n\n\"O mundo assombrado pelos demônios\" --> para falar de qualquer assunto relacionado a ciência. E recomendo esse livro para quem não está fazendo ENEM também, melhor livro que eu já li na vida.\n\n\"O retrato de Dorian Gray\" --> para falar sobre beleza, padrões ou ética.\n\n\"Sapiens\", \"Homo Deus\" e \"21 Lições para o séc. XXI\" --> para falar sobre qualquer tema. Yuval Noah Harari é um dos melhores autores para estudar para o ENEM, porque ele fala sobre variados assuntos que a prova ama.\n\n\"O mundo de Sofia\" --> para falar sobre Educação e se interessar mais sobre filosofia (para poder entender e citar os filósofos).\n\n\"O sol nasce para todos\" --> para falar sobre preconceito.\n\n\"Sobre ratos e homens\" --> livro pequenino mas MUITO bonito, e para falar sobre pobreza, ignorância e exploração do trabalhador.\n\n\"O velho e o mar\" --> só para se emocionar com a beleza da vida. Mas se o tema for meio ambiente/ecologia, acho válido também.", "created_utc": "1666216077.0", "edited": "False", "id": "iszqi6v", "is_submitter": "False", "link_id": "t3_y8begu", "parent_id": "t3_y8begu", "score": "10", "subreddit": "Livros", "subreddit_id": "t5_2tlr4"}, {"author": "OpinionBeneficial864", "body": "Lately I've been thinking, this whole objectification/dehumanization in gay 'culture' is just the way these apps reproduce capitalism in our psyche. I used to spend weeks trying to think about how I would make my \"profile\" more attractive and interesting, only to receive the same kinds of message. Many guys have become used to this bullshit, some of them even idolize it and they get mad every time they see someone who hasn't. It was then I realized how this whole thing is completely unnatural and bad for my mental health. And do you think the companies behind these apps care about your well being? They WANT you to be frustrated, that's the only way you'll keep looking for them. I'm out of the apps for good. Might be harder to meet someone IRL, but it's for sure much less complicated and depressing.", "created_utc": "1666186206.0", "edited": "1666186520.0", "id": "isxmwo0", "is_submitter": "False", "link_id": "t3_y7xemy", "parent_id": "t3_y7xemy", "score": "14", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "Acho vocês lindxs e gostosxs, parabéns, continuem assim!", "created_utc": "1666185526.0", "edited": "False", "id": "isxlgzk", "is_submitter": "False", "link_id": "t3_y7rfrd", "parent_id": "t3_y7rfrd", "score": "10", "subreddit": "BeloHorizonte", "subreddit_id": "t5_2wzzf"}, {"author": "OpinionBeneficial864", "body": "Ears, nose, lips, eyes, eyebrows, hair, neck... pretty much all of a guys' face/head. Adam's apple also nice, as you've already mentioned. If I had to pick one, though, I would say ears. I love Dumbo guys.\n\nAlso not sexually related: for some reason I start paying attention to a guy's hands and feet when I am falling in love with them.", "created_utc": "1666103867.0", "edited": "False", "id": "ist39p8", "is_submitter": "False", "link_id": "t3_y74jgc", "parent_id": "t3_y74jgc", "score": "6", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "É normal estar perdido na vida nessa idade, mesmo entre quem já trabalha e faz/fez faculdade/é casado/tem filhos. Não há motivo para tanto desesepero. Respira, vai com calma, tenta pensar em outras possibilidades que você anda ignorando ou esquecendo. Você não faz a menor ideia do que pode aparecer no seu caminho e mudar sua vida.\n\nVocê tem que se perguntar porque você é dependente de videogame (não, você não *gosta* de videogame; gostar de uma coisa não te faz ficar sem horizonte na vida). Várias pessoas aqui já te deram sugestões de empregos que você pode procurar, se a questão financeira é o que está mais te colocando contra a parede nesse momento. Tenta alguma coisa, nem que seja temporariamente. Enquanto isso, coloca na cabeça que você precisa ter sonhos e planos com coisas que trazem melhorias de vida para você, coisas que você faria apenas por **você**. Não se compare com os outros. Não viva pelos outros.", "created_utc": "1665950604.0", "edited": "False", "id": "isl3krd", "is_submitter": "False", "link_id": "t3_y5ntsb", "parent_id": "t3_y5ntsb", "score": "1", "subreddit": "desabafos", "subreddit_id": "t5_395lw"}, {"author": "OpinionBeneficial864", "body": "I find it depressing that you had to ask that, because me too, I am immensely turned off by anything that gets close to suffering/humiliation/domination/submission. I don't judge people who like these things though, because I understand we can't control our fetishes (I for one, get super turned on by guys wearing sleeveless shirts or wearing nothing but socks - no idea where that comes from).\n\nBut it is sad because I know the feeling. So many people like these things that seem bizarre to us that we feel weird. 90% of the porn on the net makes absolutely no sense to me, sometimes I have to spend hours to find something that gets me off. But I'm pretty sure there are a lot of guys (not just bottoms) who like vanilla stuff, they just aren't as vocal about it.", "created_utc": "1665940467.0", "edited": "False", "id": "iskcjd1", "is_submitter": "False", "link_id": "t3_y5jzko", "parent_id": "t3_y5jzko", "score": "8", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "At least now he's out of that shithole. I hope the toxicity of the gay community doesn't kill him and that he can live a long and happy life to fulfill his dream.", "created_utc": "1665866778.0", "edited": "False", "id": "isgl1kg", "is_submitter": "False", "link_id": "t3_y4setn", "parent_id": "t3_y4setn", "score": "5", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "I don't share the experience of many people who say that it is painful. Maybe these people have really tight holes or they contract sphincter as soon as something touches it (the classic mistake of a beginner). It can be uncomfortable, though, because you feel like you're shitting in reverse (instead of getting relief from the poop getting out of you, imagine the opposite). Once you get used to the weird sensation and start ignoring it, there is where the good part begins. I'd say that having a dick touch your prostrate is akin to the feeling of someone sucking just the head of your dick (really intense sensation), only that it irradiates to all of your pelvis. If the guy fucking you knows what he's doing, thrusting the right spot in a fast and even motion, it's gay heaven. You will cum with a soft dick and the pleasure will last much longer.", "created_utc": "1665865757.0", "edited": "False", "id": "isgimxc", "is_submitter": "False", "link_id": "t3_y4hq6t", "parent_id": "t3_y4hq6t", "score": "1", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "My life has always been complicated. I've tried to kill myself twice. After the second attempt, I was taken to a psychiatric hospital against my will... That was the lowest point in my life. What helped me was (very important: in this exact order): 1) Going to a different doctor, one who was humane, who talked to me and who prescribed me the right medicine. 2) Having the support of some very special people in my family. I didn't know it back then, but now I've realized that most of them were never nice people. However, the ones that are have helped me beyond words I can thank them for. 3) Finding out what type of occupation would make me happy/important/fulfilled. 4) Aligning my expectations. 5) Dedicate time to make plans and think of how I'd like my future to be. 6) Started doing Pilates and fell in love with it.\n\nMind you that all this happened from 2016 to 2022 - with the pandemic wreaking the world, people dying left and right, a fascist corrupt president ruining my country, and recently I discovered that I am diabetic type 2. Things haven't been exactly \"fun\" and \"positive\", but I've managed to go through it all. I couldn't believe it (and I think most of my family and people I know weren't counting on it either). The sad part is that I haven't touched a guy since 2016. It is like for that time I killed my desire for real men. Porn was enough for me. But you know what? Thank God there are more important things in life. If I didn't realize that, then yes, I'd be feeling miserable right know. I definitely don't want to take my own life because of it. I know that the possibility of hooking up/finding someone isn't out of the menu yet. In addition, I have bigger things to look forward to.", "created_utc": "1665281940.0", "edited": "False", "id": "irl4d0z", "is_submitter": "False", "link_id": "t3_xymfpu", "parent_id": "t1_irl0fxb", "score": "1", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "Do not put all the focus of your life on sexual/romantic things and/or being attractive to others. Sure, those things matter, but you should have other PERSONAL plans/goals (things that involve just you, depend just on you, matter just to you). Me too have been depressed since 18 and for most of my adult life. I only broke that vicious cycle when I started to focus my energy on making plans about things that mattered to me (like getting a degree to work in a profession that I am passionate about or drawing the floor plans of my perfect future home, etc.). I don't care if my plans are delusional and I might die tomorrow without seeing any of it become true. The simple fact that I have these dreams, that they aren't impossible to achieve, and that I don't depend on anyone/anyone's opinion to achieve them helps me get motivated to do all the other things (like diet, going to the gym, etc.). I have a future to look forward to even if I fail at becoming the best version of myself (for others to feel attracted to).", "created_utc": "1665266051.0", "edited": "False", "id": "irk7r7a", "is_submitter": "False", "link_id": "t3_xymfpu", "parent_id": "t1_irih4ye", "score": "2", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "It isn't the end of the world if it happens, but it is a shitty situation to be in (=D). I hope you were wearing a condom at least, otherwise I fear you may have an infection from poop bacteria entering places they shouldn't.", "created_utc": "1665167687.0", "edited": "False", "id": "irflr18", "is_submitter": "False", "link_id": "t3_xy2zvn", "parent_id": "t3_xy2zvn", "score": "-1", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "I girl can go kill herself working out; she'll never have a sexier butt than a guy.", "created_utc": "1665004753.0", "edited": "False", "id": "ir7bfii", "is_submitter": "False", "link_id": "t3_xvwem5", "parent_id": "t3_xvwem5", "score": "2", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "Some variations of British English are very hot, though I can't say which ones specifically. I also love hearing Korean, but that may come from watching Korean movies.", "created_utc": "1665004478.0", "edited": "False", "id": "ir7arar", "is_submitter": "False", "link_id": "t3_xw0qep", "parent_id": "t3_xw0qep", "score": "1", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "Nope and I can't understand the concept. It doesn't turn me on nor does it interest me. I don't like opening the present before the party. I don't like the risk of it falling in the wrong hands either. Yes, it makes me feel very alienated in the gay community.", "created_utc": "1664834699.0", "edited": "False", "id": "iqxvy2e", "is_submitter": "False", "link_id": "t3_xuu9r5", "parent_id": "t3_xuu9r5", "score": "16", "subreddit": "AskGaybrosOver30", "subreddit_id": "t5_3lpko"}, {"author": "OpinionBeneficial864", "body": "He used you as an object, that is clear to me. Maybe what was making his dick soft was your actual human presence there, reminding him all the time that you were not just an object.", "created_utc": "1664832387.0", "edited": "False", "id": "iqxqfc2", "is_submitter": "False", "link_id": "t3_xuujfc", "parent_id": "t3_xuujfc", "score": "3", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "Of course, and they justify that with the player character being Dragonborn. That's why I think actual illusory effects (messing with the senses) would be much more interesting, because the enemies could use it against the player and with a little bit of programming we could have the NPCs react accordingly to the same spell if it was the player casting it against them.", "created_utc": "1664829731.0", "edited": "False", "id": "iqxjr0n", "is_submitter": "False", "link_id": "t3_xtx96x", "parent_id": "t1_iqw3f1m", "score": "1", "subreddit": "TESVI", "subreddit_id": "t5_2umdu"}, {"author": "OpinionBeneficial864", "body": "1. I have the same problem with illusion and more: why can't NPCs cast those spells on us? AH, because we have dragon blood, we're dragonborn. Ok, so why can't they do it to other NPCs? --- silence --- So, instead of those lame and overpowered effects (Fury/Fear/Calm), what I wish they did for the next game is to make REAL Illusion spells, like making yourself or NPCs look different (magic disguises), make you or NPCs see things that aren't real, blinding spells, deafening spells, disorientation spells (make your senses deceive you), manipulation of light and sounds, maybe even smells. Spells that trick the mind have IMMENSE potential, Bethesda was just not really creative in Skyrim.\n2. Agree, but it should be very carefully balanced (and NPCs should have access to different, customized spells as well).\n3. Disagree, I HATE to spend more time going through menus than playing the game itself. I think it is good as it is in Skyrim.\n4. Agree, even though I hate the Companions' questline and the fact that joining Harkon's plan to overtake Tamriel wasn't a possibility. Do not force me to save the world if I chose the \"evil\" faction.\n5. Arguable. I wouldn't mind it if they made a completely different skill system though.\n6. Yes, but I would like to have them separated, being Athletics more related to Warrior characters and Acrobatics more related to Stealth characters.\n7. Wouldn't hate it if this existed, but I'm indifferent to it.\n8. Yes, but this would be so hard to put on the game (so many variables and coding) that I think it is unrealistic to expect something like that.\n9. Agree, but you know what would be even better? Removing that boring, repetitive minigame from the game altogether.\n10. Agree.\n11. Agree 100000%.\n12. Or just make workarounds/different consequences if the player chooses to do something like that.", "created_utc": "1664747543.0", "edited": "1664747737.0", "id": "iqt2oke", "is_submitter": "False", "link_id": "t3_xtx96x", "parent_id": "t3_xtx96x", "score": "5", "subreddit": "TESVI", "subreddit_id": "t5_2umdu"}, {"author": "OpinionBeneficial864", "body": "I'm not against it, I like being both top/bottom, but surely sex without penetration can also be amazing (and is more practical IMO).", "created_utc": "1664746264.0", "edited": "False", "id": "iqszfe9", "is_submitter": "False", "link_id": "t3_xty772", "parent_id": "t3_xty772", "score": "1", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "I do but it can be problematic depending on the guy. I don't think that it is a problem if the guy doesn't stop and is ready to do it again. I've had one guy that came four times in the same night. It was spectacular.", "created_utc": "1664745465.0", "edited": "False", "id": "iqsxdjx", "is_submitter": "False", "link_id": "t3_xtu772", "parent_id": "t3_xtu772", "score": "5", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "I am just like you, but maybe not because I'm uncomfortable taking the picture, it's just that I'm afraid its going to end up in the hands of the wrong people. And no, not showing your face on the picture does not guarantee that other people won't recognize other parts of your body that aren't your face (especially people from your family).\n\nThe solution to that is that often guys just take a picture of their dick from really up close. And right there the \"nude\" thing just loses all its meaning to me. I can't feel any attraction for a dick if it's decontextualized from the rest of the body. For example, I hate porn that cuts the guy's face out of the frame and just focuses on the dick. Sometimes I suspect that it is because I have studied Anatomy in college, so seeing \"disjointed\" parts of the human body is something that just turns me off automatically...\n\nMost guys love seeing just the dick though, some even prefer to have the rest of the body out of the picture. I can't understand that. These guys always make me think how people can be so different in regards to sex... Alas, if they can't turn me on by showing me pics of their dicks, they have nothing that they can offer me that would have me doing that for them. I'd just feel stupid if I did. So no dick picks are ever coming from me.", "created_utc": "1664586422.0", "edited": "False", "id": "iqklqbn", "is_submitter": "False", "link_id": "t3_xrrcss", "parent_id": "t3_xrrcss", "score": "2", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "Branching, it is just better RP-wise and budget-wise (I think).\n\nWhat I really would like, though, was if they make factions after classes à la Skyrim where you have a guild for Mages, a guild for Warriors and two (?) guilds for sneaky sneakersons, I would like it if the quests actually reflected that choice. For example: you're clearly a warrior, your specced and dressed like one. That doesn't mean that the Mage's guild does not have jobs for you. You can choose to aid them (and do their quests), with the difference that they recognize you as a helper/mercenary/outsider. That would be SO much better if it were in Skyrim.\n\nThe option to join evil guilds but also to destroy them (and conversely to turn 'good' guilds into evil ones) is just as important to me.", "created_utc": "1664582859.0", "edited": "1664583226.0", "id": "iqkelcs", "is_submitter": "False", "link_id": "t3_xrn4n1", "parent_id": "t3_xrn4n1", "score": "3", "subreddit": "TESVI", "subreddit_id": "t5_2umdu"}, {"author": "OpinionBeneficial864", "body": "* Mystics. People who seriously hold on to anti-scientific thoughts and ideas in general.\n* Reckless behavior. There's a difference between that and being adventurous.\n* Too clingy and/or can't do anything by themselves.\n* Too superficial, phony and/or immature (dating apps are full of those).\n* Compulsive liars and self-aware hypocrites.\n* People who can never admit that they are wrong or mistaken. Yes, they exist.\n\nThe list goes on but I think it's just better to learn how to cope with people's flaws sometimes.", "created_utc": "1663966209.0", "edited": "False", "id": "ipn1qw7", "is_submitter": "False", "link_id": "t3_xlrj6a", "parent_id": "t3_xlrj6a", "score": "2", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "You're still super young, just keep dating other guys. Eventually you will find something that you like and makes sense to you - if not as early as you want, at least you will have memories and stories to tell. Some people don't even have that. Yes, we are not a big part of the population, so it will be harder to find someone compared to straight and bi people. Being gay is stressful, but don't let negative thoughts make you give up on who you are.", "created_utc": "1663965244.0", "edited": "False", "id": "ipmzi8t", "is_submitter": "False", "link_id": "t3_xm821p", "parent_id": "t3_xm821p", "score": "5", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "One objective reason for that is that is allows one to get more creative with positions. Other than that, it's just gay's idiotic behavior of making their already limited dating pool even more limited.", "created_utc": "1663766530.0", "edited": "False", "id": "ipbt0om", "is_submitter": "False", "link_id": "t3_xk15yk", "parent_id": "t3_xk15yk", "score": "-2", "subreddit": "askgaybros", "subreddit_id": "t5_2vgfw"}, {"author": "OpinionBeneficial864", "body": "Experiência de quem largou o curso quase completando: dentre os cursos da área da saúde, acredito ser um dos mais complexos. Digo isso pois você tem que estudar toda a parte da área da saúde (Citologia, Patologia, Fisiologia, Bioquímica, etc.) e também várias matérias de exatas (Química Orgânica, Química Analítica, Cálculo, Física), pra depois entrar em matérias particulares da área (Farmacologia, Farmacognosia, Química Farmacêutica etc) que são um inferno a parte.\n\nÉ um curso complicado porém, no final, você vai ter a oportunidade de trabalhar em diversas áreas diferentes (Hospital, Análises Clínicas, Indústria, Farmácia Popular, Manipulação, Pesquisa etc.). Não sei como se compara com outras áreas da saúde com relação a remuneração, mas eu imagino que não seja ruim. No fim eu desisti do curso porque eu percebi que gostava das matérias do ciclo básico mas quando cheguei no ciclo profissional passei a achar a profissão em si bem bosta. Não sei explicar o porquê, é só uma percepção pessoal mesmo. Se é o seu sonho estudar pra caralho pra poder vestir um jaleco e ficar atrás de um balcão, seja atendendo pessoas ou mexendo com tubinhos de ensaio, só segue em frente.", "created_utc": "1663606857.0", "edited": "False", "id": "ip33nkt", "is_submitter": "False", "link_id": "t3_xidrid", "parent_id": "t3_xidrid", "score": "3", "subreddit": "BeloHorizonte", "subreddit_id": "t5_2wzzf"}, {"author": "OpinionBeneficial864", "body": ">Well, I'm brazillian, and i don't know French, but i'll say it from a native portuguese speaker's perspective. I dont see French so much similar to Portuguese. Like, Spanish, Italian and Portuguese, if you know one of these, it will facilitate SO MUCH when you start the next one, cause they all are really very similar. French is the most different one, like in french have many sounds that i cant even dream of repeating, cause they are very hard. 😂 But, of course, there are some words that can relate to pprtuguese and i can pick up from a text and comprehend it, but isn't so easy.\n\nAs a Brazilian who has been learning French, I think the opposite. While French may indeed be the weirdest out of all Romance languages (I don't know enough Romanian to actually know which one is weirdest), it's surprising how many rules of spelling and pronunciation seem to have skipped Spain and came from France straight into Portugal (maybe by sea?). Like our R's at the beginning of words or double R's in the middle having the \"H\" sound that is closer to French R than the Spanish rolled R's; the \"ç\" in words and its sound; the way the combination of letters -CH- works in both languages, the abundance of nasal sounds that pitfalls everyone trying to learn Portuguese (but wouldn't be a big challenge for a French person). The similarities stop there that I can remember right now, but all these things are so common when you are reading/speaking that I can't stop thinking about them (not to mention the lexical similarities as well).", "created_utc": "1660959259.0", "edited": "False", "id": "il0i2ky", "is_submitter": "False", "link_id": "t3_wspith", "parent_id": "t1_il0a23u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "OpinionBeneficial864", "body": "Stealth increased to 100.", "created_utc": "1656099817.0", "edited": "False", "id": "idllwpf", "is_submitter": "False", "link_id": "t3_vjuyyf", "parent_id": "t3_vjuyyf", "score": "30", "subreddit": "AnimalsBeingGeniuses", "subreddit_id": "t5_2z6fi"}, {"author": "OpinionBeneficial864", "body": "Considering that this game is supposed to be \"Skyrim in space\", what I want is for them to improve on that game's limitations. So basically:\n\n* less buggy/broken release.\n* better combat (Fallout 4 was a step on the right direction, but they still have much room to improve).\n* smart AI that reacts to stealth properly.\n* less annoying NPCs that repeat the same line over and over again when you pass by them.\n* no \"craft 1000 \\_\\_\\_\\_\\_\\_\\_ to progress the skill\".\n* no endgame bullet sponges.\n* actual commitment to the factions you join, e.g.: if I have build my character a certain way to join a certain faction, restrict my access to other factions in some way (no pure warrior being the head of the mage faction, for instance). Instead, let me work with them as an outsider/mercenary (if their faction is not an enemy of mine). I would still be able to do pretty much all the faction quests, but at least it would not be immersion breaking.\n* balanced crafting (again, Fallout 4 improved on this a lot).\n* either improve lockpicking/hacking minigames or remove them from the game altogether.\n* smarter companions.\n* more open-ended quests - do not force me to kill an NPC I might not want to to progress a questline (Paarthurnax).\n* better writing.\n\nWhat Skyrim does not have, but I would like this game to have:\n\n* traversing skills like climbing, jumping over obstacles, crawling, using ropes and/or riding vehicles.\n* infiltration skill with a focus on impersonation, make up and/or disguises.\n* limited healing supplies (so no carrying 100 potions/stimpacks everywhere I go).\n* enemies who use stealth and play-dead tactics.\n* enemies that value their lives and try to escape/surrender/bribe you when their odds are low.\n* a wide array of non-lethal options to deal with enemy NPCs. I am tired of being a mass killer in every open world RPG game I play.", "created_utc": "1654454575.0", "edited": "1654455214.0", "id": "iba3e6h", "is_submitter": "False", "link_id": "t3_v512sy", "parent_id": "t3_v512sy", "score": "1", "subreddit": "Starfield", "subreddit_id": "t5_3g41m"}, {"author": "OpinionBeneficial864", "body": "They may be a majority among the religious; I doubt they'll (ever) be the majority in the country.", "created_utc": "1652621335.0", "edited": "False", "id": "i8oz8h2", "is_submitter": "False", "link_id": "t3_upub15", "parent_id": "t1_i8nyqja", "score": "4", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "OpinionBeneficial864", "body": "A gay version of Ryan Reynolds and our three dogs.", "created_utc": "1649080341.0", "edited": "False", "id": "i3cou0q", "is_submitter": "False", "link_id": "t3_tw1lkr", "parent_id": "t3_tw1lkr", "score": "15", "subreddit": "interiordecorating", "subreddit_id": "t5_2t8dh"}, {"author": "OpinionBeneficial864", "body": "So this is where the Tesseract ended up.", "created_utc": "1648924282.0", "edited": "False", "id": "i34x6d3", "is_submitter": "False", "link_id": "t3_tun7yb", "parent_id": "t3_tun7yb", "score": "5", "subreddit": "sciences", "subreddit_id": "t5_2r5t2"}, {"author": "OpinionBeneficial864", "body": "I think Bethesda and FromSoftware hold different conceptions for the term \"hardcore RPG\". That said, I'd love to see the enemy diversity of a FS game on a Bethesda's.", "created_utc": "1648141595.0", "edited": "False", "id": "i1yboqj", "is_submitter": "False", "link_id": "t3_tmn0ww", "parent_id": "t3_tmn0ww", "score": "7", "subreddit": "Starfield", "subreddit_id": "t5_3g41m"}, {"author": "OpinionBeneficial864", "body": "Já cantava Renato Russo: \"Você culpa seus pais por tudo. Isso é absurdo. São crianças como você. O que você vai ser quando você crescer.\"\n\nO erro, a meu ver, é achar que você só porque nasceu em uma geração posterior aos dos seus pais/tios/avós, você é necessariamente melhor ou mais inteligente que eles, que basta esperar que eles morram para vivermos num mundo melhor. Esse pensamento não passa de uma nova versão do \"nós\" contra \"eles\" nascendo. A verdade é que somos todos farinha do mesmo saco. O mesmo material humano que os constitui, nos constitui. E pior: são as pessoas mais geneticamente parecidas com a gente no mundo. Biologicamente temos uma propensão inevitável a nos tornarmos no futuro o que eles são hoje. Apenas as oportunidades e contexto de vida são diferentes. Todo o resto será ou igual ou muito semelhante.\n\nPrecisamos nos ater ao que nos difere de fato. As pessoas mais estudadas e conscientizadas sabem de cor denunciar todos os crimes e violações contra os direitos humanos cometidos na época da ditadura. São extremamente críticos de tudo que aconteceu ali (e com razão). Elas não se atentam para o fato, entretanto, de que todo esse pessoal mais velho foi educado durante essa época. Portanto, a visão de mundo deles já carrega um viés completamente errado já faz muito tempo. Na média, o brasileiro é um fruto direto da mentalidade que se prevaleceu ali.\n\nHoje os educadores fazem esforços astronômicos para tentar criar uma educação mais inclusiva, mais humana e principalmente, mais **crítica**. Mas de que adianta um professor fazer um esforço hercúleo para conscientizar seu aluno dentro da sala de aula, durante as 1\\~2 horas que passa com esse aluno por semana, se o mesmo aluno, quando chegar em casa, vai ter que ouvir pelo resto do dia a ladainha conspiracionista e descerebrada de seu pai/mãe/figura de autoridade que não teve (e continuará não tendo) oportunidade de atualizar seus conhecimentos e visões de mundo?\n\nEssas pessoas fazem parte da sociedade. Elas são uma peça integral da nossa democracia. Não dá pra só ignorar o problema e fingir que ele vai acabar uma hora. Não vai. É por isso que eu sou extremamente favorável que se crie um novo braço na Pedagogia focado na educação continuada e vitalícia. Na minha opinião o Brasil nunca sairá do buraco se a gente não começar a incentivar a leitura, o debate, o raciocínio lógico, a criticidade, as tradições de cultura e de conhecimentos científicos na população que já está fora da sala de aula há muito tempo.\n\nE vale a reflexão, pra quem tá se achando muito bonitão, \"desconstruidão\", \"inclusivxs\", \"progressista\" mas prega discurso de ódio/segregação contra essa população: se acham que o pessoal mais velho está perdido dentro de uma bolha de alienação, será que não estão (estamos) também todos presos na nossa própria bolha um pouco demasiadamente? **Autocrítica** é fundamental para o crescimento como ser humano.", "created_utc": "1648138257.0", "edited": "1648139046.0", "id": "i1y2xdv", "is_submitter": "False", "link_id": "t3_tm6sv5", "parent_id": "t3_tm6sv5", "score": "0", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Chile/Peru/Colombia - Colder climates, cities in higher altitudes, access to the Pacific Ocean.\n\nMexico - Spicy food culture.\n\nUruguay - Social development and quality of life.", "created_utc": "1647949831.0", "edited": "False", "id": "i1nerel", "is_submitter": "False", "link_id": "t3_tjrkte", "parent_id": "t3_tjrkte", "score": "11", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "OpinionBeneficial864", "body": "* Huge variety in enemies (we're supposed to be visiting different planets, so the least they could do is give each planet its own flora and fauna). The one thing I appreciate in Souls games is how varied and complex their enemies are, I hope Bethesda took some notes from that.\n* Vehicles (or some sort of rapid land transportation, even better if they can be upgraded to unlock new forms of exploration and massive laser-shooting cannons). Thematically, I expect to see lots of barren wastelands, so this type of transportation would actually be necessary.\n* Skills and/or attributes unlocking new (and relevant) dialogue options (excellent for both roleplaying and replayability reasons). Companions could also influence how conversations went, so you'd have to pick well who you take with you on your journeys.\n* A faction system where you can win or lose their trust like an individual depending on your actions throughout the whole game, unlike F4's where joining a guild makes every other faction know of your affiliation and hate you automatically.\n* Smart human enemy AI that knows how to duck, cover, hide, ambush, set traps, and cooperate. The same must apply for companions.\n* Realistic portrayal of aliens, if they're ever to show up in this game. No blue humanoids please. Actually, no anything humanoids please.\n\nI had a lot of other ideas, but this last presentation has assured me that we're going to see them.", "created_utc": "1647455521.0", "edited": "1647455740.0", "id": "i0wzwoy", "is_submitter": "False", "link_id": "t3_tfk3l7", "parent_id": "t3_tfk3l7", "score": "4", "subreddit": "Starfield", "subreddit_id": "t5_3g41m"}, {"author": "OpinionBeneficial864", "body": ">\"romance, adventure, mystery\"... you promise so much, Emil. Really hope there is some healthy dose of variety in the game.\n\nI hope they add horror to that mix. Just like in the Witcher 3, where there were some really scary moments that didn't compromise but actually complimented the other parts of the story/quest. The thematic variety in that game was amazing, along with an equally rich soundtrack and skilled writing that allowed going from one thing to another organically. It really was its strongest point IMO.\n\nJust think of all the ways this game could pay homage to space horror classics. I still hope they design some form of alien entity that defies our preconceptions of what aliens are supposed to be like, like electromagnetic (immaterial) life forms that are hard to detect or study and can kill humans in the most horrific/inexplicable ways, worthy of being considered the greatest menace of the universe, a really intimidating antagonistic presence.", "created_utc": "1647450642.0", "edited": "False", "id": "i0wnmhg", "is_submitter": "False", "link_id": "t3_tfibvm", "parent_id": "t1_i0w09kv", "score": "8", "subreddit": "Starfield", "subreddit_id": "t5_3g41m"}, {"author": "OpinionBeneficial864", "body": "That struggle is 100% part of the experience, just keep doing it. Based on my experience, I say you'll eventually start loving it after a few weeks/months and will never want to stop.", "created_utc": "1647135603.0", "edited": "False", "id": "i0fw5vd", "is_submitter": "False", "link_id": "t3_tctl1g", "parent_id": "t3_tctl1g", "score": "4", "subreddit": "pilates", "subreddit_id": "t5_2r09n"}, {"author": "OpinionBeneficial864", "body": "It looks like you're depressed. Seek medical attention and therapy. If you don't there's nothing anyone can do or even yourself can do to take you out of this bad shape. That said, let's take one problem at a time:\n\n1) Miserable at work: it's never late to change careers. Just make sure you have the means to live through the transition. Your investment and experiences in your previous job will always add to whatever you do next, it was not a waste of time. Keep your expectations low though, because you're starting from zero and no one owes you more than you can give just because you're past a certain age.\n\n2) House: that comes with having a house, you didn't know that? Maybe you're not looking at the good part of having a house enough. Maybe you've forgotten how good it is to have a roof over your head. Go live on the streets/nature for 1\\~2 weeks and when you come back I guarantee you'll be much more appreciative of your expensive but suddenly rather comfy house.\n\n3) Singledom: a blessing disguised as a curse, IMO. I find it ironic that you \"vowed\" not to be single when that is something that goes beyond the scope of your control. It takes two to make a relationship, you know? Two - willing - persons. How can anyone set that as a goal baffles me. Again, nobody owes you anything...\n\n4) Family: ...not even your family. People aren't here on this world to make you happy. They're here to make **themselves** happy. Your parents made (and raised) you because they thought having a kid to raise would make them happy. Well, now you're raised. Their part is done. What else do you bring to the table? Every relationship is an exchange, people will keep you on their lives as long as you have something to offer them in exchange. You like my advice? Upvote my post and I gain karma. You need to start seeing this. And let me tell you, even after you realize this, you will eventually end up in a relationship giving more than you take. You either tank it or move on, there are plenty other people on the planet after all. Learn to and enjoy your own company before anyone else's.\n\nRead. Do something physical. Learn to be grateful for what you have and what you've already accomplished. Gain emotional independence from people. Know yourself. Live with yourself. Realize what is the most important for you in life. Set plans for your future (but don't be too strict with your expectations). Move towards your goals.", "created_utc": "1646956263.0", "edited": "False", "id": "i06atan", "is_submitter": "False", "link_id": "t3_tb54ty", "parent_id": "t3_tb54ty", "score": "8", "subreddit": "AskMenOver30", "subreddit_id": "t5_2y9pw"}, {"author": "OpinionBeneficial864", "body": "The perfect game is lying somewhere between these four: Skyrim's freedom and leveling up skills as you use them, BOTW's exploration/survival mechanics and interactions with the environment/physics, Witcher 3 quest design, overall artistic style and soundtrack, ER's combat and its varied enemies, with actual challenging (but fair) stuff.\n\nI'd also add RDR2's looks and attention to details, Fallout New Vegas' faction system and roleplaying opportunities during dialogue, and finally Mass Effect/Dragon Age companions along with their friendship and romance quests. There, the perfect game.", "created_utc": "1646682038.0", "edited": "False", "id": "hzqqotx", "is_submitter": "False", "link_id": "t3_t8pe11", "parent_id": "t3_t8pe11", "score": "75", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "OpinionBeneficial864", "body": "As I grow old, the less impressed I am with gore and jumpscares. I always like it when the gore effects are well done or when the jumpscare is almost unpredictable (these are becoming rarer and rarer), but they don't scare me or give me nightmares. What does scare me is atmosphere, theme or ideas. It all depends on the movie, some stuff will never scare me (like supernatural biased towards faith/religion, because I simple don't believe it), but movies based on real facts or who try to emulate real formats (like Lake Mungo which you mentioned) are usually the scariest.", "created_utc": "1646065516.0", "edited": "False", "id": "hysl5bh", "is_submitter": "False", "link_id": "t3_t3ei99", "parent_id": "t3_t3ei99", "score": "2", "subreddit": "horror", "subreddit_id": "t5_2qh9x"}, {"author": "OpinionBeneficial864", "body": "\"O próprio Miyazaki falou diversas vezes que a dificuldade nunca foi o objetivo\"\n\nImagina se fosse.\n\n\"Eu não me lembro de nenhum momento onde DS caçoa de você por morrer\"\n\nSim, o jogo não caçoa de você, não de forma explícita e deliberada pelo menos. Mas eu acho que ainda não atingi o nirvana o suficiente para bater um martelo no meu dedo enquanto tentava pregar alguma coisa e não sentir raiva de mim mesmo pela minha imperícia, então acho que o problema sou eu por enlouquecer ao bater o martelo no dedo até esmigalhar o osso. Achava que videogame era sobre lazer, but I stand corrected.\n\n\"Eu pessoalmente nunca parei para ficar vendo build e os caramba, mas tem gente que gosta e DS tem uma cena PVP fiel.\"\n\nVocê também nunca acessou a internet e estudou todas as matérias da escola/faculdade sem livros e professores. Afinal, DS é o jogo mais explícito didático de todos os tempos. Em 1h de jogo e todo mundo já sabe tudo o que está acontecendo no mundo do jogo e o que deve fazer (/s).\n\nSobre DS e depressão: quem sou eu pra julgar a mente dos outros, mas como alguém que já sofreu de depressão acho inimaginável pensar como um jogo desses poderia ajudar alguém a superar a condição. Me parece beirar a irresponsabilidade sugerir algo do tipo, típico de gente que não sabe o que ´é depressão de verdade. Sou sobrevivente, adepto e defensor dos métodos cientificamente comprovados: acompanhamento médico e terapia. Não joguem a vida de vocês no lixo!", "created_utc": "1645913235.0", "edited": "False", "id": "hykfrg4", "is_submitter": "False", "link_id": "t3_t1war2", "parent_id": "t1_hyk7ikj", "score": "0", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Não sei se sádico era a palavra, talvez foi uma opção infeliz. Mas sim, se não me engano em alguns dos jogos se você morrer repetidas vezes o jogo te gera penalidades extras (tive pouquíssima experiência em mãos e a maior parte do que eu sei sobre essa franquia vem de vídeos no YouTube, assistindo algumas gameplays). De forma alguma um professor que quer te **incentivar** a continuar tentando faz esse tipo da coisa. Isso se chama dificuldade artificial e só tem lugar numa experiência cujo foco é gerar frustração.\n\nMas eu tô vendo pelas respostas aqui que o jogador típico de DS acaba ficando dessensibilizado para essas coisas, então é como se ele não conseguisse enxergar a situação pelos olhos de alguém que não passou pela mesma tortura. Vocês tem uma tendência enorme a suavizar (sugarcoatizar, se existisse esse verbo em português seria a palavra perfeita) as partes de game design mais arrombadas desses jogos.\n\nOs desenvolvedores de jogos sempre tiveram o total controle da dificuldade nas mãos, qualquer jogo pode se tornar frustrante (frustrante =/= difícil) com uma ou duas linhas de código a mais ou a menos. Isso não é uma novidade. Mas o time de marketing da FS conseguiu fazer uma lavagem cerebral nos jogadores para fazer eles se esquecerem disso e achar que estão vivendo uma grande inovação, uma experiência muito foda. De repente torrar 5 horas da minha vida memorizando padrões de um boneco no meu PC é uma experiência extremamente edificante, pois assim o credo da seita que se criou ao redor do jogo (e o time de marketing) me fazem ver.\n\nMe surpreende a incapacidade de perceber como está sendo manipulado. Afinal, aceitar que o jogo é fodido em certos aspectos é de certa forma negar/diminuir o esforço empregado para o concluir. Então vamos tratá-lo como se ele fosse o exemplo mais perfeito de justiça e game design e quem não se adapta é que é o problema. Miyazaki é realmente um gênio.\n\nSobre recompensa: o jogo por si só deveria ser a recompensa: sua história, sua engenharia, sua apresentação, sua arte. Já ´é assim na maioria deles, inclusive. Você já pagou pelo jogo, é necessário torrar a sua paciência para se sentir recompensado? Haja dopamina! A vida já nos faz estressar o suficiente para ser recompensado por alguma coisa.", "created_utc": "1645912381.0", "edited": "False", "id": "hykdro2", "is_submitter": "False", "link_id": "t3_t1war2", "parent_id": "t1_hyk6p3i", "score": "1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": ">bichos mais esponjosos e o combate mais lento ainda. Ficando ainda mais chato/tedioso. também gosto de toda a temática como o rapaz acima falou, mas não consegui terminar por conta do combate. Até nos \"bosses\" é tedioso e chato. Combate de Souls like não tem igual, é muito superior a witcher 3, tipo muito\n\nSe estiver no PC, instala um mod que aumenta o dano só dos inimigos sem diminuir o seu. O jogo fica desafiador sem transformar toda batalha numa missa.", "created_utc": "1645904989.0", "edited": "False", "id": "hyjwawn", "is_submitter": "False", "link_id": "t3_t1war2", "parent_id": "t1_hyjdpnm", "score": "3", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Os detalhes das armadilhas podem ser óbvios para você, no seu contexto. Não presuma o que se passa na cabeça de outros jogadores com outros tipos de habilidades/mindsets. Afinal, **a princípio**, o jogo não é propagandeado e comercializado ($$$) exclusivamente para você ou quem mais se parecer contigo, mas para um público em geral.\n\n\"Obviamente ngm é perfeito e vai errar. Então ai entra os elementos de tentativa e erro. Morrer faz parte, agora você sabe como o inimigo se comporta, volta la e tenta de novo.\"\n\nTaí a questão toda. Você e todo mundo sabe que esse jogo é vendido sob essa premissa, é o principal fator de marketing (\"Prepare To Die\" --> título do remaster do DS1 que não me deixa mentir). Eu acho isso estúpido. De novo, reforçando, não que eu ache que morrer em um jogo seja uma coisa que arruíne a experiência (caso contrário nenhum Action RPG seria bom pra mim), só acho que essa premissa principal é meio retardada, do ponto de vista pedagógico da proposta do videogame de te fazer querer continuar jogando.\n\nÉ mais ou menos um professor de matemática querer te fazer se apaixonar pela disciplina dele te chamando de burro e te tirando um ponto a mais toda vez que você responder uma questão errada (em adição aos pontos que ele já te tira nas provas). Ao meu ver (vou reforçar: MEU ver) não é a melhor estratégia de comunicação entre desenvolvedor e jogador. Mas para cada pessoa existe um tipo de professor ideal. Tem gente que vai preferir o professor sádico. Tudo bem por mim.\n\n\"escudo com 100% de defesa física logo no começo, rolagem com i-frames constantes, golpes telegrafados, etc\"\n\nEsse tipo de conhecimento \"metagamístico\" é ótimo em jogos de luta, competitivos em geral. São coisas que te fazem revirar a internet procurando guias/fóruns e te instigam a praticar feito um esportista olímpico. Isso porque nesses jogos seu desempenho é o norte de toda a experiência. De novo: não é o que eu procuro num action RPG. Mas desenvolvedoras japonesas não seguem essa linha de raciocínio, então geralmente eu quase nunca vou atrás dos j-ARPGs.\n\nTratando-se de ARPGs, eu prefiro jogos que me instiguem a continuar jogando, que me façam superar minha zona de conforto e testar minha paciência/perseverança com outros desafios/motivadores que simplesmente me jogar num mundo \"sombrio e edgy\" (usei essas palavras pra me referir ao estilo/atmosfera do jogo, não sei se você captou), testar minha atenção e reflexos pra matar inimigos sem contexto e perder recursos/progresso/tempo/paciência toda vez que eu cometer uma falha. Tem outros jogos que atendem muito melhor a minha demanda e sem exigir 1/3 do desgaste mental (TES, Fallout, ME, AC, TW3, HZD, BOTW, etc.). Eu larguei mão de jogar DS não por incapacidade, foi por excesso de alternativas melhores concomitante a falta de interesse pelos mundos dos souls.\n\nMas, como disse no post lá em cima, dificuldade/masoquismo nem é um fator principal pra me manter afastado dos Souls-like. Eu quando jogo outros jogos de Action RPG sempre que consigo aumento a dificuldade e/ou uso mods para deixar a experiência mais intensa, mais realista de preferência. Dificuldade ´é quase sempre algo bem vindo. O que fode são vários outros fatores, como já expliquei anteriormente.\n\nP.S.: não foi pra ti o comentário sobre os \"bonzões\" do DS.", "created_utc": "1645904077.0", "edited": "False", "id": "hyju3f2", "is_submitter": "False", "link_id": "t3_t1war2", "parent_id": "t1_hyjax6z", "score": "-1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Não disse que o jogo é ruim, disse que é um requentado. Assisti um gameplay da primeira meia hora do ER e vi praticamente o mesmo jogo de 2011 que eu joguei por 1\\~2 horas (e desisti de continuar não pela dificuldade, mas pela absoluta falta de sentido daquela experiência). Acho maluco as pessoas pagarem 300 paus para ter praticamente o mesmo jogo que eles já compraram, mas cada um com seu gosto e tá tudo certo. Sim, o combate é ótimo, ´é a parte boa da franquia (a única, a meu ver), mas se eu quisesse um jogo para focar só no combate eu jogava um jogo de luta, não um action RPG.", "created_utc": "1645894063.0", "edited": "False", "id": "hyj5gey", "is_submitter": "False", "link_id": "t3_t1war2", "parent_id": "t1_hyioie1", "score": "2", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Eu não disse que a armadilha é injusta, disse que é quase na aleatoriedade porque para a maioria das pessoas que eu conheço, perder um progresso de 20\\~30 minutos porque você por acaso deixou de ver alguma coisa que estava escondida/subentendida no cenário não se define como algo interessante ou divertido, dá a sensação que o jogo te trapaceou aleatoriamente (não é o que acontece, eu sei, mas dá a sensação).\n\nContinuando, você precisa engajar com um inimigo para \"descobrir\" o moveset dele, inimigos não ficam lutando entre si para você \"observar\" à uma distância segura e \"aprender\". Num jogo em que os oponentes te matam em 2\\~3 golpes isso não exatamente conduz à uma gameplay de observação, como você está afirmando. Na verdade é mais um exercício exaustivo de tentativa e erro, o que para muita gente é mais do que suficiente para se convencer de que está progredindo e se divertindo (ainda que na verdade seja uma tortura camuflada com um visual \"sombrio\" e \"edgy\"). Tem 1213213242 vídeos no YouTube de pessoas normais/influencers experimentando o jogo e eles servem para demonstrar esse meu ponto. Aparentemente esse tipo de coisa vicia algumas pessoas, e outras só gostam de ficar pagando de bonzão na internet mesmo. Eu aplaudo o Miyazaki por ter tido a sacada de observar esse comportamento em alguns jogadores, o cara t´á trilhardário agora.\n\nSim, não é um jogo para mim e eu deixei bem claro isso no meu comentário. De toda forma frisei que eu vejo lados positivos no jogo, apesar de ser um jogo de nicho que não faz nenhum sentido para mim enquanto experiência de entretenimento. E valeu pelo downvote, quem quer que tenha sido, sempre legal conversar com pessoas imaturas que não sabem lidar com opiniões divergentes (/s).", "created_utc": "1645891343.0", "edited": "1645891574.0", "id": "hyiyxzz", "is_submitter": "False", "link_id": "t3_t1war2", "parent_id": "t1_hyiw06t", "score": "3", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Concordo contigo, tem jogos que conseguem atingir o mesmo grau de emoção/engajamento/dificuldade sem terem mecânicas filha da puta (1 - armadilhas e coisas que te fazem perder progresso quase na aleatoriedade. 2 - inimigo que você precisa ou ter muita sorte para conseguir matar de primeira ou morrer primeiro para aprender a derrotar (qual o sentido). 3 - jogo que te penaliza por ter morrido (qual o sentido²). 4 - jogo que te faz repetir coisas ad infinitum). Meu problema com esses jogos também vai além da mecânica, todo o aspecto artístico/cultural/storytelling/comunidade do jogo também não me desce. Mesmo Sekiro que é o mais diferentão deles, acho muito tosco da mesma forma. Elden Ring então, é total mexidão com as sobras da geladeira,  a mesma coisa de sempre requentada. Eu fico alucinado como que as pessoas não conseguem ver isso. Se eu gostasse das partes que não envolvem as mecânicas masoquistas, talvez conseguiria insistir no jogo, afinal action RPG é meu estilo favorito. Mas enfim, não dá. Felizmente a parte boa desses jogos souls-like (que é o aspecto físico/intricado do combate e a escassez de recursos de cura) está pouco a pouco servindo de inspiração por outros jogos menos masoquistas, então de certa forma eu fico feliz que eles estejam sendo desenvolvidos e sendo aclamados pela crítica, mesmo eu não consumindo.", "created_utc": "1645884931.0", "edited": "False", "id": "hyil0ha", "is_submitter": "False", "link_id": "t3_t1war2", "parent_id": "t1_hyig7tg", "score": "2", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Considering they're gonna release this game 4\\~5 years from now, I kinda wish they tried to create realistic physics interactions with the environment, à la Breath of the Wild. Rolling giant boulders to crush bandits camps is always fun, doing it with new Alteration Telekinesis spells would be even more fun.", "created_utc": "1645865856.0", "edited": "False", "id": "hyhu88s", "is_submitter": "False", "link_id": "t3_t1b3y7", "parent_id": "t1_hyeydcy", "score": "3", "subreddit": "TESVI", "subreddit_id": "t5_2umdu"}, {"author": "OpinionBeneficial864", "body": "Scream 5 > Halloween Kills > TCM 2022.\n\nI didn't love any of the three, but Scream 5 is the least worse because of all the nice nods to the previous and some really tense moments. That said, I wish the Superman/Superwoman unbelievably strong/immortal killer machine trope dies with these films.", "created_utc": "1645796414.0", "edited": "False", "id": "hydn9qn", "is_submitter": "False", "link_id": "t3_t144ql", "parent_id": "t3_t144ql", "score": "25", "subreddit": "horror", "subreddit_id": "t5_2qh9x"}, {"author": "OpinionBeneficial864", "body": "Bolsonaro needs take shotgun blast 2 cm from his face, I'd be so happy to see that on live TV.", "created_utc": "1645754845.0", "edited": "False", "id": "hybrusx", "is_submitter": "False", "link_id": "t3_t0gxih", "parent_id": "t1_hybpc0q", "score": "1", "subreddit": "LatinAmerica", "subreddit_id": "t5_2qioc"}, {"author": "OpinionBeneficial864", "body": "2022. Isso é deprimente.", "created_utc": "1645685842.0", "edited": "False", "id": "hy7lm1w", "is_submitter": "False", "link_id": "t3_t00kf3", "parent_id": "t3_t00kf3", "score": "24", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Of Mice and Men by John Steinbeck. I can't wait to read more of his stuff.", "created_utc": "1645601541.0", "edited": "False", "id": "hy2pc0u", "is_submitter": "False", "link_id": "t3_sz9820", "parent_id": "t3_sz9820", "score": "25", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "OpinionBeneficial864", "body": "The Black Book of Communism - even if it's outdated (and some of it has been questioned, and the translation was awful, and the e-book is riddled with typos and some of it's chapters are a slog), most of it is as visceral as a portrait of historical Communism can get, with actual documents and data collected from that time period. And it goes beyond, talking about other communist dictatorships, Latin America, North Korea, Africa and the Khmer Rouge (which is the most fucked up thing I think I've ever read about). It's not an attack on the communist ideology per se (most of its writers were communists themselves), but it's a bare exposition of what has been done on its name. It's the only book I have ever cried reading, there are parts of human history that are just too absurd for our human brains to fully understand, I guess.", "created_utc": "1645591260.0", "edited": "False", "id": "hy293nb", "is_submitter": "False", "link_id": "t3_sz1tom", "parent_id": "t3_sz1tom", "score": "-2", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "OpinionBeneficial864", "body": "At least where I live, we say either canudos or canudinhos (little canudos).", "created_utc": "1645577987.0", "edited": "False", "id": "hy1gpqe", "is_submitter": "False", "link_id": "t3_sz18dt", "parent_id": "t1_hy18zkw", "score": "11", "subreddit": "LatinAmerica", "subreddit_id": "t5_2qioc"}, {"author": "OpinionBeneficial864", "body": "Pq que tem BR de esquerda defendendo.\n\nFTFY", "created_utc": "1645492773.0", "edited": "False", "id": "hxwog7p", "is_submitter": "False", "link_id": "t3_sy7s1i", "parent_id": "t3_sy7s1i", "score": "1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "Breathtaking.", "created_utc": "1645482647.0", "edited": "False", "id": "hxw1d5w", "is_submitter": "False", "link_id": "t3_sxvskr", "parent_id": "t3_sxvskr", "score": "1", "subreddit": "Outdoors", "subreddit_id": "t5_2qj57"}, {"author": "OpinionBeneficial864", "body": "I think I just try to treat books as books, and so far it's been great for me. I too had an awful experience with Literature teachers in school. Too many of them are simply incapable to understand/accept the difference between how they process their readings and how their audience (teenage students) do it. I've recovered my pleasure of reading a couple of years ago and so far it has been like this: if the story/content was interesting enough for me to want to go back and analyze all the subtleties/hidden meanings/symbolisms, I'll do just that. Gladly. If not, I just move to the next book. There's too many classic books for us to know in our lifetime. I want to understand what's all the fuss about or at least have an impression of most of them, especially the ones that for some reason resonate more with me. It is part searching for long lost wisdom, part knowing myself better and part exercise for the brain. This keeps me motivated to keep reading despite the traumatic experiences I've had in school.", "created_utc": "1645439648.0", "edited": "False", "id": "hxtgi4y", "is_submitter": "False", "link_id": "t3_sxh9vl", "parent_id": "t3_sxh9vl", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "OpinionBeneficial864", "body": "Exploring Santo Domingo on Google Earth, the city could be easily mistaken for a Brazilian city if not for the road signs/advertisings written in another language. I think DR is the Latin American country that most resembles Brazil.", "created_utc": "1645331806.0", "edited": "False", "id": "hxo0tvv", "is_submitter": "False", "link_id": "t3_swm38i", "parent_id": "t1_hxn1y4j", "score": "2", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "OpinionBeneficial864", "body": "I disagree with BC as a picking, since it is not that much of an important place compared to other bigger cities. I'd replace it with another place in the south (Foz do Iguaçu could be a nice Water-themed city or Porto Alegre as the fairy place since it's where all gay people comes from apparently). Rio's typing has got to be Dark typing. Both Rio and Brasilia are teeming with shady/sketchy/scheming Pokémon lovers.\n\nI also find it weird that Brazil doesn't have a Bug centered gym (really?) and a Ghost one (as we're doomed to be haunted by our shameful history of slavery forever).", "created_utc": "1645330816.0", "edited": "False", "id": "hxnz2dx", "is_submitter": "False", "link_id": "t3_swkm0v", "parent_id": "t1_hxnkrnv", "score": "2", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "OpinionBeneficial864", "body": "I agree 100%, the people who wrote this movie just didn't understand the essence of the original.", "created_utc": "1645257366.0", "edited": "False", "id": "hxjzi5t", "is_submitter": "False", "link_id": "t3_sv9xv5", "parent_id": "t1_hxiw4ts", "score": "8", "subreddit": "horror", "subreddit_id": "t5_2qh9x"}, {"author": "OpinionBeneficial864", "body": "She's invoking her inner Tyrannosaur spirit.", "created_utc": "1645038126.0", "edited": "False", "id": "hx7huai", "is_submitter": "False", "link_id": "t3_stx9bg", "parent_id": "t3_stx9bg", "score": "3", "subreddit": "cockatiel", "subreddit_id": "t5_2uqu9"}, {"author": "OpinionBeneficial864", "body": "I have a list of \\~370 books I have selected among classics, philosophical, non-fiction that I consider to be the most important. I've already read \\~10% of those. My pace is more or less 10\\~12 books a year, so I think it's going to take me \\~30 years to finish it all, and I'm totally fine with that.", "created_utc": "1644965096.0", "edited": "False", "id": "hx3j3f9", "is_submitter": "False", "link_id": "t3_st9tqx", "parent_id": "t3_st9tqx", "score": "2", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "OpinionBeneficial864", "body": "The Demon-Haunted World - Science as a Candle in the Dark by Carl Sagan.\n\nWhen I was a kid (90s) I was traumatized by cases of alien abductions/alien sightings showing on TV and I carried that trauma with me during my whole life. Thanks to Sagan and this book I was able to rationalize my fear and nowadays I don't think of aliens abducting me every time I find myself alone in the dark trying to sleep. Would I die immediately from a heart attack if I ever saw an alien in front of me? Probably. But there's a slight chance that I realize it's just a jackass wearing a suit trying to scare me.\n\nIt is a really good book whether you're afraid of the supernatural or not. You learn how zealotry, superstition, anti-scientific thoughts and things like History Channel only lead people into unnecessary suffering.", "created_utc": "1644957741.0", "edited": "False", "id": "hx2zja8", "is_submitter": "False", "link_id": "t3_st7d4k", "parent_id": "t3_st7d4k", "score": "5", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "OpinionBeneficial864", "body": "De maneira geral são muito melhores do que a série. Os primeiros três livros são ótimos, especialmente o terceiro. O quarto e o quinto são bons se você estiver muito investido nos personagens. O sexto é capaz de nunca ser lançado, leve isso em consideração antes de começar a ler.", "created_utc": "1644778406.0", "edited": "False", "id": "hwt66rh", "is_submitter": "False", "link_id": "t3_sroa33", "parent_id": "t3_sroa33", "score": "8", "subreddit": "Livros", "subreddit_id": "t5_2tlr4"}, {"author": "OpinionBeneficial864", "body": "I don't think that water (H2O) was the problem, but maybe Earth's water has something diluted in it that reacted with the Alien's skin (e.g.: chlorine). That could explain the alien's overlooking their weakness.", "created_utc": "1644772300.0", "edited": "False", "id": "hwsqobv", "is_submitter": "False", "link_id": "t3_srdo5x", "parent_id": "t1_hwsj6th", "score": "1", "subreddit": "movies", "subreddit_id": "t5_2qh3s"}, {"author": "OpinionBeneficial864", "body": "I've cried watching all these movies:\n\nThe Green Mile (1999)\n\nGrave of the Fireflies (1988) - **beware**: lightly depression inducing\n\nArtificial Intelligence: A.I. (2001)\n\nTitanic (1997) - Cried watching it on the cinema.\n\nMarley & Me (2008) - I've seen this 11 times, cried 11 times.\n\nHachi: A Dog's Tale (2009) - Even sadder than the last one.\n\nBraveheart (1995) - If you don't cry by the end you better watch your cold heart.\n\nMillion Dollar Baby (2004)\n\nInto The Wild (2007)\n\nGirl: Interrupted (1999)\n\nMy Sister's Keeper (2009)\n\nUp (2009) - just the intro sequence.\n\nAnd since I'm Brazilian, I'll add one from my country:\n\nCentral do Brasil (1998) - Translated as *Central Station*.\n\nThere might be some I am forgetting, I cry watching movies all the time... I could include a lot of really sad and depressing movies like Boys Don't Cry (1999), Amour (2012), Requiem for a Dream (2000), Precious (2009) and many others, even though they didn't make me cry on the outside (but on the inside they sure did). Maybe they'll work for you.\n\nEDIT:\n\nYes, I forgot to add Inside Out (2015), Coco (2017), Soul (2020) - pretty much all Pixar movies being made lately are big tearjerkers. The Sixth Sense (1999) - even though a creepy movie, the ending scene in the car just demolishes me - give Toni Collette an Oscar already!!!", "created_utc": "1644729555.0", "edited": "1644730823.0", "id": "hwqr7tx", "is_submitter": "False", "link_id": "t3_sr5p24", "parent_id": "t3_sr5p24", "score": "5", "subreddit": "MovieSuggestions", "subreddit_id": "t5_2sqpa"}, {"author": "OpinionBeneficial864", "body": "\"Ah, mas fulano é homem\" querendo dizer que fulano é hétero, como se homens gays fossem um de terceiro sexo.", "created_utc": "1644637921.0", "edited": "1644638135.0", "id": "hwlmnr2", "is_submitter": "False", "link_id": "t3_sq92is", "parent_id": "t3_sq92is", "score": "1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "People are different, everyone standing on this planet is destined to live something unique. The meaning of it all changes from person to person and from time to time. What never changes is that life is always changing. Sometimes we think we know what it's going to happen, we delude ourselves thinking we've seen all there is to see. SPOILER: no, we haven't. No matter if more optimistic or pessimistic, everyone should stop pretending they know things because in truth all of us know so very little about life and the world that surrounds us. Oh, and as someone who has suffered from depression severely but made it through I should never forget to say this: if you're suffering from depression, you need medical assistance ASAP. Get out of Reddit and go see a doctor.", "created_utc": "1644519660.0", "edited": "False", "id": "hwejofk", "is_submitter": "False", "link_id": "t3_sp6utd", "parent_id": "t3_sp6utd", "score": "3", "subreddit": "AskOldPeople", "subreddit_id": "t5_2yg69"}, {"author": "OpinionBeneficial864", "body": "Queísme? / Queís miní? - O que é isso menino?\n\nCê n'sá d'ná. - Você não sabe de nada.\n\nÊs são tudôi(d). - Eles são tudo (todos) doido(s).\n\nC'tá malu(k)? - Você está maluco?\n\nDêshk milifr! - Deus que me livre!\n\nMês num foro lá nãum. - Mas eles não foram lá não.\n\nComék'cê tá? / Cumék'cê tá? - Como é que você está?\n\nNónum falâmassim nãum, uai. - Nós não falamos assim não, uai.\n\nCuruz credo davemaria. - Cruz credo da Ave Maria.\n\nCrêyin' Deuspai. - Creio em Deus Pai.\n\nVác'm Deus! - Vá com deus!\n\n**FONTE**: Family born and raised in Minas Gerais^(TM).", "created_utc": "1644516500.0", "edited": "False", "id": "hweaz0x", "is_submitter": "False", "link_id": "t3_sp9qmw", "parent_id": "t3_sp9qmw", "score": "7", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "OpinionBeneficial864", "body": "Não sei se é uma diferença de conjugação especificamente, mas em Portugal eles usam um tempo verbal diferente do Brasil para exprimir possibilidades/hipóteses/desejos:\n\n\\*PT-BR\\* --> Gostaria de saber isso (FUTURO DO PRETÉRITO).\n\n\\*PT-PT\\* --> Gostava de saber isso (PRETÉRITO IMPERFEITO).\n\nAmbas seria traduzidas para o inglês como: \"I would like to know\".", "created_utc": "1644342764.0", "edited": "False", "id": "hw3yhws", "is_submitter": "False", "link_id": "t3_sngs3r", "parent_id": "t3_sngs3r", "score": "1", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "OpinionBeneficial864", "body": "I love Jabuticaba jam even though I don't care for the fruit all that much. The smell of the flowers when the tree is in full bloom is entrancing.", "created_utc": "1644183058.0", "edited": "False", "id": "hvv1jih", "is_submitter": "False", "link_id": "t3_slvyr7", "parent_id": "t1_hvt6zc6", "score": "1", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "OpinionBeneficial864", "body": "I didn't know that dish, googled it and turns out it has the same main ingredient of Brazilian Dobradinha, which I hate. At least yours have a lot of yummy spices to go along with it.", "created_utc": "1644182748.0", "edited": "False", "id": "hvv0s3h", "is_submitter": "False", "link_id": "t3_slvyr7", "parent_id": "t1_hvts2su", "score": "1", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "OpinionBeneficial864", "body": "I've been studying English seriously for 10\\~12 years now (I'm discounting the crappy \"English\" they teach us in primary/secondary school in my country). I'm at a point now that I can read most classical and scientific books without any problems but there's always 1 or 2 words per PAGE that I have to check up, if not for their literal meaning, for understanding the way they were used in a sentence or expression (and phrasal verbs, oh what a nightmare). Funny thing is: this also happens to me when I'm reading in my native language. So I don't bother with it anymore.", "created_utc": "1644100760.0", "edited": "False", "id": "hvr062k", "is_submitter": "False", "link_id": "t3_slcgih", "parent_id": "t3_slcgih", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "OpinionBeneficial864", "body": "500 Days of Summer (2009)", "created_utc": "1644067302.0", "edited": "False", "id": "hvp0yp1", "is_submitter": "False", "link_id": "t3_sky9oe", "parent_id": "t3_sky9oe", "score": "2", "subreddit": "MovieSuggestions", "subreddit_id": "t5_2sqpa"}, {"author": "OpinionBeneficial864", "body": "I love Hereditary, it's an absolute masterpiece IMO but it didn't creep me out as it did other people. I did take a 5 min. break after the >!accident!< scene though, that was the most unnerving scene I've ever watched in a movie. I'm a super skeptical guy though, so I'm not usually scared of the supernatural. Nevertheless, a film that really creeped me out and I haven't watched it again yet (and wouldn't watch alone) is Lake Mungo (2008). The terrorizing late 90's/early 00's documentary aspect is emulated to perfection in this one. Mix Lake Mungo with The Fourth Kind (2009) and REC (2007) and you'd have made a movie and I may not even be able to watch so scared I would be. Get Aster to direct it and I'm out of the theaters.", "created_utc": "1643811157.0", "edited": "False", "id": "hv9zwge", "is_submitter": "False", "link_id": "t3_sice12", "parent_id": "t3_sice12", "score": "1", "subreddit": "horror", "subreddit_id": "t5_2qh9x"}, {"author": "OpinionBeneficial864", "body": "Right??? I didn't find him attracting when he was in GoT, but I was ovulating for him during the whole Narcos show.", "created_utc": "1643806753.0", "edited": "False", "id": "hv9qncq", "is_submitter": "False", "link_id": "t3_sia5t1", "parent_id": "t1_hv7l1t6", "score": "3", "subreddit": "asklatinamerica", "subreddit_id": "t5_fda8k"}, {"author": "OpinionBeneficial864", "body": "Usa K-Othrine, dilui em 10 litros de água e aplica na casa inteira, especialmente nos ralos e na sua caixa de gordura. Evite deixar comida exposta e principalmente papel/papelão (elas adoram, até mais que comida às vezes). Eu reaplico o K-Othrine toda vez que encontro uma morta. Uns 10\\~12 frascos depois e esse deve ser o primeiro verão que eu não vi barata aqui em casa (morta, viva eu não vejo já faz muito mais tempo).", "created_utc": "1643711523.0", "edited": "False", "id": "hv47s9i", "is_submitter": "False", "link_id": "t3_shenty", "parent_id": "t3_shenty", "score": "1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}, {"author": "OpinionBeneficial864", "body": "I second that, reading the Demon-Haunted World changed my life in a very positive way.", "created_utc": "1643385387.0", "edited": "False", "id": "hulgsft", "is_submitter": "False", "link_id": "t3_seli5p", "parent_id": "t1_hukulup", "score": "2", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "OpinionBeneficial864", "body": "You're a human, you're not a parrot. What distinguishes us from animals is that we communicate with each other by using sounds and gestures. Just make sure that everyone understands what you're saying. The way you pronounce words shouldn't matter at all if people get what you mean.", "created_utc": "1643339141.0", "edited": "False", "id": "huj6ngs", "is_submitter": "False", "link_id": "t3_sedqcg", "parent_id": "t3_sedqcg", "score": "3", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "OpinionBeneficial864", "body": "TL,DR: vi um \"ET\" dentro da casa da minha avó.\n\nComeço dos anos 2000, eu estava na 4ª série e nessa época minha mãe e eu morávamos na casa dos meus avós. Lá também moravam duas primas minhas, uma que tinha quase a mesma idade que eu e estudava numa escola próxima da casa e outra mais velha que estudava no CEFET tempo integral do outro lado da cidade e por isso passava quase o dia inteiro fora.\n\nComo eu e minha prima de idade próxima estudávamos pela manhã, a gente tinha o costume de brincar durante a tarde toda. Nessa época eu tinha um Super Nintendo que ficava conectado à uma TV antiga que nós tínhamos num quartinho anexo ao sótão da casa (pra você que não sabe, sótão é a parte que fica entre o telhado e a laje, geralmente onde as pessoas têm a caixa d'água e várias tralhas). Esse quartinho era separado dos demais cômodos da casa e para acessá-lo, era necessário subir uma escada pela parte externa da casa.\n\nPois bem, uma tarde dessas a gente estava tentando zerar o Super Mario World (fases do Special World), mas como éramos muito noobs, a gente morria no jogo o tempo todo e levava um tempão para passar de fase. Quando nos demos conta, já estava de noite. Minha mãe ainda não tinha chegado do serviço, mas a essa hora a gente já devia ter descido para jantar. Descemos a escada e para entrar na casa a gente tinha que passar pela sala de jantar.\n\nMinha prima estava à minha frente e bem quando íamos entrar na sala de jantar, ela paralisou e começou a falar: \"Ai meu Deus, tem alguém ali, tem alguém ali!\", apontando para um dos cantos do cômodo. Acontece que estava tudo escuro e a gente não conseguia ver quase nada (detalhe: meu vô estava no cômodo ao lado, assistindo TV com a luz apagada e a luz da TV era a única luz que iluminava alguma coisa na casa naquele momento). De toda forma, dava para ver que tinha o vulto de alguma coisa se contorcendo bem naquele canto da sala de jantar.\n\nImagino que minha prima estava assustada por ela ter achado que se tratava de um ladrão/desconhecido dentro da casa. Eu, por outro lado, criança dos anos 90 traumatizada pelo caso do ET de Varginha em 1996, ao ver aquela figura estranha, alta, meio deformada e cabeçuda se contorcendo e lentamente deslizando em direção ao chão, imediatamente soube que era um alienígena (tente se lembrar da imagem de como o ET de Varginha foi avistado e você vai poder imaginar o que eu tinha visualizado na minha mente). A criatura ainda por cima emitia uns barulhos ritmados bem baixinhos, como se fosse o som de um pequeno mamífero se afogando.\n\nMinha prima foi me empurrando para frente, implicitamente me lembrando que eu era o \"homem\" da situação e era eu que deveria ser o corajoso ali. Mesmo me cagando de medo (realmente fui traumatizado por histórias de ET ao longo da vida, tenho praticamente uma fobia), eu fui me esgueirando pela parede da porta até um interruptor de luz que ficava justamente acima da criatura, que a esse ponto já estava praticamente deitada no chão.\n\nQuando liguei a luz, vimos que o ET na verdade era minha outra prima, que tinha acabado de chegar do CEFET e ela estava quase se mijando no chão de tanto que ela ria da nossa cara. Ela tinha acabado de chegar do CEFET e estava indo justamente ligar a luz para poder estudar (ela virava noites estudando). Sabe quando você ri tanto que não consegue emitir o som direito? Era essa a origem dos \"sons extraterrestres\" que eu tinha ouvido. Quanto ao formato estranho da \"criatura\", minha prima hoje é uma mulher bonita, bem desenvolvida, mãe de três filhos, mas naquela época ela parecia um cosplay adolescente do Ronaldinho Gaúcho, alta, magra e cabeçuda.\n\nP.S.: no Réveillon de 2012 eu e minha tia vimos dois OVNIs sobrevoando a região próxima à casa da minha vó. As naves tinham claramente um formato triangular e voaram a uma velocidade que eu nunca vi nenhum avião conseguir. Pra você ter noção, ela cruzou toda a linha do horizonte em menos de 2 segundos. Essa foi realmente uma experiência estranha, mas há pouco tempo me tornei devoto da palavra de Carl Sagan e desde então tento me convencer de que essas coisas \"paranormais\" sempre têm uma explicação lógica por trás.", "created_utc": "1643263494.0", "edited": "False", "id": "huemr9v", "is_submitter": "False", "link_id": "t3_sdi074", "parent_id": "t3_sdi074", "score": "1", "subreddit": "brasil", "subreddit_id": "t5_2qh9i"}]