[{"author": "Ovaltine888", "body": "开场 \n保镖：领导 请站起来一下 \n胡：你要干什么？\n\n00:21 保镖结果栗战书交过来的会议材料，跟胡锦涛说了一句话但是我听不清楚，大家帮忙再听听？\n我听到的好像是“不好意思，这里有词” 但是感觉讲不太通。\n\n1:01 听到保镖还对胡锦涛说“我带您先到会议室”", "created_utc": "1666488633.0", "edited": "False", "id": "itelh0z", "is_submitter": "False", "link_id": "t3_yai2qx", "parent_id": "t1_itb6lri", "score": "1", "subreddit": "China_irl", "subreddit_id": "t5_x72uq"}, {"author": "Ovaltine888", "body": "What do you mean?\nYou can simply use Google account to login fydeOS as you do with ChromeOS. A fydeOS account is not even necessary. And fydeOS is completely free for use.\n\nThe only part you may need to pay is whenever there is a major update of the system. But you can also choose to download the new version of fydeOS image and install from scratch.", "created_utc": "1666274029.0", "edited": "False", "id": "it2j2tq", "is_submitter": "False", "link_id": "t3_y8w7ce", "parent_id": "t3_y8w7ce", "score": "1", "subreddit": "FydeOS", "subreddit_id": "t5_uzqyo"}, {"author": "Ovaltine888", "body": "First go through Language Transfer (free). It is an audio course of 40 lessons. The total length is about 6 hours so basically you can even binge on it all in one day. Or (suggested) you can spend a month or so listening to a couple of bite size episodes every day.\n\n\nThen go through Kwiziq.com (paid site) and get your knowledge map to 100% green colored. This one is a bit more intense. It took me about 50 days to fulfill the goal. I worked on it for 5-6 hours per day.\n\nAfter that, you should grasp more than 80% of French grammars and you will find yourself able to understand most of the  sentence structures.\n\nThen start to read short story books for beginners and talk to native speakers on italki to expand your vocabulary.", "created_utc": "1665811490.0", "edited": "1665894951.0", "id": "isdul0b", "is_submitter": "False", "link_id": "t3_y3ykxo", "parent_id": "t3_y3ykxo", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "why am i seeing 困😪", "created_utc": "1665646094.0", "edited": "False", "id": "is4mk7a", "is_submitter": "False", "link_id": "t3_y29bz6", "parent_id": "t3_y29bz6", "score": "1", "subreddit": "translator", "subreddit_id": "t5_2ss9z"}, {"author": "Ovaltine888", "body": "if you are a beginner, strongly recommend you the Language Transfer.", "created_utc": "1665619378.0", "edited": "False", "id": "is3ag2j", "is_submitter": "False", "link_id": "t3_y2irds", "parent_id": "t3_y2irds", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "I think it is completely up to you. If you are happy with doing everything in the brower, just go for it. To be honest, ChromeOS Flex is great to use.\n\nBut if I were you, I would probably choose to invest some hundred dollars for a real Chromebook, because in my eyes, ChromeOS Flex is like a beta version system and you cannot complain if there is a bug or incompatibility issues. So personally I would not like to put it into serious use on my primary laptop.", "created_utc": "1665558416.0", "edited": "False", "id": "irzs4q4", "is_submitter": "False", "link_id": "t3_y1v8do", "parent_id": "t1_irzqhk5", "score": "3", "subreddit": "ChromeOSFlex", "subreddit_id": "t5_5uw3kb"}, {"author": "Ovaltine888", "body": "Why would you choose to shift to Chrome OS while the spec of your laptop still looks pretty capable to run Windows smoothly? \n\nIn my opinion, productivity wise, Windows is with no doubt much better than ChromeOS, not to mention the compatibility.\n\nI shifted my old laptop to ChromeOS flex simply because it was too old to afford running Windows. The response was slow and the battery life was limited. After shifting to ChromeOS, I must admit that it has a new lease of life.But there is also tradeoffs such as I can no longer use the integrated webcam (fortunately, other parts are running well under flex). \n\nBut anyways why would you want to risk losing functions of hardware to install ChromeOS on a laptop still in the prime of life？", "created_utc": "1665556689.0", "edited": "False", "id": "irzq0w7", "is_submitter": "False", "link_id": "t3_y1v8do", "parent_id": "t3_y1v8do", "score": "2", "subreddit": "ChromeOSFlex", "subreddit_id": "t5_5uw3kb"}, {"author": "Ovaltine888", "body": "It's true that the native file manager of ChromeOS does not have the basic file information which is really annoying.", "created_utc": "1665461345.0", "edited": "False", "id": "irunwf8", "is_submitter": "False", "link_id": "t3_y0xfid", "parent_id": "t3_y0xfid", "score": "6", "subreddit": "ChromeOSFlex", "subreddit_id": "t5_5uw3kb"}, {"author": "Ovaltine888", "body": "Yes I've noticed this guy too. He seems to speak multiple languages pretty well according to the omegle videos. BUt do you really believe his claims of the time he spent studying these languages to that level? Advanced Portuguese in 1 month? I really doubt it. I guess even a native Spanish would not say that.\n\nBy the way , I think those who make Omegle videos are great masters in time management. Since  Omegle is not a platform for languge exchange, most of the online users are actually horny men looking for women. Therefore when you need to record 20 mins long for the YouTube, you probably have to hang in there for 3 hours skipping penis exposers to find right people to talk to. I am curious how they find time to do real practice in language learning.", "created_utc": "1665020992.0", "edited": "1665033307.0", "id": "ir8aa1i", "is_submitter": "False", "link_id": "t3_xwi0vp", "parent_id": "t1_ir7fzm9", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "My current level cannot support me to listen to any material I am interested in. That is why I think I need more listening practice.\n\nHowever, those listening resources I mentioned above for language learning purpose are all involving a large part of explanation in English. It is useful for beginners to understand but it offers less exposure in my TL in the same period time. I often find I can understand most of it when I listen to it but I still cannot grasp every point and use them freely. My question is if I should spend time listening to these material once more.\n\nIt's true that I can't remember everything I encountered. With written material, I tend to simply skim the text I am not familiar with for a quick revision. I can also utilise my fragment time to do flashcards. But it is difficult to do the same in listening. \n\nThe condition required by listening practice is much more demanding. I need a complete period of time and I must be highly focused and in most cases I have to listen to the audio again from beginning to end if I want to revise. But is it worth doing so, especially when the audio material for learners is not that interesting and more than half of the time is the discussion in English.", "created_utc": "1664148672.0", "edited": "1664149385.0", "id": "ipwlu3m", "is_submitter": "True", "link_id": "t3_xnqyhf", "parent_id": "t1_ipuz52c", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "I believe that it is not hard to grasp more than one native language as long as you are exposed to them enough in your early years. \n\nBut if we go beyond spoken fluency, can you really balance your reading and writing abilities in these languages that you speak? Is that a common case that you may speak a language like a native but you can hardly read or write. It requires great efforts to learn the writing system of every language (actually that is why we still need to study our mother tongue at school for years.) When it comes to two different writing systems such as English and Chinese, it can be much more challenging to learn to read and write in both. \n\nSo for those \"polyglots\" raised in multilingual families, are you really able to read or write in your multiple mother tongues? And for parents deciding to raise a polyglot kid, do you expect them to be able to read or write in every language they speak or for some languages spoken fluency is enough?", "created_utc": "1663998995.0", "edited": "1663999699.0", "id": "ipor3lk", "is_submitter": "False", "link_id": "t3_xm7kvy", "parent_id": "t3_xm7kvy", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "I'm sorry but I couldn't help but imagine the guy might fall into the cauldron when the soup is boiling.", "created_utc": "1663814155.0", "edited": "False", "id": "ipf3i88", "is_submitter": "False", "link_id": "t3_xkmsyu", "parent_id": "t3_xkmsyu", "score": "2", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Ovaltine888", "body": "that must be heavy", "created_utc": "1663813877.0", "edited": "False", "id": "ipf2wtk", "is_submitter": "False", "link_id": "t3_xkn649", "parent_id": "t3_xkn649", "score": "1", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Ovaltine888", "body": "hi I'm native chinese and fluent in English. Currently learning French to A2 level and beginner of Italian.\n\nI think we are well matched. Don't hesitate to DM me.", "created_utc": "1663672994.0", "edited": "False", "id": "ip6ihuq", "is_submitter": "False", "link_id": "t3_xixqmf", "parent_id": "t3_xixqmf", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Ovaltine888", "body": "not aware of that", "created_utc": "1660213071.0", "edited": "False", "id": "iju84d4", "is_submitter": "False", "link_id": "t3_wllrbf", "parent_id": "t3_wllrbf", "score": "1", "subreddit": "chromeos", "subreddit_id": "t5_2r1wh"}, {"author": "Ovaltine888", "body": "Clozemaster is actually not an app for beginners of one language. It's better you reach A2 level and then try it. Otherwise you would probably find yourself struggling in comprehending the sentences for lack of the basic knowledge of grammar and vocabulary.\n\nThis limits the target users of Clozemaster. Unlike Duolingo, most people using Clozemaster are essentially experienced language learners so they demand more from the app. The sentence quality obviously keeps many from subscribing.", "created_utc": "1660008326.0", "edited": "1660017905.0", "id": "ijisfun", "is_submitter": "False", "link_id": "t3_wj9g9k", "parent_id": "t1_ijhxy6s", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "You must be a starter on Clozemaster. In my case, I can only earn around 80 points every round (10 sentences). I have done 10k+ words on Fast Track of French.", "created_utc": "1660007280.0", "edited": "False", "id": "ijipylj", "is_submitter": "False", "link_id": "t3_wj9g9k", "parent_id": "t1_ijiho36", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "This change will eventually force me to cut down the time I spend on Clozemaster in the future. Actually, this is something I've truely wanted because I already found myself spending too much time on the app and having little time for reading other authentic materials like newspaper or novels.\n\nFrankly speaking, I don't think Clozemaster is worth the money for its pro version. The team did not really do much about the quality of sentences but simply borrow the data from other source ([Tatoeba](https://tatoeba.org/)). I have been aware that some of the sentences are outdated or not well said after I checked with native speakers.\n\nI would say reading novels or newspapers would be more enjoyable and informative than guessing non-sense sentences without context.\n\nI think I would probably continue with the free version in my fragment time but have to forget about the progress of the Fluency Fast Track. (I have done 10k+ words in French and 5k+ words in Italian.)", "created_utc": "1659973113.0", "edited": "1659973969.0", "id": "ijgbypb", "is_submitter": "False", "link_id": "t3_wj9g9k", "parent_id": "t3_wj9g9k", "score": "47", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "Are they nuts? It won't get them more subscribers but push away a bunch of free users.", "created_utc": "1659970532.0", "edited": "False", "id": "ijg5gxm", "is_submitter": "False", "link_id": "t3_wj9g9k", "parent_id": "t3_wj9g9k", "score": "128", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "I think Google has a much more ambitious vision for Chromebook than just a budget laptop for grandmas and students.\n\nWhen HTML5 redefined the webpage standard, it seemed that webpages could be much more powerful than traditional webpages for news display. It was true that web-based programs were thriving for a time. But the advent of Apps on smart phones crushed Google's dream and the Chrome web store stalled in its development.\n\nIt is sad to say that in fact many Apps are fundamentally webpages in a browser which is just encapsulated as an App, including this Reddit App I'm writing with. Sometimes it is annoying to get a notification when you try to click on a hyperlink in an App's interface, prompting you to open the page in a \"real\" web browser. I must admit that it would be much smoother if only everything could be done in Chrome.", "created_utc": "1659856617.0", "edited": "1659857547.0", "id": "ija9mih", "is_submitter": "True", "link_id": "t3_wi5j9b", "parent_id": "t1_ij9yxjf", "score": "2", "subreddit": "chromeos", "subreddit_id": "t5_2r1wh"}, {"author": "Ovaltine888", "body": "Very true.\n\nEven Windows Edge, which was once considered one of the best epub readers on desktop, abandoned the function after it switched to chrome core. I don't know why.", "created_utc": "1659712037.0", "edited": "False", "id": "ij293fc", "is_submitter": "True", "link_id": "t3_wgu1e6", "parent_id": "t1_ij28l6u", "score": "6", "subreddit": "chromeos", "subreddit_id": "t5_2r1wh"}, {"author": "Ovaltine888", "body": "I'm not sure what an empty iconless desktop is for. (Just for showing the wallpaper ?)Frankly speaking, my windows desktop is always a mess of icons.", "created_utc": "1659701233.0", "edited": "False", "id": "ij1kvqy", "is_submitter": "False", "link_id": "t3_wgfpzj", "parent_id": "t3_wgfpzj", "score": "0", "subreddit": "chromeos", "subreddit_id": "t5_2r1wh"}, {"author": "Ovaltine888", "body": "I got to say the slug reminds me of the terminator model T1000. Do you have the same feeling?", "created_utc": "1656642293.0", "edited": "False", "id": "ieeheno", "is_submitter": "False", "link_id": "t3_vo2aac", "parent_id": "t3_vo2aac", "score": "1", "subreddit": "NatureIsFuckingLit", "subreddit_id": "t5_3gdh7"}, {"author": "Ovaltine888", "body": "I had recommended this app to my ten year old daughter for her language learning. But later on I asked her to uninstall it from her phone.", "created_utc": "1656576495.0", "edited": "False", "id": "ieal42k", "is_submitter": "False", "link_id": "t3_vndzn8", "parent_id": "t3_vndzn8", "score": "1", "subreddit": "clozemaster", "subreddit_id": "t5_3eofv"}, {"author": "Ovaltine888", "body": "I'm using Penoval USI 702 with my new bought Lenovo flex 5i. It works fine in general. The only latency is found when using the android notetaking App Flexcil but I believe it is due to the lack of optimization for ChromeOS of the App itself.", "created_utc": "1655781483.0", "edited": "False", "id": "id525vy", "is_submitter": "False", "link_id": "t3_vgyzqb", "parent_id": "t3_vgyzqb", "score": "4", "subreddit": "chromeos", "subreddit_id": "t5_2r1wh"}, {"author": "Ovaltine888", "body": "Thanks, you did a great explanation but it is exactly where my confusion comes from if you consider \"faire+verb\" is always passive voice as \"having something done\". \n\nThe good example is \"faire manger le bébé\", it would be \"have the baby eaten\", but actually in this case it should be \"have the baby eat\".", "created_utc": "1648105651.0", "edited": "False", "id": "i1wia0h", "is_submitter": "True", "link_id": "t3_tkz6ei", "parent_id": "t1_i1wbqzp", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "OK maybe cook is not a perfect example but repair is.\n\"Faire réparer la voiture\"\nThe car definitely cannot do the repair action, right. It has to be used passive in such sentence in English.\n\nYou are right it is pointless to look for every equivalent in French, but I am trying to figure out the logical patterns since French also has similar passive voice structure.\n\nSo I take that in French you think \"faire manger le bébé\" and \"faire réparer la voiture\" are both active actions. C'est le bébé qui mange et c'est la voiture qui répare.", "created_utc": "1648092768.0", "edited": "False", "id": "i1vz6le", "is_submitter": "True", "link_id": "t3_tkz6ei", "parent_id": "t1_i1vt3sv", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "The point is that \"I have the car repaired\", you are using repaired (past participle) in English to indicate a passive action that the car \"is repaired\", but not the car does the reparation.\n\n\"I have the baby eat.\" You are not using \"eaten\" because it is not passive, it's the baby who eats.\n\nBut in the same case in French, \"faire cuire la repas\" and \"faire cuire le bébé\" you are using both indefintives, but obviously one action is passive and the other is active. That is what confuses me.\n\nOr maybe in French you consider them both active.", "created_utc": "1648091020.0", "edited": "1648091538.0", "id": "i1vvt5i", "is_submitter": "True", "link_id": "t3_tkz6ei", "parent_id": "t1_i1vk3pi", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": ">The \"faire + \\[verb\\]\" pattern simply means to cause something to \\[verb\\].\n\nIn this way, \"faire cuire le rapas\", it means \"cause the meal to cook\", correct? But in English, meal can't \"cook\", it can only \"be cooked\". It has to be someone else who cooks the meal but not the meal iteslf.\n\nI think this is something confusing me.", "created_utc": "1648084707.0", "edited": "False", "id": "i1vibc7", "is_submitter": "True", "link_id": "t3_tkz6ei", "parent_id": "t1_i1uukye", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "I'm still kind of confused.\n\nLet's say the pattern is \"faire+verbe+qqc/qqn\".\n\n>You can add \"faire\" to ANY verb to express that it is not you doing the action but you are making something or someone else do it.\n\nYou said it is used to express something or someone else does the action, but WHO EXACTLY is \"something or someone else\" that does the action?\n\nWhat is the role of qqc/qqn in this pattern? Is it the subject or object of the \"verbe\"?\n\nFor example, \"faire cuire le rapas\" , as you said, \"cuire le rapas\" also sounds correct. Apparently, \"cuire\" in \"cuire le rapas\" is transitive and \"le rapas\" is its object. But what about in \"faire cuire le rapas\"? WHO EXACTLY cuire le rapas if you put faire with it?\n\nIn English, I take \"faire cuire le rapas\" is like \"have/get the meal cooked\", can I say in this way? But you see the verb \"cooked\" is past participle because it is not the meal that \"cooks\" but the meal \"is cooked\" (The meal is not the subject but the object of the verb cook) It is someone else (not specifed) who cooks the meal.\n\nLet's go back to \"faire cuire le repas\". If I understand it as \"faire (qqn) cuire le repas\" --make (someone else) cook the meal, is that correct?\n\nIf it is right, then it is really weird to hear \"faire manger le bebe\" because it will become \"make (someone else) eat the baby\"???", "created_utc": "1648083732.0", "edited": "1648085114.0", "id": "i1vg4iw", "is_submitter": "True", "link_id": "t3_tkz6ei", "parent_id": "t1_i1tfp97", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "i notice d that too. It seems it doesn't really align with the description of the \"most difficult word in the sentence\" as the blank.", "created_utc": "1648077642.0", "edited": "False", "id": "i1v2ajr", "is_submitter": "False", "link_id": "t3_rao05y", "parent_id": "t3_rao05y", "score": "1", "subreddit": "clozemaster", "subreddit_id": "t5_3eofv"}, {"author": "Ovaltine888", "body": "I think a post of this tall will lose stiffness and curl like a noodle. Just imagine the long rebars already found bent on the truck. Otherwise you will need a really huge base", "created_utc": "1647762730.0", "edited": "False", "id": "i1dpcqt", "is_submitter": "False", "link_id": "t3_tifhcm", "parent_id": "t3_tifhcm", "score": "2", "subreddit": "nextfuckinglevel", "subreddit_id": "t5_m0bnr"}, {"author": "Ovaltine888", "body": "What I noticed was that this man was doing this with bare hands and I even saw wound on one of his fingers...how brave he is!", "created_utc": "1643975714.0", "edited": "False", "id": "hvjubaj", "is_submitter": "False", "link_id": "t3_sjnr2i", "parent_id": "t3_sjnr2i", "score": "1", "subreddit": "Damnthatsinteresting", "subreddit_id": "t5_2xxyj"}, {"author": "Ovaltine888", "body": "1 on 1？how much do you charge？", "created_utc": "1643876734.0", "edited": "False", "id": "hvea1ix", "is_submitter": "False", "link_id": "t3_sjcgkp", "parent_id": "t3_sjcgkp", "score": "4", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "I'm a native Chinese speaker but I have no idea where the suddenly comes from.", "created_utc": "1643864912.0", "edited": "False", "id": "hvdrhh6", "is_submitter": "False", "link_id": "t3_sj0u6v", "parent_id": "t1_hvdr4x2", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "where is the sudden country coming from？", "created_utc": "1643853591.0", "edited": "False", "id": "hvd2beu", "is_submitter": "False", "link_id": "t3_sj0u6v", "parent_id": "t3_sj0u6v", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "wow grazie mille!", "created_utc": "1641531392.0", "edited": "False", "id": "hrlibff", "is_submitter": "True", "link_id": "t3_rxvthz", "parent_id": "t1_hrl28nv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "the fact is that most of the Chinese dialects do not have a writing system.", "created_utc": "1640540581.0", "edited": "False", "id": "hq1ob9m", "is_submitter": "False", "link_id": "t3_rml0ml", "parent_id": "t3_rml0ml", "score": "2", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "Ovaltine888", "body": "how many words on average do you need to look up on each page?", "created_utc": "1639294554.0", "edited": "False", "id": "ho81cf3", "is_submitter": "True", "link_id": "t3_rcg1w2", "parent_id": "t1_hnxe11x", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "Well, actually I'm working on French and have passed 5k most common words and heading towards 10k on the app Clozemaster.\n\nI just noticed that some people posted screenshots of 100% accomplishment (up to 50k words and more) on the app but still claimed to be at like B1 level. That is why I am asking this question as I myself feel it is a waste of time.", "created_utc": "1639065646.0", "edited": "1639097522.0", "id": "hnv55i1", "is_submitter": "True", "link_id": "t3_rcg1w2", "parent_id": "t3_rcg1w2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "What's the difference? Can you elaborate a bit?", "created_utc": "1637753854.0", "edited": "False", "id": "hlw1ot5", "is_submitter": "True", "link_id": "t3_r0vrl8", "parent_id": "t1_hlvor6t", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "I was referring to the 3 groups of verbs in French.\n\n1st group: verbs ending with -ER\n\n2nd group: verbs ending with -IR\n\n3rd group: irregular verbs\n\nVerbs in each group have the same pattern of conjugation. But there are also exceptions and irregular ones, which makes the patterns more complicated. \n\nI have learned it through and spent hours on grammar practice too. I can understand the conjugation when I read it and I can even get 80-90% correct in conjugation MCQ. \n\nThe issue is that I am still not good at reproducing it. I know the rules and patterns but they are not crystal clear in my head. I'm still slow and sometimes confused when I need to make my own sentences.\n\nI think you are right that I need to do more output exercises like writing a short story of my own or summarizing a story I just read, or simply asking myself how to say something in French.", "created_utc": "1637753019.0", "edited": "False", "id": "hlw0jhv", "is_submitter": "True", "link_id": "t3_r0vrl8", "parent_id": "t1_hlvjmlk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "Yes, i do understand when I read it. \nActually I have already learned even more advanced grammar forms such as conditional and subjunctive conjugations. The problem is that they are not solid in my head.\n\nI can guess the tense or conjugation from the spelling and context i read. But i cannot make a same sentence immediately on my own. i still need more time to organize the structure and look up in the conjugation table to produce a correct sentence.\n\nWhen it comes to conversations, where conjugation difference is not obvious without seeing the text, i will be easily lost in instant comprehension and response.", "created_utc": "1637738188.0", "edited": "1637738993.0", "id": "hlvhz7v", "is_submitter": "True", "link_id": "t3_r0vrl8", "parent_id": "t1_hlvgl6j", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "Actually, in most cases i can recognize the tenses in general while reading, but my brain is just reluctant to analyze and remember the exact structure (for example where reflective is needed) or conjugation (which group the verb belongs to) . it results that I am weak in listening without visual input and i struggle to produce correct sentences by myself.\n\nSometimes, I feel that i am using my english vocabulary to understand French words. I am worried that it may not help my French learning. Maybe you can understand what i am saying as you are a native English speaker.", "created_utc": "1637736473.0", "edited": "1637737109.0", "id": "hlvfizx", "is_submitter": "True", "link_id": "t3_r0vrl8", "parent_id": "t1_hlvadwc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "I have no doubt about the number of books you have to read before you become really comfortable with reading. The exposure is essential to language learning.\n\nBut I m curious how you read before that level. From my experience, it needs a lot of lookups and the progress is slow as it may take weeks or months to finish a simple book.", "created_utc": "1637719479.0", "edited": "False", "id": "hlujos0", "is_submitter": "False", "link_id": "t3_r05860", "parent_id": "t1_hlr3mlx", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "为什么他还能说这样的话，不要命了吗？", "created_utc": "1633996459.0", "edited": "False", "id": "hgahux3", "is_submitter": "False", "link_id": "t3_q5xw99", "parent_id": "t3_q5xw99", "score": "15", "subreddit": "China_irl", "subreddit_id": "t5_x72uq"}, {"author": "Ovaltine888", "body": "Language transfer", "created_utc": "1632351857.0", "edited": "False", "id": "hdwbvnv", "is_submitter": "False", "link_id": "t3_pt5jv2", "parent_id": "t3_pt5jv2", "score": "3", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": ">**Having separated from Malay-majority Malaysia in 1965**, the easiest path for Lee Kuan Yew and his colleagues would have been to base their political legitimacy on the Chinese majority in Singapore. \n\nThis is a \"*dangling modifier*\", isn't it? The sentence is not even grammatically correct.", "created_utc": "1629689932.0", "edited": "False", "id": "h9zpv25", "is_submitter": "False", "link_id": "t3_p7wayu", "parent_id": "t1_h9n2jse", "score": "4", "subreddit": "singapore", "subreddit_id": "t5_2qh8c"}, {"author": "Ovaltine888", "body": "is it a paid feature?", "created_utc": "1627779591.0", "edited": "False", "id": "h79hrgi", "is_submitter": "False", "link_id": "t3_o5qb05", "parent_id": "t3_o5qb05", "score": "2", "subreddit": "clozemaster", "subreddit_id": "t5_3eofv"}, {"author": "Ovaltine888", "body": "say the four-letter word sh\\*t two times...", "created_utc": "1626772442.0", "edited": "False", "id": "h5utkp5", "is_submitter": "False", "link_id": "t3_onwqvy", "parent_id": "t3_onwqvy", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "> ghosting out of nowhere\n\nwhat do you mean by ghosting out of nowhere?", "created_utc": "1626012418.0", "edited": "False", "id": "h4t59bz", "is_submitter": "False", "link_id": "t3_ohxoyv", "parent_id": "t1_h4sstny", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "How do those \"polyglots\" on YouTube manage to do that then?\n\nLike talking to random people and recording the video.", "created_utc": "1625913841.0", "edited": "False", "id": "h4otsh0", "is_submitter": "False", "link_id": "t3_ohf8wk", "parent_id": "t3_ohf8wk", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "Thanks for the reply.\n\nWould you please take a minute to read my own comment?", "created_utc": "1625849162.0", "edited": "False", "id": "h4lwzpe", "is_submitter": "True", "link_id": "t3_ogpz3l", "parent_id": "t1_h4lh92v", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "Thanks for all the comments above.\n\nActually, I am comparing my own learning curve of French with the one of English.\n\n//English\n\nI spent about 10 years learning English at school. But in the early times, there were not so many audio resources available like today and apparently my ears were not well trained then. Although my reading was already strong enough, I felt like my listening stuck in the A range for a long time and I struggled to understand all kinds of English audio at standard speed. (Let's call it stage 1)\n\nAfter graduation, with access to more resources on the Internet, I started to intentionally hone my listening skill by exposing myself to movies, TV series, podcasts and news radios. I think I made some progress into a weak B range in listening, not that satisfactory though. (Let's call it stage 2)\n\nI think the real breakthrough occurred after I took on the responsibility to handle international clients at work and started to engage myself in English communication during work time. As of now, I believe my English listening has reached the C range. (Let's call it stage 3)\n\nThe problem is that, the stages 2 & 3 add up to take more than 10 years. Plus the 10 years at school to reach stage 1, it took me 20 years to reach where I am today. That is quite a long time.\n\n//French\n\nAs of today, I have been learning French for 10 months. The online resources gave me a quick start. I feel like I am in \"stage 1\" already. But I found my French listening still falling behind, while my French reading is better.\n\nI know I have succeeded in training my English ears, but my own experience seems to be way too time consuming. My concern is whether I still need another 10 years to level up my French listening to at least a B2 level???", "created_utc": "1625848511.0", "edited": "1625848976.0", "id": "h4lvij0", "is_submitter": "True", "link_id": "t3_ogpz3l", "parent_id": "t3_ogpz3l", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "Sure, I have messaged you.", "created_utc": "1625227015.0", "edited": "False", "id": "h3smhn2", "is_submitter": "True", "link_id": "t3_mg8nlv", "parent_id": "t1_h3skmp6", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Ovaltine888", "body": "I don't really see a strong motivation for the person who goes to dabao for neighbours. I think most people would not bother doing so just for a pittance, unless they decide to earn a living out of it.", "created_utc": "1622189631.0", "edited": "False", "id": "gzqivb2", "is_submitter": "False", "link_id": "t3_nm4ad0", "parent_id": "t3_nm4ad0", "score": "1", "subreddit": "singapore", "subreddit_id": "t5_2qh8c"}, {"author": "Ovaltine888", "body": "What changes in the sentences did you make? \n\nI cannot tell the difference from the original sentences.", "created_utc": "1620050877.0", "edited": "False", "id": "gws9318", "is_submitter": "False", "link_id": "t3_n3uvo2", "parent_id": "t1_gwry8ck", "score": "2", "subreddit": "frenchhelp", "subreddit_id": "t5_30wct"}, {"author": "Ovaltine888", "body": "I think the benefit of using a monolingual dictionary is that you learn how to describe things with simple vocabulary in your target language. Many language learners may know a lot of advanced words but are not able to describe things like an eight year old kid.", "created_utc": "1614904436.0", "edited": "False", "id": "gppvvub", "is_submitter": "False", "link_id": "t3_lxurpy", "parent_id": "t3_lxurpy", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "it is very likely to feel frustrated if you try to listen to a podcast when you are just at the beginner level. The truth is that you can hardly understand it because of the limited vocab you have even if you are given the transcript. Not to mention listening is a big leap from reading as it involves in audio recognition.\n\nDuolingo podcast is a super resource with bilingual narration and full transcript, But it is still too hard for beginners.\n\nI would suggest coffee break French season one which starts with chunks of French Instead of full conversation. It is more suitable to beginners though the script is not free.", "created_utc": "1614066256.0", "edited": "False", "id": "gofsv8z", "is_submitter": "False", "link_id": "t3_lpt6xb", "parent_id": "t3_lpt6xb", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "Then, in the sentence tout est de ma faute.\nIs de a préposition or a déterminant?", "created_utc": "1613959418.0", "edited": "False", "id": "goalujf", "is_submitter": "True", "link_id": "t3_lpbmu2", "parent_id": "t1_goalekq", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "Well, that's what confused me.\n\nFor example, in English when you say A is B, you don't add other prepositions. But in French, i found sometimes you say A être B, and sometimes you have to say A être de B. But what is the rule here?\n\nIt's my fault.\nc'est DE ma faute.", "created_utc": "1613958678.0", "edited": "False", "id": "goakfet", "is_submitter": "True", "link_id": "t3_lpbmu2", "parent_id": "t1_goajiw0", "score": "1", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "I go for paper vampire\\~", "created_utc": "1612674333.0", "edited": "False", "id": "gmceoqh", "is_submitter": "False", "link_id": "t3_le0srt", "parent_id": "t3_le0srt", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "https://www.amazon.com/Short-Stories-French-Beginners-Yourself/dp/1473683432\n\n[short stories french beginners](https://www.amazon.com/Short-Stories-French-Beginners-Yourself/dp/1473683432)", "created_utc": "1612311944.0", "edited": "False", "id": "glswq0s", "is_submitter": "False", "link_id": "t3_lb70h0", "parent_id": "t3_lb70h0", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "I'm not saying i have reached C1 level in 3 months. I am still short of vocabulary and terribe in listening. But in terms of grammar, it's true that i have gone through all levels on kwizq.com. I did put a lot of effort into it. I spent hours every day on the quizzes of the website and it paid off.\nNow I still take the quizzes from time to time and get them correctly at a rate about 8-10 out of 10.\n\nIt allows me to understand most of the sentence structures which greatly benifits me in reading proficiency. So i am now able to concentrate on the new words and expressions while reading.", "created_utc": "1611877366.0", "edited": "False", "id": "gl5xyi7", "is_submitter": "False", "link_id": "t3_l6r9fj", "parent_id": "t1_gl5dg9j", "score": "3", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "donc peut le feu bouillir de l'eau?\n\nLe feu n'est pas assez fort pour bouillir l'eau. \n\nIs the sentence correct?", "created_utc": "1611833564.0", "edited": "False", "id": "gl2qhzg", "is_submitter": "True", "link_id": "t3_l6lf8q", "parent_id": "t1_gl1hm5m", "score": "3", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "If you are willing to spend money and time on practice, I will recommend [kwiziq.com](https://kwiziq.com). (I have completely ditched Duolingo.) I mastered all the French grammar claiming to be from A0-C1 to a comfortable proficiency in 3 months with the help of its question bank. Now I'm able to read simple French stories and it is the 4th month since I started my French learning journey from zero. But I'm still struggling in listening and speaking, I think this part takes time.", "created_utc": "1611829880.0", "edited": "1611834157.0", "id": "gl2lsos", "is_submitter": "False", "link_id": "t3_l6r9fj", "parent_id": "t3_l6r9fj", "score": "11", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}, {"author": "Ovaltine888", "body": "how long are the audios? An audio of a word, a sentence or a whole conversation or passage?", "created_utc": "1611546544.0", "edited": "False", "id": "gko78hf", "is_submitter": "True", "link_id": "t3_l4dywu", "parent_id": "t1_gko44jl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Ovaltine888", "body": "And i also working on the pre-made deck of the 5000 most common French words.", "created_utc": "1611539383.0", "edited": "False", "id": "gkntj8l", "is_submitter": "True", "link_id": "t3_l4cytx", "parent_id": "t1_gknta62", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Ovaltine888", "body": "Yes i do. I am using it to record new words i saw in reading.", "created_utc": "1611539255.0", "edited": "False", "id": "gknta62", "is_submitter": "True", "link_id": "t3_l4cytx", "parent_id": "t1_gknsyrg", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "Ovaltine888", "body": "But in this case, why can't it be \"combien coûte-ça?\"\n\nIsn't it a Even more way of a question structure?", "created_utc": "1611535543.0", "edited": "False", "id": "gknlydc", "is_submitter": "False", "link_id": "t3_l3w5gs", "parent_id": "t3_l3w5gs", "score": "2", "subreddit": "learnfrench", "subreddit_id": "t5_2sucz"}]