[{"author": "p40ev1d4", "body": "I suppose that might have helped, but I find it hard to understand how digressing a bit from the point can have such a bit impact on grades. But that's another question, I suppose... thank you for your input :)", "created_utc": "1665406818.0", "edited": "False", "id": "irr878n", "is_submitter": "True", "link_id": "t3_y0beqs", "parent_id": "t1_irr5dw0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "p40ev1d4", "body": "I think 191\nIt’s a bit sad, I studied a lot and really think I did not deserve this grade. I’m wondering if I did something wrong like writing over the lines or writing where I shouldn’t have or something of the sorts", "created_utc": "1665405050.0", "edited": "False", "id": "irr4yj5", "is_submitter": "True", "link_id": "t3_y0beqs", "parent_id": "t1_irr38lv", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "p40ev1d4", "body": "Estou mais a questionar sobre a forma de fazer o exame, se correu mal por alguma razão técnica, se foi cancelado por suspeita de alguma coisa, algo desse género...\n\nMas já agora, posso perguntar onde estudaste?", "created_utc": "1660594053.0", "edited": "False", "id": "ikfdh4x", "is_submitter": "True", "link_id": "t3_wotyrq", "parent_id": "t1_ikefas8", "score": "1", "subreddit": "PortugalLaFora", "subreddit_id": "t5_fefcn"}, {"author": "p40ev1d4", "body": "Alguns pedem para todos os alunos, outros só pedem para pessoal fora da UE, mas recomendam aos outros na mesma, então acho que devia tentar pelo sim pelo não", "created_utc": "1660586901.0", "edited": "False", "id": "ikeus35", "is_submitter": "True", "link_id": "t3_wotyrq", "parent_id": "t1_ikdnw52", "score": "1", "subreddit": "PortugalLaFora", "subreddit_id": "t5_fefcn"}, {"author": "p40ev1d4", "body": "Tive uma cadeira de introdução há algum tempo, foi das minhas preferidas, se for alguma coisa simples acho que posso tentar ajudar", "created_utc": "1655111484.0", "edited": "False", "id": "ic6n7re", "is_submitter": "False", "link_id": "t3_vb5erz", "parent_id": "t3_vb5erz", "score": "2", "subreddit": "devpt", "subreddit_id": "t5_3838x"}, {"author": "p40ev1d4", "body": "Se eu pedir o documento em inglês à UA isso não conta como uma tradução por pessoas autorizadas?", "created_utc": "1652511352.0", "edited": "False", "id": "i8jub63", "is_submitter": "True", "link_id": "t3_uomimi", "parent_id": "t1_i8idj8d", "score": "1", "subreddit": "aveiro", "subreddit_id": "t5_2tbkp"}, {"author": "p40ev1d4", "body": "I couldn't find any software that I thought was adequate for this, if anyone has any suggestions please let me know :)", "created_utc": "1650995631.0", "edited": "False", "id": "i6am324", "is_submitter": "True", "link_id": "t3_ubx8rd", "parent_id": "t1_i6alc7a", "score": "1", "subreddit": "FPGA", "subreddit_id": "t5_2sf3o"}, {"author": "p40ev1d4", "body": "That makes sense! Do you know if there's any way I can produce a circuit similar to the one in the book?", "created_utc": "1650994972.0", "edited": "False", "id": "i6akdg2", "is_submitter": "True", "link_id": "t3_ubx8rd", "parent_id": "t1_i6782rl", "score": "2", "subreddit": "FPGA", "subreddit_id": "t5_2sf3o"}, {"author": "p40ev1d4", "body": "That does make sense, but do you know how I can find a circuit similar to the one shown in the book? All my searches lead me to this RTL view and I'm lost at this point", "created_utc": "1650994932.0", "edited": "False", "id": "i6ak9qa", "is_submitter": "True", "link_id": "t3_ubx8rd", "parent_id": "t1_i67g4ia", "score": "2", "subreddit": "FPGA", "subreddit_id": "t5_2sf3o"}, {"author": "p40ev1d4", "body": "Yeah, I know what I want is sort of useless... but I'm not really thinking in terms of FPGA's, my goal is just to learn more about digital design and an easy way to optimize logic circuits using simple logic gates", "created_utc": "1650994863.0", "edited": "False", "id": "i6ak36j", "is_submitter": "True", "link_id": "t3_ubx8rd", "parent_id": "t1_i68nvw2", "score": "1", "subreddit": "FPGA", "subreddit_id": "t5_2sf3o"}, {"author": "p40ev1d4", "body": "I’m interested! :)", "created_utc": "1646603768.0", "edited": "False", "id": "hzmlc3n", "is_submitter": "False", "link_id": "t3_t7tzsw", "parent_id": "t3_t7tzsw", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "p40ev1d4", "body": "Couldn’t describe him better", "created_utc": "1644357998.0", "edited": "False", "id": "hw5483y", "is_submitter": "True", "link_id": "t3_snw0rb", "parent_id": "t1_hw54458", "score": "1", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "p40ev1d4", "body": "I know right haha", "created_utc": "1644357556.0", "edited": "False", "id": "hw531lf", "is_submitter": "True", "link_id": "t3_snw0rb", "parent_id": "t1_hw52qle", "score": "1", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "p40ev1d4", "body": "Sim é capaz de ser isso haha\nA ideia que eu tinha dos ultra leves era diferente, mas vi no Google e deve ser. De longe parecia uma asa delta mas com rodinhas e com um motor", "created_utc": "1644188874.0", "edited": "False", "id": "hvvfksv", "is_submitter": "True", "link_id": "t3_sm1gzu", "parent_id": "t1_hvv74tl", "score": "1", "subreddit": "aveiro", "subreddit_id": "t5_2tbkp"}, {"author": "p40ev1d4", "body": "You definitely should. My cat also does this and he is broken. He even likes the little cozy box in the scratcher post. \n\nWarning: [cute broken cat ahead (meet Tareco)](https://imgur.com/a/65iXX6Z)", "created_utc": "1643498458.0", "edited": "False", "id": "hus4tge", "is_submitter": "False", "link_id": "t3_sft6kj", "parent_id": "t3_sft6kj", "score": "2", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "p40ev1d4", "body": "It’s sad that they have to live in constant fear but at least she seems happy with the 1st cat haha", "created_utc": "1643497467.0", "edited": "False", "id": "hus2k6p", "is_submitter": "True", "link_id": "t3_sftx0a", "parent_id": "t1_hus23ly", "score": "1", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "p40ev1d4", "body": "I’m glad to know! Yeah I’m hopeful this will happen too, thanks for sharing your experience!! ☺️", "created_utc": "1643497377.0", "edited": "False", "id": "hus2cwc", "is_submitter": "True", "link_id": "t3_sftx0a", "parent_id": "t1_hus1f7s", "score": "1", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "p40ev1d4", "body": "That does sound like an horrible experience… I am also wondering how this baby ended up there, and the things she must have been through, but you are right :) \nI just worry that I might be doing something wrong, I don’t know, for example, if I should try to pet her even though she clearly does not likes the ideia (but then ends up accepting - and maybe even enjoying - it)", "created_utc": "1643496783.0", "edited": "False", "id": "hus0za6", "is_submitter": "True", "link_id": "t3_sftx0a", "parent_id": "t1_hus0ern", "score": "2", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "p40ev1d4", "body": "My mother found this cutie pie almost dying in her backyard a month and a half ago. She was very very skinny and scared. My mom was able to pick her and brought her home to a warm room where she has been ever since, with two other cats. She now has the softest fur I have ever touched.\n\nHowever, she is still very scared of everyone - but not of the cats. If someone gets close to her she starts retreating and trying to escape or hissing. She does not scratch nor bite anyone, and I was even able to put her in my lap and pet her for quite some time (and she looked relaxed)! But even after this she still hates everyone. After more than a month of feeding her and showing love for her, I thought that she would be less afraid of us.\n\nDoes anyone have any advice on what to do? Thank you!", "created_utc": "1643496486.0", "edited": "False", "id": "hus0adu", "is_submitter": "True", "link_id": "t3_sftx0a", "parent_id": "t3_sftx0a", "score": "2", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "p40ev1d4", "body": "It is one of my favourite books! I really recommend it", "created_utc": "1636926271.0", "edited": "False", "id": "hkn3761", "is_submitter": "False", "link_id": "t3_qtwsc6", "parent_id": "t1_hkmeugn", "score": "11", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "p40ev1d4", "body": "Caminhão", "created_utc": "1620852419.0", "edited": "False", "id": "gxwefbt", "is_submitter": "False", "link_id": "t3_nascwx", "parent_id": "t3_nascwx", "score": "11", "subreddit": "Chamem_a_padeira", "subreddit_id": "t5_2c1xuy"}, {"author": "p40ev1d4", "body": "It’s kind of funny that when I was in primary school I didn’t like the word “stor” for some reason. I always wondered the reason why some kids used it. Nowadays, even though I’m in the third year of university, I use it all the time. It is indeed a very informal way of referring to teachers so I only use it when I have some kind of feeling that they won’t be offended by it, which is usually the case. I’m pretty sure that I’m one of the only people who calls them that but they all seem to like me so I keep on doing that hahah. As for “prof”, it is not very  (not sure if I ever heard anyone calling a teacher by that name).", "created_utc": "1599149270.0", "edited": "False", "id": "g3v39rs", "is_submitter": "False", "link_id": "t3_iljco2", "parent_id": "t3_iljco2", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "p40ev1d4", "body": "Please let me know as well if you can, I really enjoyed this!!", "created_utc": "1598816078.0", "edited": "False", "id": "g3e0jnq", "is_submitter": "False", "link_id": "t3_iicn3n", "parent_id": "t1_g37p2av", "score": "2", "subreddit": "ukulele", "subreddit_id": "t5_2qltz"}, {"author": "p40ev1d4", "body": "I think he was referring to the fact that there might not be the best drivers or something like that...", "created_utc": "1595372087.0", "edited": "False", "id": "fytdkop", "is_submitter": "True", "link_id": "t3_hvceek", "parent_id": "t1_fyszgbs", "score": "1", "subreddit": "laptops", "subreddit_id": "t5_2qoip"}, {"author": "p40ev1d4", "body": "No, I think everyone here in Portugal starts to learn English in grades 1, 2 or 3 for some reason.\n\nWhen talking on the phone it isn't quite as weird, but when someone is looking at you when you are thinking about what to say, it's very difficult to think straight hahaha. And don't get me started on what it is like during oral English exams. Now those are just complete hell haha. I just feel very judged if I say something in a weird way, don't know why... I know that we should just worry about getting our point to the other person, but I always try to change the way I'm saying things in order to use more comfortable terms and such (in order not to make mistakes - even though it obviously doesn't always work), and this is difficult to achieve when you're talking with someone face to face. With texting, you have plenty of time to change the way you're trying to say something.\n\nI'm not really sure how much of a requirement for jobs in Portugal English is since I'm actually a student. As a student, I don't think it is really important (although, at least for what I'm studying, it would be almost impossible to finish the degree with decent grades if you don't know any English, just for the fact that there is so much/better information written in English). Besides that, I have barely spoken any English here, but I can imagine that those who live in big cities have (which is not my case).\n\nBooks in Portuguese are indeed a lot more expensive, but it is clear to see why once you pick one up. The pages, the cover, almost everything overall look more expensive than the \"common\" paperback books written in English.  Books here have A LOT of whitespace in the pages, which are also bigger (and they use bigger fonts as well) and thicker, most of the time. I'm absolutely not sure if this is the only reason, but it certainly is a reason that explains the increase in prices.", "created_utc": "1595355914.0", "edited": "False", "id": "fysgmfx", "is_submitter": "False", "link_id": "t3_hmaebr", "parent_id": "t1_fydhiii", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "p40ev1d4", "body": "I’m curious about what you mean by “no capacity for romance”", "created_utc": "1595098656.0", "edited": "False", "id": "fyhjbjd", "is_submitter": "False", "link_id": "t3_htgg0f", "parent_id": "t1_fyh90wq", "score": "9", "subreddit": "AskMen", "subreddit_id": "t5_2s30g"}, {"author": "p40ev1d4", "body": "Yes I was too young, I feel like I only started to learn anything in 5th grade (I was ~10 years old). I remember that before that we only learned the letters and how to pronounce them, that sort of thing...\nAbout the searches, they were just random questions from what I can remember, nothing too specific. \nMovies and such, everything I could find had PT-BR subtitles (and still were hard to find) and I don’t mean to offend anyone but I don’t really love reading things in PT-BR (I’m from Portugal). Besides, I found that websites with free movies with English/no subtitles had way less adds and publicity than with PT subtitles, while also having more variety/quality (not trying to promote any kind of piracy but Netflix didn’t even exist back then - at least not here haha)\nI think I have difficulty speaking because I’m a bit anxious and sometimes I want to say something but I need to think for a bit to find out the best way to say it, but then I realise that I’m taking too long to think and it’s basically a mess. Knowing the right words to use in a real face-to-face situation is nothing like chatting over text.\n\nAnd in the meantime I remembered another big reason and incentive for me to learn English: books are way way cheaper in English than in Portuguese (the difference is really absurd sometimes) besides being more interesting to actually read a book in its original language (if the writers are from English speaking countries, of course). So now the only books I read in PT are from authors from Portuguese speaking countries.", "created_utc": "1594242066.0", "edited": "False", "id": "fxcr33k", "is_submitter": "False", "link_id": "t3_hmaebr", "parent_id": "t1_fxbhk16", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "p40ev1d4", "body": "I’ve been “learning” English since before I knew how to write, in the 1st grade (of course I didn’t learn anything back then but still). My main motivation some time ago was just to be able to understand English songs and be able to sing them (it sounds stupid but it helped a lot). Then I realised that searching things in English would give me better results than when I searched in my language (Portuguese), so I started doing that. Besides, there are a lot of movies and stuff like that that aren’t available with subtitles in PT, and they were so much easier to find in EN. Still after all this time I have some difficulties in speaking (not really pronunciation, more like knowing what to say/how to say it) but I’m trying to improve so that I can study abroad in the near future.", "created_utc": "1594064053.0", "edited": "False", "id": "fx4oq6v", "is_submitter": "False", "link_id": "t3_hmaebr", "parent_id": "t3_hmaebr", "score": "5", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "p40ev1d4", "body": "Yes to both questions", "created_utc": "1592705278.0", "edited": "False", "id": "fvhzgea", "is_submitter": "True", "link_id": "t3_hb0owu", "parent_id": "t1_fvc1r2z", "score": "1", "subreddit": "sennheiser", "subreddit_id": "t5_2u1fj"}, {"author": "p40ev1d4", "body": "I’d also love to do this! Although I’m not really that much of a talker haha (I’m also 19F btw!)", "created_utc": "1590347890.0", "edited": "False", "id": "froz416", "is_submitter": "False", "link_id": "t3_gpu0th", "parent_id": "t3_gpu0th", "score": "1", "subreddit": "penpals", "subreddit_id": "t5_2r076"}, {"author": "p40ev1d4", "body": "I also was mentally abused (although maybe not as much as you) when I was younger, and I too cried every night (and still do somewhat often). My mother also enforces religion on me and wants me to think like her in ways that I don’t think it’s fair.\nWhat keeps me hanging on is the thought that one day I’ll be able to leave home and be alone by myself. I truly think about this almost every day, it is in fact my motivation to get good grades in this very stressful time.\nYou just hang on for a little longer and everything will get better!\nAlso, I’m studying computer science and I’m a very good student (because of the reason I mentioned above), if you need help with anything or just want to talk, you can dm me!\nHope you find a way through this!!", "created_utc": "1590341148.0", "edited": "False", "id": "frolsiu", "is_submitter": "False", "link_id": "t3_gppa9t", "parent_id": "t3_gppa9t", "score": "5", "subreddit": "depressed", "subreddit_id": "t5_2r8rq"}, {"author": "p40ev1d4", "body": "Personally I do agree with you, although there are more suitable cases. I am definitely positive that the actions my mom has done towards me contributed to me being the way I am (read: depressed and with self-esteem problems and not able to have proper relationships - not ontem romantic ones, but also friendships), but I love her in someway and wouldn’t want the society to judge her nevertheless\nBut keep in mind that this is my case and I am definitely aware that there are moms way way worse than mine, unfortunately", "created_utc": "1590340743.0", "edited": "False", "id": "frokybg", "is_submitter": "False", "link_id": "t3_gpmokk", "parent_id": "t3_gpmokk", "score": "2", "subreddit": "offmychest", "subreddit_id": "t5_2ranw"}, {"author": "p40ev1d4", "body": "From my experience, girls are the worst (and I’m one!). Classes full of girls are an absolute nightmare, I’d be much more drawn to enrol in a place where there would be less girls than boys.  In my degree there are around 8/9 girls to around 50 guys and I’m only friends with one of them (I don’t hate the others, we just don’t know each other very well).\nBut then again, this is just my opinion and I don’t even attend TUDelft (although I’d like to one day c: ), I just wanted to say this for some reason haha", "created_utc": "1590087305.0", "edited": "False", "id": "frdc4b7", "is_submitter": "False", "link_id": "t3_gnompj", "parent_id": "t3_gnompj", "score": "1", "subreddit": "TUDelft", "subreddit_id": "t5_2t6ow"}, {"author": "p40ev1d4", "body": "Is there really anyone who doesn’t press Ctrl-S every time a new line is written? \nNo? \nJust me?\nOk...", "created_utc": "1589653458.0", "edited": "False", "id": "fqu7dry", "is_submitter": "False", "link_id": "t3_gksh5e", "parent_id": "t3_gksh5e", "score": "1", "subreddit": "ProgrammerHumor", "subreddit_id": "t5_2tex6"}, {"author": "p40ev1d4", "body": "I have my highschool English text books (10th and 11th year) used in Portugal... are you looking for pictures of anything specific?", "created_utc": "1587471685.0", "edited": "False", "id": "fo2qt3n", "is_submitter": "False", "link_id": "t3_g5e1i3", "parent_id": "t3_g5e1i3", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "p40ev1d4", "body": "Eu já abri esses links, eles pedem para iniciar sessão, meter a passe e assim, mas deixam entrar metas o que meteres, e depois eventualmente pedem para mandar foto do cartão de coordenadas do banco, nada sketchy mesmo. \n\nTambém não tenho conta no Montepio mas já recebi desses SMS \"deles\" pelo menos 2 vezes", "created_utc": "1585825772.0", "edited": "False", "id": "fm7g5ig", "is_submitter": "False", "link_id": "t3_fswyux", "parent_id": "t3_fswyux", "score": "1", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "p40ev1d4", "body": "I find it weird that you are by far the best student, but it totally depends on the university and course and professors... the mean of my grades is slightly above 17 and I think it’s the highest in my year (in my degree) but there are a few above 15", "created_utc": "1583068047.0", "edited": "False", "id": "fj6dbia", "is_submitter": "False", "link_id": "t3_fbfs6i", "parent_id": "t3_fbfs6i", "score": "1", "subreddit": "University", "subreddit_id": "t5_2qp3b"}, {"author": "p40ev1d4", "body": "I do feel the same way... it’s weird though... sometimes you’re happy and just waiting for something to happen...", "created_utc": "1583065621.0", "edited": "False", "id": "fj6b74b", "is_submitter": "False", "link_id": "t3_fbqy9p", "parent_id": "t3_fbqy9p", "score": "3", "subreddit": "depressed", "subreddit_id": "t5_2r8rq"}, {"author": "p40ev1d4", "body": "feel free to message me as well if you want to", "created_utc": "1581273391.0", "edited": "False", "id": "fh3xxw6", "is_submitter": "False", "link_id": "t3_f1a1k7", "parent_id": "t3_f1a1k7", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "p40ev1d4", "body": "I guess it depends a lot on the culture of where you live but in my country it would certainly be weird if we didn’t tell them how we are doing in school. That being said, we  are a lot more dependent on them, most of us live at home and when we don’t, they are the ones who pay our rent most of the times. I don’t live in my parents home although I go there almost every weekend and I feel like they know what I’ve been up to almost as they did when I was in high school\nSo I’m probably biased but they probably just want to know because they want the best for you and not because of the money per se", "created_utc": "1580177165.0", "edited": "False", "id": "ffsali0", "is_submitter": "False", "link_id": "t3_euy9hl", "parent_id": "t3_euy9hl", "score": "1", "subreddit": "University", "subreddit_id": "t5_2qp3b"}, {"author": "p40ev1d4", "body": "It is SO much worse when they do have that link and when you click on it\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nnothing happens :c", "created_utc": "1579659360.0", "edited": "False", "id": "ff7vj8l", "is_submitter": "False", "link_id": "t3_eruh1v", "parent_id": "t3_eruh1v", "score": "2", "subreddit": "AdviceAnimals", "subreddit_id": "t5_2s7tt"}, {"author": "p40ev1d4", "body": "I speak my mother tongue but there isn’t any university teaching in it... there are a lot of people who go to those universities that don’t teach in English though (without knowing anything about their language) because English is the second language of the program or something like that...", "created_utc": "1579652153.0", "edited": "False", "id": "ff7l5fz", "is_submitter": "True", "link_id": "t3_es21gc", "parent_id": "t1_ff7jmci", "score": "1", "subreddit": "Erasmus", "subreddit_id": "t5_2t1md"}, {"author": "p40ev1d4", "body": "Eu faço sempre isso mas nunca soube que era uma característica tuga haha adoro", "created_utc": "1577887907.0", "edited": "False", "id": "fcql373", "is_submitter": "False", "link_id": "t3_eic1di", "parent_id": "t1_fcpv38i", "score": "3", "subreddit": "portugal", "subreddit_id": "t5_2qmie"}, {"author": "p40ev1d4", "body": "The thing is that I don’t think I’d be a god fit to work as an au pair and also I think it wouldn’t be that easy to find a job there :/", "created_utc": "1576859049.0", "edited": "False", "id": "fbgurel", "is_submitter": "True", "link_id": "t3_ecwl16", "parent_id": "t1_fbf5wp4", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "p40ev1d4", "body": "Haha the question is exactly if you think I have a chance in something haha maybe I should add that I don’t have any work experience (but I’m studying computer sciences haha although I doubt I’d find a work in that area)", "created_utc": "1576782016.0", "edited": "False", "id": "fbeasuz", "is_submitter": "True", "link_id": "t3_ecx7p5", "parent_id": "t1_fbe8rq4", "score": "1", "subreddit": "belgium", "subreddit_id": "t5_2qhe6"}, {"author": "p40ev1d4", "body": "Where I live the minimum wage is much less but I completely understand your point", "created_utc": "1576779564.0", "edited": "False", "id": "fbe6xbg", "is_submitter": "True", "link_id": "t3_ecwl16", "parent_id": "t1_fbe6oqf", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "p40ev1d4", "body": "I live in the EU so working visas wouldn’t be a problem at least for other countries in the EU but I understand the problems they may face when allowing this", "created_utc": "1576779436.0", "edited": "False", "id": "fbe6qae", "is_submitter": "True", "link_id": "t3_ecwl16", "parent_id": "t1_fbe6bdi", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "p40ev1d4", "body": "Is it really illegal? There might be some places that are not right? The placed I talked about is practically all run by volunteers and they don’t seem to hide the offer I talked about, they had a poster about it on the walls", "created_utc": "1576778527.0", "edited": "False", "id": "fbe5but", "is_submitter": "True", "link_id": "t3_ecwl16", "parent_id": "t1_fbe5368", "score": "0", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "p40ev1d4", "body": "Do you think that if I call them they’ll tell me? I feel kinda awkward doing that but if it’s something somewhat common I’d do it", "created_utc": "1576778219.0", "edited": "False", "id": "fbe4ud9", "is_submitter": "True", "link_id": "t3_ecwl16", "parent_id": "t1_fbe4nx3", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "p40ev1d4", "body": "That’s a valid point but by searching about that hostel online I was able to find information about what I talked about I think\nMost of the hostels don’t offer this kind of things do they? Because I’d feel rather stupid asking this around in every hostel I stay in", "created_utc": "1576778119.0", "edited": "False", "id": "fbe4onp", "is_submitter": "True", "link_id": "t3_ecwl16", "parent_id": "t1_fbe4fiv", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "p40ev1d4", "body": "Look in olx.pt\nI’m not sure if everyone speaks English but I think it’s worth giving it a try... that’s where I found my apartment at least!!\nIt might be hard because I think there isn’t a translated version of the website but maybe use the built in translation in the browser... some people even write descriptions of their apartments in English though\nIf you have any doubts feel free to ask!", "created_utc": "1576771418.0", "edited": "False", "id": "fbdu6pt", "is_submitter": "False", "link_id": "t3_ecixu4", "parent_id": "t3_ecixu4", "score": "2", "subreddit": "aveiro", "subreddit_id": "t5_2tbkp"}, {"author": "p40ev1d4", "body": "It’s Portuguese\nI’d love to go to Canada but I have other plans this summer and I can’t afford to go there just for a week or so because the plane tickets are so expensive. But if and when I have more time I’ll definitely go there... \nsame for the USA", "created_utc": "1576769121.0", "edited": "False", "id": "fbdqo5t", "is_submitter": "True", "link_id": "t3_ecj75q", "parent_id": "t1_fbdnbiq", "score": "2", "subreddit": "FigureSkating", "subreddit_id": "t5_2rld6"}, {"author": "p40ev1d4", "body": "Haha it’s just that the news only shows the bad in everything I guess... there are ongoing manifestations and stuff like that aren’t there? But I might consider it since everything might be more settled down in the summer", "created_utc": "1576768753.0", "edited": "False", "id": "fbdq49f", "is_submitter": "True", "link_id": "t3_ecj75q", "parent_id": "t1_fbdhd15", "score": "1", "subreddit": "FigureSkating", "subreddit_id": "t5_2rld6"}, {"author": "p40ev1d4", "body": "I think “isso é o teu?” would be more suitable if you specified the object... like “isso é o teu lanche?” we here in Portugal use it like that at least... other than that I’d say “isso é teu?” is definitely the most correct way for what I think you mean", "created_utc": "1576581328.0", "edited": "False", "id": "fb79j8j", "is_submitter": "False", "link_id": "t3_ebjqn5", "parent_id": "t3_ebjqn5", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "p40ev1d4", "body": "I feel the same way but I kind of somewhat feel like I should be looking for attention... you need some attention in your life right? :/", "created_utc": "1576580933.0", "edited": "False", "id": "fb799oh", "is_submitter": "False", "link_id": "t3_ebqeiw", "parent_id": "t1_fb6omx8", "score": "1", "subreddit": "depressed", "subreddit_id": "t5_2r8rq"}, {"author": "p40ev1d4", "body": "Definitely Jack Faust by Michael Swanwick. I can’t express how much I hated that book. I actually made a bet with a friend that he’d win if could make me like it after him reading it. He did read it and told me it was impossible for anyone to like it.\nIf you do read it and end up enjoying it please let me know haha", "created_utc": "1573823854.0", "edited": "False", "id": "f7krr96", "is_submitter": "False", "link_id": "t3_dwj5qx", "parent_id": "t3_dwj5qx", "score": "1", "subreddit": "booksuggestions", "subreddit_id": "t5_2ryqe"}, {"author": "p40ev1d4", "body": "Maybe in Brazil that is so but in Portugal we also use “desculpa-me”  in the same situations where one could use “desculpa”", "created_utc": "1573782597.0", "edited": "False", "id": "f7joluo", "is_submitter": "False", "link_id": "t3_dwi6ec", "parent_id": "t1_f7je6r7", "score": "6", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "p40ev1d4", "body": "you shouldn't worry about that verb, people use it only when they don't remember the correct verb they want to express themselves. that's why its rarely found in any book,  because it's a sloppy way to talk, besides being very informal", "created_utc": "1572797545.0", "edited": "False", "id": "f6dw7do", "is_submitter": "False", "link_id": "t3_dqt7ph", "parent_id": "t1_f6dpe29", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "p40ev1d4", "body": "Honestly best ideia ever hahah but I don’t think I can manage to spend 5 min talking about that. That would’ve been fun though", "created_utc": "1572381607.0", "edited": "False", "id": "f5qr2x6", "is_submitter": "True", "link_id": "t3_doojaz", "parent_id": "t1_f5qqfhc", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "p40ev1d4", "body": "I’m thinking about talking about YOU (Caroline Kepnes) because I found it to be a different but interesting book that I’m guessing not a lot of people know about.\nAnd it’s actually for an English optional class (level C1.1, I’m not a native)... I can do a presentation on whatever I want but I can’t think of anything other than books  (id like to present something technology related but most of the other students taking this class know a lot more about technology than I do so that’s a no for me)\n\nEdit: But I also asked this out of curiosity because I’ve always wondered if there was something wrong with me concerning this matter", "created_utc": "1572379570.0", "edited": "False", "id": "f5qmpaj", "is_submitter": "True", "link_id": "t3_doojaz", "parent_id": "t1_f5ppmu9", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "p40ev1d4", "body": "I also think about it kind of in the same way but I feel self conscious because I am the one who choose what I’m going to talk about and I can’t think of anything interesting enough. But I suppose I shouldn’t care that much... it’s just something I’m trying to stop doing but as of right now I can’t help but feel like everyone is also judging my choices. (For example, I’d be way more comfortable if everyone were to talk about the same subject)", "created_utc": "1572353066.0", "edited": "False", "id": "f5p96o6", "is_submitter": "True", "link_id": "t3_doojaz", "parent_id": "t1_f5p6pe9", "score": "1", "subreddit": "books", "subreddit_id": "t5_2qh4i"}, {"author": "p40ev1d4", "body": "Esta calor é ouve-se muito dizer é não é errado. Apenas não é correto do ponto de vista físico, onde “está quente” seria mais correto. Por isso entre os 2, “está quente” é a melhor escolha", "created_utc": "1569837976.0", "edited": "False", "id": "f1z86d2", "is_submitter": "False", "link_id": "t3_db93iu", "parent_id": "t3_db93iu", "score": "3", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "p40ev1d4", "body": "Portuguese from Azores is missing from there. To me it would be the most different from all of those, and also definitively the most hard to understand. Most natives from Portugal struggle to understand what they say", "created_utc": "1567906849.0", "edited": "False", "id": "ezh856g", "is_submitter": "False", "link_id": "t3_d0vkdm", "parent_id": "t3_d0vkdm", "score": "5", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "p40ev1d4", "body": "This is the most accurate thing I’ve read all week", "created_utc": "1567529952.0", "edited": "False", "id": "eywi0fw", "is_submitter": "False", "link_id": "t3_cyq5af", "parent_id": "t1_eyttn12", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "p40ev1d4", "body": "I also hated Gone Girl but I really enjoyed YOU maybe because it was so different from what I what I normally find and I think the author did a good job on expressing the protagonist’s thoughts and it was a very catchy book unlike Gone Girl... but it’s interesting to see other people’s opinions", "created_utc": "1567421144.0", "edited": "False", "id": "eyt1z52", "is_submitter": "False", "link_id": "t3_cy8j4t", "parent_id": "t1_eys070i", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "p40ev1d4", "body": "You were talking about it before? Where? I’d actually like to know why you hated it so much haha :p", "created_utc": "1567377666.0", "edited": "False", "id": "eyrtacg", "is_submitter": "False", "link_id": "t3_cy8j4t", "parent_id": "t1_eyrt28j", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "p40ev1d4", "body": "YOU (by Caroline Kepnes)", "created_utc": "1567342223.0", "edited": "False", "id": "eyqgisu", "is_submitter": "False", "link_id": "t3_cy8j4t", "parent_id": "t3_cy8j4t", "score": "3", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "p40ev1d4", "body": "Maybe try watching some videos or listen to songs if you feel like you can understand some things :)", "created_utc": "1567337931.0", "edited": "False", "id": "eyqcxjt", "is_submitter": "False", "link_id": "t3_cy0kw8", "parent_id": "t3_cy0kw8", "score": "2", "subreddit": "Portuguese", "subreddit_id": "t5_2sqn7"}, {"author": "p40ev1d4", "body": "I suppose it is but in the situation I was told (and that I described above) the student only found about after arriving there that she wouldn’t be able to do one of the courses, even though they had prepared everything before hand (checked for availability and signed up and all those things I assume).", "created_utc": "1567194554.0", "edited": "False", "id": "eylxr81", "is_submitter": "True", "link_id": "t3_cxf38w", "parent_id": "t1_eylclkv", "score": "1", "subreddit": "Erasmus", "subreddit_id": "t5_2t1md"}, {"author": "p40ev1d4", "body": "You had the choice to not do it after the semester had started?", "created_utc": "1567178729.0", "edited": "False", "id": "eyl8kof", "is_submitter": "True", "link_id": "t3_cxf38w", "parent_id": "t1_eyl8gis", "score": "1", "subreddit": "Erasmus", "subreddit_id": "t5_2t1md"}, {"author": "p40ev1d4", "body": "Where did that happen?", "created_utc": "1567176738.0", "edited": "False", "id": "eyl5lbj", "is_submitter": "True", "link_id": "t3_cxf38w", "parent_id": "t1_eykyz5y", "score": "1", "subreddit": "Erasmus", "subreddit_id": "t5_2t1md"}, {"author": "p40ev1d4", "body": "Does the order of applications matter?", "created_utc": "1567169244.0", "edited": "False", "id": "eykvf5w", "is_submitter": "False", "link_id": "t3_cxg5jj", "parent_id": "t3_cxg5jj", "score": "2", "subreddit": "volunteer", "subreddit_id": "t5_2qzis"}, {"author": "p40ev1d4", "body": "I feel the same way! Having a bf takes just too much work, maybe I’d rather be alone and not talk to anyone for a long time, and maybe I don’t want someone to feel offended when I don’t speak/text to them just because I don’t feel like doing so.\nAnother annoying thing is when you hang out a lot with a friend, that happens to be a guy, and everyone assumes that you’re dating.\nI really don’t feel like I’m missing out on something just because I’m not dating...", "created_utc": "1556366820.0", "edited": "False", "id": "elwmxm6", "is_submitter": "False", "link_id": "t3_bhfjob", "parent_id": "t3_bhfjob", "score": "1", "subreddit": "self", "subreddit_id": "t5_2qh96"}]