[{"author": "panpanIIDX", "body": "A lot of Japanese salarymen play them too.\n\nAlso since Mahjong Soul exists I think a lot of otaku play them as well, so it's safe to assume a lot of them are going to buy and try this game", "created_utc": "1666974989.0", "edited": "False", "id": "iu52bje", "is_submitter": "False", "link_id": "t3_yf7hju", "parent_id": "t1_iu27egf", "score": "5", "subreddit": "Blazblue", "subreddit_id": "t5_2s6iq"}, {"author": "panpanIIDX", "body": "I saw this [post](https://www.reddit.com/r/languagelearningjerk/comments/yf7yot/in_your_opinion_what_is_the_most_kawaii_japanese/) this morning, and then I saw that twitter thread in the afternoon and can't resist the urge to make a sequel to it.", "created_utc": "1666960699.0", "edited": "False", "id": "iu44vxg", "is_submitter": "True", "link_id": "t3_yfn0wj", "parent_id": "t3_yfn0wj", "score": "13", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Same", "created_utc": "1666799524.0", "edited": "False", "id": "itva8vd", "is_submitter": "False", "link_id": "t3_ydw4sm", "parent_id": "t1_itv9753", "score": "1", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Hebrew, Yiddish and Romani obviously", "created_utc": "1666429023.0", "edited": "False", "id": "itb85rn", "is_submitter": "False", "link_id": "t3_ya73xi", "parent_id": "t3_ya73xi", "score": "3", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "The Sea of Japan has taken on a new meaning", "created_utc": "1666180330.0", "edited": "False", "id": "isxble2", "is_submitter": "False", "link_id": "t3_y7r3c9", "parent_id": "t3_y7r3c9", "score": "4", "subreddit": "hoi4", "subreddit_id": "t5_2zvvb"}, {"author": "panpanIIDX", "body": "*Laugh in 英語, 和製英語 and 和製漢語*", "created_utc": "1666091497.0", "edited": "False", "id": "isseyeh", "is_submitter": "False", "link_id": "t3_y71nzh", "parent_id": "t3_y71nzh", "score": "6", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "You are right, how could I completely forget about the existence of the beautiful South African language.", "created_utc": "1666019926.0", "edited": "False", "id": "isolbea", "is_submitter": "False", "link_id": "t3_y6802y", "parent_id": "t1_isoia1l", "score": "9", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Do Chinese and Japanese count? Since they have 凸 and 凹", "created_utc": "1666018246.0", "edited": "False", "id": "isohu1p", "is_submitter": "False", "link_id": "t3_y68ud7", "parent_id": "t3_y68ud7", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Since she's from South Africa herself (I think), I'm sure that flag means Afrikaans", "created_utc": "1666017410.0", "edited": "False", "id": "isofv75", "is_submitter": "False", "link_id": "t3_y6802y", "parent_id": "t1_isoa36x", "score": "19", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "What about the great Pakistani language?", "created_utc": "1666017264.0", "edited": "False", "id": "isofj3e", "is_submitter": "False", "link_id": "t3_y6802y", "parent_id": "t1_isnsvc5", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "For employment and possible salary boost obviously\\*\n\n\\*Only apply to normal people in East or Southeast Asia", "created_utc": "1665633523.0", "edited": "False", "id": "is44tdl", "is_submitter": "False", "link_id": "t3_y27t9n", "parent_id": "t1_is1heo9", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "The two tribes, one is “Just immerse 10 hours a day, bro” tribe and the other “What do you mean, you can’t learn language in 15 minutes a day?” tribe", "created_utc": "1665630908.0", "edited": "False", "id": "is3zygn", "is_submitter": "False", "link_id": "t3_y2ft0a", "parent_id": "t1_is2qgjn", "score": "29", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Joke on you, if you ask the French, I’m sure they will tell you that their language is still the global lingua franca.", "created_utc": "1665416483.0", "edited": "1665416682.0", "id": "irrtqp9", "is_submitter": "False", "link_id": "t3_y0filx", "parent_id": "t3_y0filx", "score": "57", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "https://youtube.com/watch?v=RxkezvGwI20", "created_utc": "1665380650.0", "edited": "False", "id": "irqam70", "is_submitter": "False", "link_id": "t3_xzpy05", "parent_id": "t1_irpcw6r", "score": "2", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Personally it’s less the lax-ness and more of the sub just being too big for its own good, like when half of the posts there are like “Study X confirm political bias Y” and everyone agreed with it (and got upvoted to the top!) often without even reading the article let alone the study. Now I think the mods probably do their best, but since the sub literally has like 25 millions of subs, these articles ended up being way too common for its own good imo, and this is coming from someone who do agree with many of their political view\n\nThen again it may just be the fate of any sub that are extremely general (as opposed to more specialized science subs, both natural and social)", "created_utc": "1665328409.0", "edited": "1665328675.0", "id": "irn4shq", "is_submitter": "False", "link_id": "t3_xze7yn", "parent_id": "t1_irmj8iw", "score": "18", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "/uj that reminds me, I should unsub from r/science, there are **way** too many posts like this one", "created_utc": "1665302677.0", "edited": "False", "id": "irm0i5t", "is_submitter": "False", "link_id": "t3_xze7yn", "parent_id": "t3_xze7yn", "score": "128", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "I saw the title of this post and OP’s name and I thought I was in r/languagelearningjerk and wonder why the post read so wholesome.\n\nCongrats though", "created_utc": "1665293453.0", "edited": "False", "id": "irlogpj", "is_submitter": "False", "link_id": "t3_xz36l3", "parent_id": "t3_xz36l3", "score": "11", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "panpanIIDX", "body": "Why buy when you can read those amateur R18 web novels for free?", "created_utc": "1665144993.0", "edited": "False", "id": "ire9v91", "is_submitter": "False", "link_id": "t3_xxp9y5", "parent_id": "t1_irdnv73", "score": "4", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Those cheap-looking RPGMaker porn games sold on DLSite will always be there for him (Don't ask me how I know about them)", "created_utc": "1665144660.0", "edited": "False", "id": "ire9cdk", "is_submitter": "False", "link_id": "t3_xxp9y5", "parent_id": "t3_xxp9y5", "score": "3", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "The vast majority of their profit are actually games, specifically mobile games but there's also the JP-only Momotaro Dentetsu and their yearly JP-only PowerPro, and of course Master Duels. After that, it was their sport gyms (never knew Konami does sport gyms before? Now you know). Arcade games/pachinko (group them together cause they belong in the same division) and slots machine only make a minor amount of their profits really.", "created_utc": "1664686153.0", "edited": "1664686782.0", "id": "iqpov92", "is_submitter": "False", "link_id": "t3_xsxlge", "parent_id": "t1_iqmz72c", "score": "2", "subreddit": "bemani", "subreddit_id": "t5_2sb6k"}, {"author": "panpanIIDX", "body": "I think that Konami do focus on their loyal fanbase...*in Japan*. After all, their JP-only baseball games still sell well, their JP-only Momotaro Densetsu both sells really well *and* is well beloved in Japan, ditto about their mobile games. It's really the fanbase outside of Japan (or to be more precise the MGS/SH fanbase) that's getting the short end of the stick. (It should be note here too that while Kojima is well beloved outside of Japan, Japanese gamers doesn't share that same reverence. Which is why I don't think Konami will \"regret\" letting Kojima go, simply because both themselves and their main target audience simply just doesn't interest in the guy's work that much)\n\nWhat make all this interesting is that Konami's switch to focus on \"Japan first\" coincide with the time Japanese console game industry in general (and especially AAA) become increasingly dependent on the foreign market (case in point: Tales of Arise sold quite poorly in Japan but made up for it by foreign sales). And all the more interesting is that Konami simply doesn't get punished for that decision, profit has been increasing year after year, with 2022 being their most profitable year ever and even in their worse year they still made more profit than they ever did when they still have Kojima and make AAA games. Fascinating stuff, really\n\nAs for the whole BEMANI SOUND TEAM thing, my impression is that it's less of something especially awful and more of Konami taking a page from what other companies already doing (iirc Taito credit their in house in Groove Coaster as \\[Artist name\\]\\(Zuntata\\), Namco doesn't even bother doing that in Taiko and all their in house are pretty much Namco Sound Team or something, although they did credit them in OST releases so at least there's that). In other word, less of something exceptional and more of moving toward Japanese game companies awful norms. Doesn't really make it any better, mind you.", "created_utc": "1664685620.0", "edited": "1664700438.0", "id": "iqpo1kr", "is_submitter": "False", "link_id": "t3_xsxlge", "parent_id": "t1_iqmu8co", "score": "9", "subreddit": "bemani", "subreddit_id": "t5_2sb6k"}, {"author": "panpanIIDX", "body": "And his whole “theory” basically amount to “just learn some words and speak” of course", "created_utc": "1662912558.0", "edited": "False", "id": "io04acw", "is_submitter": "False", "link_id": "t3_xbg2ok", "parent_id": "t1_inz6p7z", "score": "14", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "I like the whole “Video Game Map” thing, since it reminds me of games (happen to books or movies too) that have pretty cool ideas and potential and completely failed to deliver, just like this video.", "created_utc": "1662912393.0", "edited": "1662913407.0", "id": "io03vh8", "is_submitter": "False", "link_id": "t3_xbg2ok", "parent_id": "t3_xbg2ok", "score": "12", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "To be more precise, chữ Nôm was made for native Vietnamese words  whereas the Chinese characters were for Sino-vocabs. And of course, since it's highly impractical to write Vietnamese without using Sino vocabs, it's not very possible to *only* use chữ Nôm. Kinda like how while it's possible to write Japanese without using Kanji, there are a lot of annoyances and impracticality that you don't see much Kana-only stuff, and chữ Nôm only is even worse in that regards. (the characters themselves are also much more complicated even just for basic characters)", "created_utc": "1658315846.0", "edited": "False", "id": "igwicq0", "is_submitter": "False", "link_id": "t3_w2ygy9", "parent_id": "t1_igvsggt", "score": "6", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "To be fair to him though, it's very possible to \"know\" a grammar construction, as in understand what it means whenever you encounter it in a text or in a TV show/anime/whatever, and still couldn't use it correctly in conversations for various reasons. And incidentally, since the JLPT doesn't test output, it's very much possible for a person to only \"know\" a grammar construction and pass the test without knowing how to use it in conversations. So the friend probably at least is clueless about how the JLPT work lol", "created_utc": "1653833362.0", "edited": "False", "id": "iaffrey", "is_submitter": "False", "link_id": "t3_uzmhcx", "parent_id": "t1_iab5id4", "score": "7", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "I feel like this is just a few steps away from deserving a spot in r/badlinguistics", "created_utc": "1653832387.0", "edited": "False", "id": "iafdrd9", "is_submitter": "False", "link_id": "t3_uzwxh0", "parent_id": "t3_uzwxh0", "score": "3", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "> If you really want to become a Yamato person, you cannot use foreign loanwords.\n\nBut Kanji came from *China* which is also foreign and is even more inferior than Western loanwords!", "created_utc": "1649585384.0", "edited": "False", "id": "i45bgni", "is_submitter": "False", "link_id": "t3_u0698s", "parent_id": "t3_u0698s", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "I mean *it is* an exception, but that being said\n\n* Before moving to Japan, he attended several comiket and other doujin events and sold doujinshis there (which I should note that doujin events in general are actually a good way of getting your name out there and to make connections) in addition to having commercial commissions from 2013 onward, 4 years before he moved to Japan.\n* He did dropped out of his studies but it was *post-graduate* programme that he dropped out, which implied that he probably has a bachelor degree so there's that.\n\nSo yeah, an exception, but it's still something to think about.\n(As a sidenote, I actually didn't notice that you mentioned your Japanese degree will have free tuition, so if that is the case, and assuming you can get some career in your home country as a backup, it might not be a bad idea, although the issue of related degree for visa that other posters mentioned might be still quite annoying)", "created_utc": "1649584406.0", "edited": "False", "id": "i45aafe", "is_submitter": "False", "link_id": "t3_u0bt34", "parent_id": "t1_i455z9d", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Reading your post, the first thing I thought of was this guy and he essentially did your third idea: [https://www.youtube.com/watch?v=DvH_fGPQD7Q](https://www.youtube.com/watch?v=DvH_fGPQD7Q)\n\n\nNow, without knowing further about your country (for example how much Japanese investment there are in your country or what governmental position are there for Japanese major grads), I would recommend you taking the third option and I'll also add that you also could try to look for online (or local if you can find them in where you live or your uni) game devs group so that you can apply what you learn from your art class and also building your portfolio (that and putting your arts onto sites like twitter or pixiv). That and finding ways to build connections in Japan if you are still interested in working as a Game Artist in Japan.", "created_utc": "1649580383.0", "edited": "False", "id": "i455enw", "is_submitter": "False", "link_id": "t3_u0bt34", "parent_id": "t3_u0bt34", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Light novels I finished in March:\n\n\n- お隣の天使様にいつの間にか駄目人間にされていた件2: I actually wanted to finished this in February but certain irl stuff happened and I ended up finished this in March instead. I also feel like this is oddly more difficult than I remember, mainly because it felt like events in the story are quite self contained and doesn't feel like what happened doesn't follow the next. I'll probably still recommend this and do plan to read next vol, however.\n\n\n- ぼくたちのリメイク: Started reading this because of the aforementioned irl stuff. That, and I've been wanting to read this for a while mainly because I'm a sucker for those stories about creatives. Expect a fair amount of filmmaking-related vocabs but otherwise it's a fairly easy read. \n\n\n- この△ラブコメは幸せになる義務がある: a ラブコメ but with yuri. Basically a girl liked another girl in her class and the male protagonist ended up became her wingman. This one felt somewhat more difficult than the other lns that I read this month except for 天使２ and also is longer than the others. I kinda liked it (mainly because of the relationship between the wingman protagonist and the girl he was helping), idk if I would recommend it though because this felt very ラブコメ.\n\n\n- 君は初恋の人、の娘 1-2: Nice novels with many good moment. I like that the protagonist is a working adult which is kinda fresh for LN setting. And since the protagonist is a working adult, to be more precise he's a combini manager, expect a few combini-work related vocabs but otherwise nothing really difficult. I would recommend...if it wasn't because of the novel trying to hook the working adult protagonist and the female main character who is still in high school. I don't mind it but I think others might get bothered with it.\n\n\nGeneral note on Difficulty: Since I mostly read Slice-of-life and/or Romcom/ラブコメ, the difficulty between all of them should be quite similar outside of certain specific vocabs (ie film vocabs in ぼくたちのリメイク) and generally should be on the easier side of novels/light novels.\n\n\nMy recommendation: ぼくたちのリメイク > Rest (read them if you like ラブコメ stuff like I do)", "created_utc": "1648915059.0", "edited": "1648915605.0", "id": "i34c5lj", "is_submitter": "False", "link_id": "t3_tt473s", "parent_id": "t3_tt473s", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Well I basically never bother with stroke order beyond unless it’s something that’s too difficult for me to write haha (tho I do know the strokes for most of the basic radicals).\n\nThat being said, for Anki there’s a stroke order add on so there’s that as well.", "created_utc": "1648649444.0", "edited": "False", "id": "i2ptd8q", "is_submitter": "False", "link_id": "t3_ts2jxl", "parent_id": "t1_i2pdlrw", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Honestly, why not combine both, like you keep using your flashcard apps but every time you use it, you take out your pen and paper and write every kanji that pop up on the flashcard apps. This is essentially what I did (although I hopped between writing on my phone screen/table/in the air and actually writing it on my paper with my pen)", "created_utc": "1648640771.0", "edited": "False", "id": "i2pbxo3", "is_submitter": "False", "link_id": "t3_ts2jxl", "parent_id": "t3_ts2jxl", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "I'm going to answer this question only\n\n> So is \"Name国\" meant to be \"Kingdom/Country of Name\" (ie Kingdom of Baron), \"Name Kingdom/Country\" (some translate Troia's track as \"Troia Country\"), just \"Name\" (ie Fabul), or something else entirely?\n\n国 generally mean country or if you want to be slightly more formal, *state* (no it doesn't mean kingdom, let alone anything involving beauty), so \"Name国\" would simply mean \"State of Name\".\n\nBut you can also add more characters in between \"Name\" and \"国\", so something like \"Name王国\" would mean something along the line of \"Royal State of Name\" or \"*Kingdom* of Name\", or \"Name帝国\" which mean \"Imperial State of Name\" or \"*Empire* of Name\" and so on.\n\nWhich bring us to the final question on why the translators decided to go with \"Name\" translation as oppose to \"State of Name\". Well, the official name of Japan is 日本国 or \"State of Japan\", let me ask you how often you use \"State of Japan\" as oppose to simply \"Japan\"? How the words \"feel\" matters too, translating ファブール国 to something like \"State of Fabul\" may feel too modern for the medival-like fantasy setting of the game so simply something like \"Fabul\" would feel more fitting for game.", "created_utc": "1648377901.0", "edited": "False", "id": "i2asw17", "is_submitter": "False", "link_id": "t3_tp9x6h", "parent_id": "t3_tp9x6h", "score": "2", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "I’m fluent in English, native in Vietnamese, used to learn French and now I’m learning Japanese. Which side I’m on then?", "created_utc": "1648018878.0", "edited": "1648019173.0", "id": "i1rlw9r", "is_submitter": "False", "link_id": "t3_tkc44m", "parent_id": "t3_tkc44m", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Wait until he found out how many tweets in Japanese out there", "created_utc": "1647970287.0", "edited": "False", "id": "i1opzq6", "is_submitter": "False", "link_id": "t3_tk7c9l", "parent_id": "t3_tk7c9l", "score": "57", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "White American guy shocking natives with his perfect native English when?", "created_utc": "1647790106.0", "edited": "False", "id": "i1evewz", "is_submitter": "False", "link_id": "t3_til4j8", "parent_id": "t3_til4j8", "score": "61", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "I can't decide what's funnier, the music in the video or the fact that the website advertised how good its student became with a quote of the guy in OP's video saying \"I became a Youtuber after the master's course\"", "created_utc": "1647623967.0", "edited": "1647624304.0", "id": "i16dpkt", "is_submitter": "False", "link_id": "t3_th0qq4", "parent_id": "t1_i15y00y", "score": "14", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "If you tell me they made this list by throwing darts at random languages, I would believe it tbh", "created_utc": "1647274681.0", "edited": "False", "id": "i0ms2jm", "is_submitter": "False", "link_id": "t3_tdilh6", "parent_id": "t1_i0jqa8j", "score": "19", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "Aside from that it’s probably unlikely for the UN to have a 7th official language, my pick is Portuguese *if only* because it’s the only language in the list that is remotely widespread globally, all the other feel far too much like a regional language rather than a global one.", "created_utc": "1646213430.0", "edited": "False", "id": "hz13mi4", "is_submitter": "False", "link_id": "t3_t4iwsr", "parent_id": "t3_t4iwsr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "panpanIIDX", "body": "> Can someone please explain how a light novel is different from a regular novel?\n\nWell the answer is that \"light novel\" is generally just the label the book is published in, as in a light novel is published under a \"light novel\" imprint (like Gagaga or Dengeki Bunko). Other than that, there isn't really any differences between LN and \"regular\" novel, and plenty of writers either started with LN and then move to regular novels or writing both at the same time. And then you have something like the Monogatari series that was published under both label iirc. So with that in mind, no there isn't really any English equivalent.\n\nAs for recommendation for more adult-ish setting (not necessarily middle-aged theme but idk) LNs, well I haven't read any of them *yet* but there are a few of these that I'm interested in reading: [ぼくたちのリメイク](https://www.amazon.co.jp/-/en/dp/B06XRRJQGP/?coliid=I2AGXUU1GDU2HW) (and especially its [spinoff](https://www.amazon.co.jp/-/en/dp/B07WGB6V3J/?coliid=I4Q9LCVXB0YVM) which do sound like something you would want to read), [結婚が前提のラブコメ](https://www.amazon.co.jp/-/en/dp/B083WFH5GJ/?coliid=I1V9W0J7SXR7LJ), if you can tolerate a bit more otaku-ish stuff, something like [妹さえいればいい](https://www.amazon.co.jp/-/en/%E5%B9%B3%E5%9D%82%E8%AA%AD-ebook/dp/B00UWUE0YA) might be interesting to you as well.", "created_utc": "1645528654.0", "edited": "1645528864.0", "id": "hxy9uxx", "is_submitter": "False", "link_id": "t3_sy71j7", "parent_id": "t3_sy71j7", "score": "11", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Well I like to think that if learning grammar with a textbook or a grammar guide/dictionary (I would also add learning vocab through something like anki into this group as well) is like open a programming language tutorial to learn its syntax. Then the equivalent of building a personal project for learning natural language would be like learning through talking with native speakers and reading/watching/listening native materials. Just like how in building a program or an app, you use the programming language to do what you want it to do and then if you have any issue or don't know something, you google it and you learn the language that way. Same thing here, if you are talking or reading or watching something, you are basically using the language to do what you want to do (which is speaking or reading, etc.) and if you have any problem, you could either ask the person you are talking with (if you are talking), or google/open a dictionary if you encounter something you don't know and you keep learning that way.\n\nIf there's one thing that's different compare to learning programming language though is that with programming language, you only need to know the syntax of the language you are learning before you start building something. With natural languages, you'll want a hefty vocab base (around a few hundreds to around 2-3000 depend on language) before you speaking with a native speaker or reading native materials become really effective. Moreover, programming languages are much more similar to each other compare to natural languages. So for these reasons, progress in learning natural language will be much slower compare to progress in learning programming languages.\n\nThat said, much like learning programming, assuming you are consistent enough (ie using Anki 15 minutes everyday and/or maybe 30 mins of learning grammar and reading/watching something in your target language everyday once you got to that point and so on), then you will inevitably make progress.", "created_utc": "1645450903.0", "edited": "False", "id": "hxtwnou", "is_submitter": "False", "link_id": "t3_sxds3n", "parent_id": "t3_sxds3n", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "panpanIIDX", "body": "\"So no, you are not going to be fluent in Uzbek 40 days from now.\" - 5:50\n\nUnsubbed", "created_utc": "1645371157.0", "edited": "False", "id": "hxpnrfj", "is_submitter": "False", "link_id": "t3_switx5", "parent_id": "t3_switx5", "score": "11", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "panpanIIDX", "body": "I like how you found kanji/hanzi impossible then proceed to choose Mandarin which is 100% kanji/hanzi over Korean (little to no kanji, similar grammar to Japanese though) or Vietnamese (no kanji whatsoever, use latin alphabet *and* similar grammar to Mandarin/English).\n\nBut more importantly, not learning the writing system is not really an option, even if you only want to speak. The reasoning is that while technically, you could say, memorize certain phrases and then start speaking. Long term improvement will come from lots of native input, be it from reading, watching native media with or without subtitles or listening to native conversations. By not learning the writing system, you basically close yourself out 2 of them as an option.\n\nFinally, kanji, especially their readings, is annoying, and that's true, but the thing is that if you say, learn kanji as a part of say, the first 6000 common words (which you should do anyways, learn the words I mean), with an SRS followed by lots of native input then it became little more than mild annoyance really quick. Same for grammar/sentence structure really, you will get used to it after studying it for a while followed by native inputs.", "created_utc": "1645063738.0", "edited": "False", "id": "hx9816i", "is_submitter": "False", "link_id": "t3_stt42b", "parent_id": "t3_stt42b", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "panpanIIDX", "body": "It's not that bad...\n\n...if you are Chinese/Korean/Vietnamese natives or otherwise know one of those language.\n\nAlso the rule of word that consist of kanji compounds are onyomi and kanji + kana are kunyomi became more and more consistently true as they became rarer word so that's a nice blessing as well. Names are the one place where it's really obnoxious though.", "created_utc": "1645009488.0", "edited": "1645010007.0", "id": "hx5qd51", "is_submitter": "False", "link_id": "t3_st9x2o", "parent_id": "t1_hx3hh6c", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "panpanIIDX", "body": "Well the first thing you can do is to review your study plan. That is do I need to change anything about it? Like do I need to lessen my focus on grammar exercises and more on intensively reading short native materials? How about trying to increase my daily new word count in my Anki decks (or whatever my SRS of choice)? And so on\n\nThe second thing is that don't worry too much about still feeling like you are not making much progress in 2 years, Japanese is a hard language after all. Speaking in general takes a lot of reading/listening practices *and* speaking practices before you feel like you could speak naturally. Reading your first book/visual novel/whatever is painful as anyone would tell you, even the people who got to N1 within 2 years. And even for grammar, well don't be surprised if you are already reading native materials comfortably *and yet* still feel like you have discovered new things about basic grammar that you haven't considered before.", "created_utc": "1644926706.0", "edited": "False", "id": "hx0xyq3", "is_submitter": "False", "link_id": "t3_ssy528", "parent_id": "t3_ssy528", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Generally there are two kinds of reading you can do, [intensive and extensive reading](https://www.lucalampariello.com/intensive-vs-extensive-reading/). For intensive reading, you can basically start doing it at anytime you want, regardless of your Japanese level (maybe after knowing some basic grammar idea). In fact, you are already doing it since at say JLPT N5 there simply aren't a lot of stuff are easily comprehensible. Now, it's not exactly the most pleasant experience as you already found out.\n\nThe other kind of reading, extensive reading, from personal experience, you can generally start doing it at N3 (or even N4 if it was some easy graded readers or easy native materials) and after knowing around 2-3k words (and probably already read a few things intensively) through Anki or the aforementioned intensive reading.\n\nIf I were you, I would continue doing intensive reading (how much time per day you decide, I'll probably say around 15 mins to an hour per day) while continue vocabulary and grammar study until you know around 3k words then you could start trying extensive reading something like easy novels (ie slice-of-life light novels or something like Kitchen, etc.).\n\n(Now intensive and extensive reading is some broad generalization as in practice your reading tend to be somewhere in-between, ie intensive reading for most of a blog article but reading extensively some easy paragraph or extensive reading most of a novel but looking up some word or grammar for a few sentences, etc. But you get the idea)", "created_utc": "1644903496.0", "edited": "1644903822.0", "id": "hx03jow", "is_submitter": "False", "link_id": "t3_ssczr8", "parent_id": "t3_ssczr8", "score": "1", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Well the interviewed guy probably can pass N2 with some preparations, that said he mostly did other stuff outside of Duolingo (iirc Core6k deck plus lots of immersion and sentence mining)", "created_utc": "1644759232.0", "edited": "1644760310.0", "id": "hwrxe9o", "is_submitter": "False", "link_id": "t3_srcm6j", "parent_id": "t1_hwr1j9i", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Well in the case of Kanji, you either learn them along with vocabs, and therefore it's already included in the vocabulary list. Or you learn them on their own, in which case you would use something like RTK or KKLC to learn them instead. So yeah, there just aren't any good solutions, and not including some kanji inside the textbooks...are just weird (and some people might find the supplementation style kanji section useful anyhow).\n\nAs for your last part well, the sad and boring answer is that maybe there aren't any technological solutions after all, at least not anything we know of. Considering that every once in a while you see someone making a language learning game/app trying to do what you said (aside from the \"realistic virtual avatar\" thing, I don't think you can see computer that can make meaningful interaction with you and subsequently being useful for language learning any time soon honestly) and most of them just don't seem to get any traction. Not to mention that there are still a lot of research on SLA so it's not like we have like a final, definitive answer on how best to learn a language anyways.", "created_utc": "1644485454.0", "edited": "1644487763.0", "id": "hwciycb", "is_submitter": "False", "link_id": "t3_soxxq4", "parent_id": "t3_soxxq4", "score": "3", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Nah it's not just you, I myself thought they are the same color at first glance too lmao", "created_utc": "1644407321.0", "edited": "False", "id": "hw7pe7f", "is_submitter": "False", "link_id": "t3_so8shk", "parent_id": "t1_hw7p2rf", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "panpanIIDX", "body": "\"ấy\" is literally \"that\", it's just the red and the orange are next to each other so it looked like the same color.\n\nAnd as you can already see, for specifying this or that in Vietnamese, you use particles like \"này\", \"ấy\", \"kia\", nọ, \"đó\", etc.", "created_utc": "1644406998.0", "edited": "False", "id": "hw7ox2q", "is_submitter": "False", "link_id": "t3_so8shk", "parent_id": "t1_hw7o540", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "panpanIIDX", "body": "Aside from the usual advice of “read more”, another thing you could do is try to mix your reading sessions a bit. And by that I mean to try to have a session where you read relatively easy stuff like moege or romcom/sol light novels with little to no dictionary usage and another session where you read difficult stuff with lots of dictionary lookups", "created_utc": "1643590386.0", "edited": "False", "id": "huxhocg", "is_submitter": "False", "link_id": "t3_sgi9v1", "parent_id": "t3_sgi9v1", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Vietnamese here and actually, from what I've seen, Japanese are pretty much equal to Chinese in term of popularity, at least among younger people. Like if I make a popularity tier list, it would look like this (might be wrong):\n\nSS: English\n\nA: Chinese, Japanese, Korean\n\nB: French, Russian (German?)\n\nC: the rest\n\nI wouldn't call Vietnam \"under direct Chinese influence\" either. Like in term of say, foreign investment, China and Japan (and also Korea) are actually pretty much equal.", "created_utc": "1633485147.0", "edited": "1633485985.0", "id": "hfjyk8p", "is_submitter": "False", "link_id": "t3_q1jhk0", "parent_id": "t1_hfg8b5k", "score": "5", "subreddit": "LearnJapanese", "subreddit_id": "t5_2qyls"}, {"author": "panpanIIDX", "body": "Her name is *Yui* Minazuki btw (same first name kanji as the other Yui you are probably thinking about too)", "created_utc": "1630074448.0", "edited": "1630074860.0", "id": "hak6iog", "is_submitter": "False", "link_id": "t3_pch1u9", "parent_id": "t1_haiu37w", "score": "10", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "panpanIIDX", "body": "8 actually", "created_utc": "1628707570.0", "edited": "False", "id": "h8kdzx6", "is_submitter": "False", "link_id": "t3_p2fnvb", "parent_id": "t1_h8k2mbr", "score": "3", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "panpanIIDX", "body": "It's Wolf Boy: Gamers edition", "created_utc": "1573154295.0", "edited": "False", "id": "f6tundk", "is_submitter": "False", "link_id": "t3_dszb46", "parent_id": "t1_f6tkcfn", "score": "1", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "panpanIIDX", "body": "We wolf boy now", "created_utc": "1572910376.0", "edited": "False", "id": "f6kd3h5", "is_submitter": "False", "link_id": "t3_drjjkm", "parent_id": "t3_drjjkm", "score": "3", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "panpanIIDX", "body": "Someone played too much Assassin Creed", "created_utc": "1571938381.0", "edited": "False", "id": "f518ety", "is_submitter": "False", "link_id": "t3_dmi3li", "parent_id": "t3_dmi3li", "score": "6", "subreddit": "manga", "subreddit_id": "t5_2ql0i"}, {"author": "panpanIIDX", "body": "340 is a definitely, simply because it is probably among the only time in uni where you actually have a proper experience with multiprogramming (the end of 230 was more of an introduction to it), and OS in general is a good case study of what a large software looks like.\n\nOutside of that, 320 is good for general understanding of algorithm (and probably problem solving in general), 345 seems like good for UI/UX stuff (I didn't take it though), 313 is good if you like developing system software/system programming\n\nAlso from the [softeng](https://courses.foe.auckland.ac.nz/course/map/15/) program, it seems like they have their equivalence of [340](https://courses.foe.auckland.ac.nz/course/outline/19830/15/), [345](https://courses.foe.auckland.ac.nz/course/outline/19827/15/) and [351](https://courses.foe.auckland.ac.nz/course/outline/19828/15/) as compulsory papers and compsci 373, 367 and their equivalence of [313](https://courses.foe.auckland.ac.nz/course/outline/15134/15/) (and maybe [314](https://courses.foe.auckland.ac.nz/course/outline/19829/15/)) as electives so you could take that in mind as well", "created_utc": "1568779177.0", "edited": "1568786645.0", "id": "f0nseoa", "is_submitter": "False", "link_id": "t3_d4g6sv", "parent_id": "t3_d4g6sv", "score": "2", "subreddit": "universityofauckland", "subreddit_id": "t5_2spg7"}, {"author": "panpanIIDX", "body": ">online or multiplayer functionality\n\nPretty much Twinkle Star Sprites and its Touhou clones, Phantasmagoria of Dim.Dream and Flower View, there's also Senko no Ronde (fighter-shmups hybrid) if those are what you are looking for", "created_utc": "1549020800.0", "edited": "False", "id": "efifqo0", "is_submitter": "False", "link_id": "t3_alc6zq", "parent_id": "t1_efflwqk", "score": "1", "subreddit": "shmups", "subreddit_id": "t5_2r4cd"}, {"author": "panpanIIDX", "body": "Kancolle waifu: Doggy of Sasebo  \nNon-Kancolle ship: Nightmare of Taranto", "created_utc": "1487787761.0", "edited": "False", "id": "de2q070", "is_submitter": "False", "link_id": "t3_5vdift", "parent_id": "t3_5vdift", "score": "1", "subreddit": "kancolle", "subreddit_id": "t5_2yjji"}, {"author": "panpanIIDX", "body": "any doujins by deco  \nhttp://danbooru.donmai.us/pools?commit=Search&search%5Bname_matches%5D=deco+%28geigeki+honey%29&search%5Border%5D=updated_at&utf8=%E2%9C%93  \nhttps://e-hentai.org/tag/artist:deco (site is NSFW but the doujin themselves aren't)\n\nI also enjoy the doujins by teruui as well, unfortunately most of them are preview rather than the full doujins   http://danbooru.donmai.us/pools?commit=Search&search%5Bname_matches%5D=teruui&search%5Border%5D=updated_at&utf8=%E2%9C%93", "created_utc": "1487785645.0", "edited": "1487787892.0", "id": "de2o202", "is_submitter": "False", "link_id": "t3_5v630r", "parent_id": "t3_5v630r", "score": "2", "subreddit": "kancolle", "subreddit_id": "t5_2yjji"}, {"author": "panpanIIDX", "body": "Both Gunbird 2 and Dragon Blaze have excellent melee mechanics and they were made by the same developer (Psikyo) as well", "created_utc": "1484633431.0", "edited": "False", "id": "dcj4tan", "is_submitter": "False", "link_id": "t3_5odacp", "parent_id": "t3_5odacp", "score": "3", "subreddit": "shmups", "subreddit_id": "t5_2r4cd"}]