[{"author": "Party_Basket101", "body": "Hindi, Japanese, Portuguese, Korean, Egyptian Arabic, French, German, and Mandarin all have wide bases for different forms of media.", "created_utc": "1664851056.0", "edited": "False", "id": "iqyvrqg", "is_submitter": "False", "link_id": "t3_xtu4eo", "parent_id": "t3_xtu4eo", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "Went to France this summer— Arles was also pretty awesome if you like the daytime history stuff more. I would also recommend Aix as well.", "created_utc": "1664560965.0", "edited": "False", "id": "iqj0d9q", "is_submitter": "False", "link_id": "t3_xryi5i", "parent_id": "t3_xryi5i", "score": "2", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Party_Basket101", "body": "I went to Paris hoping this stereotype wasn’t true- and luckily, it wasn’t! I was absolutely amazed at how accommodating and welcoming the people were. However, I speak French, and I think that can hugely impact your experience. People warm up to you almost instantly when you make an effort to speak the language. That’s why I always recommend learning the basics of French before travelling there. Even though you can survive in Paris with English, learning a bit of French will make your time in Paris so much better.", "created_utc": "1661693553.0", "edited": "False", "id": "im4jeb0", "is_submitter": "False", "link_id": "t3_wzp66h", "parent_id": "t3_wzp66h", "score": "1", "subreddit": "travel", "subreddit_id": "t5_2qh41"}, {"author": "Party_Basket101", "body": "Most of it looks good. I would add in diamond push ups (10 reps x 3 sets) and take out wrist curls and wrist extensions as well as lat raises (those are not really push day items).", "created_utc": "1661554918.0", "edited": "False", "id": "ilxlte4", "is_submitter": "False", "link_id": "t3_wymm1r", "parent_id": "t3_wymm1r", "score": "1", "subreddit": "gainit", "subreddit_id": "t5_2s9bg"}, {"author": "Party_Basket101", "body": "Cantonese has over 80 million (!) native speakers. Just it’s usage in Hong Kong alone would be enough to guarantee its survival. \n\nTrust me, it’s not going anywhere anytime soon.", "created_utc": "1661469411.0", "edited": "False", "id": "ilst9cj", "is_submitter": "False", "link_id": "t3_wxcs47", "parent_id": "t3_wxcs47", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "I moved here just 6 years - but you can feel the difference everywhere you go. I pretty much stick to the Beaverton/LO these days. Really sad how terrible this city has become.", "created_utc": "1661468616.0", "edited": "False", "id": "ilsrgng", "is_submitter": "False", "link_id": "t3_wx1b2s", "parent_id": "t3_wx1b2s", "score": "1", "subreddit": "Portland", "subreddit_id": "t5_2qi2i"}, {"author": "Party_Basket101", "body": "Je vous conseille d’écouter cœur croisé, canopee, attrape rêve, et les jolies choses. Ils sont parmi mes chansons préférées, et quoi de plus, ils peuvent vous aider de vous détendre! Au moins, c’etait le cas pour moi mdr", "created_utc": "1661434977.0", "edited": "False", "id": "ilqdlqu", "is_submitter": "False", "link_id": "t3_wvfquk", "parent_id": "t1_ilq9bfh", "score": "3", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Party_Basket101", "body": "Polo et Pan - awesome electronic music with french vocals", "created_utc": "1661404571.0", "edited": "False", "id": "ilp3g65", "is_submitter": "False", "link_id": "t3_wvfquk", "parent_id": "t3_wvfquk", "score": "6", "subreddit": "French", "subreddit_id": "t5_2rd5t"}, {"author": "Party_Basket101", "body": "Switched to French during my first year of college last year after taking Spanish throughout middle and high school. If you are at a good level in Spanish (I was around B2/C1 in Spanish when I started taking French), learning French should be MUCH easier. You have the advantage of knowing English, which shares a ton of vocabulary with French, and know the basics of Romance language grammar through Spanish (as well as more vocabulary in common). In less than a year I’ve gotten to B2 in French. It’s definitely much easier than starting from scratch. \n\nNote of caution: At the beginning you may start mixing up languages since they are so similar. Don’t worrry though, they‘ll eventually start to separate out in your head.", "created_utc": "1660757699.0", "edited": "False", "id": "ikols9a", "is_submitter": "False", "link_id": "t3_wqkbnr", "parent_id": "t3_wqkbnr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "C’est dingue. Le Québec vit en français, donc ils devraient apprendre le français. Porquoi ces gens là sont toujours hesitant pour apprendre une autre langue??? Tout le monde apprend anglais, et ils peuvent pas apprendre le français? C’est pas le rocket science lol", "created_utc": "1660595592.0", "edited": "False", "id": "ikfhjyi", "is_submitter": "False", "link_id": "t3_wp1dyk", "parent_id": "t3_wp1dyk", "score": "16", "subreddit": "Quebec", "subreddit_id": "t5_2qhh9"}, {"author": "Party_Basket101", "body": "I have never been good at pottery. I can make a snake or a long worm out of plasticine but~~, probably,~~ you **probably wouldn’t** ~~won't~~ appreciate my art. Maybe, my talent remains hidden and **one which** the world isn't ready **to see** yet. However, I watched \"The Great Pottery Throw Down\", a reality **show** with potters who **are** trying to win and became the Top Potter. Same as all the ~~realities~~ **other reality TV shows**~~,~~  of course, but **nevertheless a** fun **show** ~~and~~ with good vibes. Each ~~edition~~ **episode** takes place in an adorabl**e**~~y~~ old-timey former factory in the U.K. The pieces of ~~potters~~ **pottery** are amazing. I ~~don't~~ know absolutely nothing about pottery ~~but~~ **yet** the show ~~won my heart.~~  **and it’s pottery won me over.**", "created_utc": "1660280471.0", "edited": "False", "id": "ijyh17m", "is_submitter": "False", "link_id": "t3_wm5aob", "parent_id": "t3_wm5aob", "score": "2", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "Party_Basket101", "body": "California. Plain, simple, yet elegant.", "created_utc": "1660279643.0", "edited": "False", "id": "ijyfnld", "is_submitter": "False", "link_id": "t3_wm23tl", "parent_id": "t3_wm23tl", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "Party_Basket101", "body": "My picks would be Honolulu (obviously), Denver (Rockies), and San Francisco (the bay/rolling hills)", "created_utc": "1659676055.0", "edited": "False", "id": "ij0m2py", "is_submitter": "False", "link_id": "t3_wg944e", "parent_id": "t3_wg944e", "score": "1", "subreddit": "AskAnAmerican", "subreddit_id": "t5_2uah7"}, {"author": "Party_Basket101", "body": "Vous avez raison d’aimer la France. C’est un pays extraordinaire. Il faut a mon avis changer la mentalité dont d‘etre fier de vos pays veut dire que vous pensez que il n’y a rien a changer. Les deux choses sont séparés. Ce soit la beauté d’un pays libre. On peut exprimer vos opinions sans avoir peur.", "created_utc": "1659077419.0", "edited": "False", "id": "ii3i8hc", "is_submitter": "False", "link_id": "t3_wart82", "parent_id": "t3_wart82", "score": "0", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "Party_Basket101", "body": "A ~~time~~ **while** ago I post**ed that** I wanted to read this book, but I ~~was~~ **had already been** reading another one (Bridgerton). Well, finally I finished that one, and I decided to ~~continue~~ **start** ~~with~~ this **one**; I remember I said ~~on that occasion~~ **the first time I read** it~~,~~ **that it** was a difficult book for me **to read** ~~the first time I read it~~**.** ~~and~~ I was really excited to see if that ~~was different~~ **had changed** now that ~~I have a better level in~~ my English skills **have improved**; The truth is it is **still** hard~~,~~ yet ~~but~~ I can understand a lot of thing**s** ~~for~~ **through** context**,** and in fact, I could remember a lot of vocabulary I ~~haven't~~ **hadn’t** use**d** since the **last** time I read it. I think **it’s** ~~is~~ amazing how I ~~can~~ **am now able to** recall all the words ~~that~~ **which I’d** hardly **ever** use**d** in my daily routine~~,~~**;** I'm going to continue reading because I would like to finish the book before the movie ~~is at the~~ **starts playing at the** cinema.\n\nGood Work! Keep working on those pesky tenses, I know they can be hard but eventually you’ll get it! Let me know if you have any questions.", "created_utc": "1658912288.0", "edited": "False", "id": "ihtv7pr", "is_submitter": "False", "link_id": "t3_w95pko", "parent_id": "t3_w95pko", "score": "1", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "Party_Basket101", "body": "That’s an error on my part: Kosovo should be gray as well.", "created_utc": "1658874951.0", "edited": "False", "id": "ihrz60r", "is_submitter": "True", "link_id": "t3_w819cy", "parent_id": "t1_ihrini6", "score": "2", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "Party_Basket101", "body": "Switzerland’s a bit of a strange case. They’re part of Schengen, but not the European Economic Area (unlike Norway, Iceland and Liechtenstein), making bilateral agreements with the EU instead. While functionally this results in the same policy the majority of the time, the Swiss are less tightly bound to agreements since they are only bilateral (no other parties involved), and hold referendums on adopting new policies before harmonizing their laws with the EU in common areas.", "created_utc": "1658817949.0", "edited": "False", "id": "ihonw4f", "is_submitter": "True", "link_id": "t3_w819cy", "parent_id": "t1_ihno8z8", "score": "6", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "Party_Basket101", "body": "Based off [this](https://en.wikipedia.org/wiki/Template:Supranational_European_Bodies) Euler diagram of supranational entities in Europe.", "created_utc": "1658785715.0", "edited": "False", "id": "ihmuoe1", "is_submitter": "True", "link_id": "t3_w819cy", "parent_id": "t3_w819cy", "score": "1", "subreddit": "MapPorn", "subreddit_id": "t5_2si92"}, {"author": "Party_Basket101", "body": "Point de vue américain:\n\nIl n’y a aucune question que la France a ses propres problèmes à l’égard des services publiques. Il faut le corriger. Quoi qu’il en soit, je vois tout ce qui passe en France avec les yeux étonnant. Parce que tout simplement, aux États-Unis, si vous allez au hôpitaux (surtout la salle d‘urgences), vous êtes toujours une blessure loin de la ruine financière. Nous devons dépenser milles de dollars pour une visite extrêmement court chez les médecins. Résultat: plein de gens n’y vont, ayant peur des coûtes très élevées. De plus, notre système d’assurance de santé c’est une blague. Les enterprises d’assurances fait toutes les choses pour ajouter le complexité, en espérant que les gens se seront rendus confus et achèteront l‘assurance le plus cher. Et ca porte leur lot de défis: nous devons toujours économiser de l’argent, et en faisant cela, nous oublions notre santé. Et ça s’étend partout sur les services publiques. Les trains sont terribles (nous avons Amtrak’s, et pour nous le TGV semble comme une idée 200 ans dan l’avenir par rapport), ainsi que les aéroports, toutes les infrastructures publique franchement. Nous avons déserts de hôpitaux dans le campagne. La même cas pour les vacances payé, il n’existe pas ici, c’est un concept étranger. Nous sommes le plus riche pays du monde, mais ces défis existe toujours quand-même.\n\nBref: La France doit améliorer leur hôpitaux, mais globalement, l’autre côté de l’Atlantique c’est pire.", "created_utc": "1658533588.0", "edited": "1658551144.0", "id": "ih9apcy", "is_submitter": "False", "link_id": "t3_w54wvs", "parent_id": "t3_w54wvs", "score": "3", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "Party_Basket101", "body": "J'ai un petit neveu, il ~~est~~ **a** 9 ans et il est tellement obsédé par ~~avec~~ YouTube\\*\\*;\\*\\*~~,~~ il passe **beacoup de temps en regardent** ~~des heures à regarder~~ des vidéos sur ~~des~~ **les** extraterrestres, ~~des~~ **les** jeux vidéo, ~~des~~ **les** films, ~~des~~ **les** dessins animés, etc. Je comprends bien que la vie ~~de~~ **d’un** Youtubeur est très ~~attractive~~ attrayante pour un petit gamin de la génération Z et j'essaie **donc** de **lui** \\~\\~l’\\~\\~encourager ~~à~~ chaque fois que je peux, même si je ne comprends pas son obsession MDR.À la prochaine les amis !\n\n&#x200B;\n\nBien écrit! Juste quelques petites erreurs. Bon apprentissage!", "created_utc": "1655030806.0", "edited": "1655031347.0", "id": "ic2oyhk", "is_submitter": "False", "link_id": "t3_v9o0jo", "parent_id": "t3_v9o0jo", "score": "2", "subreddit": "WriteStreak", "subreddit_id": "t5_2dm6a0"}, {"author": "Party_Basket101", "body": "Let’s hope Rudolph’s nose isn’t an indicator of his politics😭", "created_utc": "1655009692.0", "edited": "False", "id": "ic1zzhz", "is_submitter": "True", "link_id": "t3_vabik7", "parent_id": "t1_ic1koib", "score": "4", "subreddit": "nottheonion", "subreddit_id": "t5_2qnts"}, {"author": "Party_Basket101", "body": "I actually went the other way (my Spanish was upper B2/lower C1) and I started learning French last year. I am now at around B2 one year later. Keep in mind though, I am taking university courses in French, and try actively to immerse myself in the language whenever possible. A lot of the grammar is the same, which helps a lot (you don’t have to relearn the subjunctive, etc.) It’s doable, but you have to put in the work, just like any other language.\n\nOne more thing: as you learn more Spanish, you may find yourself weaker in French. This is normal, since the 2 languages are closely related, and over time they will start to separate themselves out.", "created_utc": "1654721819.0", "edited": "False", "id": "ibnkvji", "is_submitter": "False", "link_id": "t3_v7swpf", "parent_id": "t3_v7swpf", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "Ah yes, Canada. Notorious for its extremely dangerous cartels\\*\n\n&#x200B;\n\n^(\\*Cartels of) *^(maple syrup)*", "created_utc": "1654580964.0", "edited": "False", "id": "ibghn9r", "is_submitter": "False", "link_id": "t3_v6hd0u", "parent_id": "t3_v6hd0u", "score": "1", "subreddit": "nottheonion", "subreddit_id": "t5_2qnts"}, {"author": "Party_Basket101", "body": "Well said, I totally agree.", "created_utc": "1654579393.0", "edited": "False", "id": "ibgfjdo", "is_submitter": "False", "link_id": "t3_v6brfh", "parent_id": "t1_ibgdjga", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "C’est un phénomène qui existe partout, pas seulement en France et la francophonie. Ici aux états-unis c’est pas difficile pour trouver des gens fous sur le web, n’importe où. Franchement, c’est souvent les gens qui ont des avis très mal informés qui postent dans les commentaires. L’internet aime la controverse malheureusement", "created_utc": "1654579126.0", "edited": "1654579618.0", "id": "ibgf5j8", "is_submitter": "False", "link_id": "t3_v686m6", "parent_id": "t3_v686m6", "score": "6", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "Party_Basket101", "body": "First of all, kudos for throwing yourself into a totally new environment with a different language. That takes a lot of commitment and strength.\n\nDon’t worry too much about making errors. Often times, when we are thinking too much about how to do something perfectly, we end up making more mistakes. I encourage you to watch [this](https://www.youtube.com/watch?v=CqgmozFr_GM) brief Ted-Ed video that explains the concept of pressure (It talks mainly about sports or performances, but it definitely applies in this situation.)\n\nFinally, you have the advantage of learning a language which has an amazingly wide scope of resources and entertainment to choose from. In fact, English is so entrenched in the web now that it is very hard to avoid it, and that constant exposure will certainly help you continue to gain fluency. You will continue to learn it consciously and unconsciously simply due to the massive amount of content available.\n\nGood luck!", "created_utc": "1654578296.0", "edited": "False", "id": "ibgdyss", "is_submitter": "False", "link_id": "t3_v6mft6", "parent_id": "t3_v6mft6", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "I would disagree with the idea that only looking at “developed“ countries gives a clear advantage to Spanish. \n\nFrance (68 mil.) + Canada (8 mil.) + Belgium (4.5 mil.) + Switzerland (2.1 mil.) + Luxembourg (0.6 mill.) = around 83.4 million speakers in (highly) developed countries \n\nSpain (47.4 mil.) is arguably the only *truly* developed country where Spanish is the primary language (and even at that, there are several prominent minority languages Eg. catalan, basque). While it’s hard to quantify the line between developed and developing countries (a concept which is itself quite arbitrary), most international economists would say that criteria for being developed would include a “very high” HDI, OECD membership, and a designation as an “advanced economy” or “high-income economy“ by the IMF and World Bank, respectively, among other things. Thus, using these indicators, French wins (83.4 mil. vs 47.4 mil.)\n\nIf you add economies that meet some, but not all of these criteria, it starts to become a bit more fuzzy, as you could easily include Chile (19.1 mil.), Uruguay (3.5 mil.), Argentina (44.3 mil.), Costa Rica (5.2 mil.) and Panama (4.3 mil.), which gets you up to around 123.8 million for Spanish vs 83.4 million for French. Spanish wins in this case, but not by a massive amount.\n\nNote that this is only for countries where French and/or Spanish are the principal languages. If you count Spanish in the US, or even the French in the EU (not a country obviously, but still an important geopolitical force), things get even more complicated. \n\nTl;dr It’s really complicated, and largely depends on how you define what “developed” as.", "created_utc": "1654575897.0", "edited": "False", "id": "ibgaef5", "is_submitter": "False", "link_id": "t3_v6brfh", "parent_id": "t1_iben9sm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "Don’t beat yourself up over it. Colloquialisms can make it hard to understand for sure. Its a slow process, but over time your ears will become more in tune with the language. The saying ”practice makes perfect“ may be a cliche, but it is true nonetheless.", "created_utc": "1654240520.0", "edited": "False", "id": "ib0f3to", "is_submitter": "False", "link_id": "t3_v3mzgv", "parent_id": "t3_v3mzgv", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Party_Basket101", "body": "But - very common, a way to indicate a condition that may change an outcome.  (“I would go outside but it’s raining”\n\nHowever - more specific to a certain point. (He gave a good interview. However, we should consider his flaws.)\n\nnonetheless - more formal, used to indicate that, despite certain conditions that may occur, the point still stands (Though I only received a bit of money, I am grateful nonetheless)\n\nalthough - similar to but more or less\n\ndespite - a word to show how someone or something overcomes an obstacle (Despite our lack of funds, we were able to pay the rent.”", "created_utc": "1654240389.0", "edited": "False", "id": "ib0eyif", "is_submitter": "False", "link_id": "t3_v3tg5l", "parent_id": "t3_v3tg5l", "score": "5", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Party_Basket101", "body": "On economic power, languages in countries with large, developed economies would place the highest. English is obviously number 1 (and the only tier 1 language), but after that I’d say that German, French,  Japanese, and probably Chinese would be placed as tier 2 languages. Germany and France have very strong large economies and are seen together as the engine of the European Union (a developed geopolitical entity that could someday rival the US) English, German, and French are the most commonly spoken languages throughout the EU, and all 3 are used by the European Commission. Japan still has enormous economic power (it’s the 3rd largest economy in the world), and is also a highly-developed country. China is still developing, but it’s expansive economy is enough to place Chinese with the other 3 languages. An argument could be made for Spanish, but the economy of Spain is relatively weak and most Latin American countries are still developing (lower GDP/capita)\n\n**Tl;dr**\n\n**Tier 1: English**\n\n**Tier 2: French, German, Japanese, Chinese**", "created_utc": "1653780671.0", "edited": "False", "id": "iada9cg", "is_submitter": "False", "link_id": "t3_uzlfqn", "parent_id": "t1_iacv9b5", "score": "20", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "Kaixo! What are some of your favorite words in Basque? Also, how do you feel about the position of Basque relative to other minority languages in Spain/France? Would you say more people in Basque Country are becoming fully bilingual? (I know there has been repression of the language, and am wondering if Basque is becoming more common to use among younger generations)", "created_utc": "1649659286.0", "edited": "False", "id": "i49iacw", "is_submitter": "False", "link_id": "t3_u0othe", "parent_id": "t3_u0othe", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "I love reading but I didn't know **(until recently)** that the \"Noir novel\" is called \"Hard boiled\" in English. It's a great name. I've learned that it's a literary **sub-**genre within the ~~police~~ **crime**  genre in which the police are characterized by their tendency towards violence and corruption. The typical police**man** ~~who~~ **in this genre** is always drunk**,** but still solves the case and shoots the bad guy with~~out~~ **no** doubt and ~~without his hand shaking~~  **and a steady hand** (I don't know why. Maybe **it’s** precisely because he is drunk) The police ~~here~~  **in this literary genre are** ~~is~~ also **portrayed** ~~a~~  **as** tough guy**s;** maybe not very handsome**,** but **still** successfully with the ladies.\n\nNice work! Feel free to ask if you have any questions.", "created_utc": "1649107119.0", "edited": "False", "id": "i3elcyi", "is_submitter": "False", "link_id": "t3_tw7628", "parent_id": "t3_tw7628", "score": "2", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "Party_Basket101", "body": "Également j’aime la musique et les chaînes qui donne des faits amusants", "created_utc": "1647854720.0", "edited": "False", "id": "i1ie9k4", "is_submitter": "True", "link_id": "t3_tj6o5m", "parent_id": "t1_i1icdlo", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "Party_Basket101", "body": "Merci pour les suggestions :)", "created_utc": "1647851332.0", "edited": "False", "id": "i1iah2l", "is_submitter": "True", "link_id": "t3_tj6o5m", "parent_id": "t1_i1i9upc", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "Party_Basket101", "body": "Merci! Ça semble intéressant!", "created_utc": "1647851280.0", "edited": "False", "id": "i1iaezx", "is_submitter": "True", "link_id": "t3_tj6o5m", "parent_id": "t1_i1i9six", "score": "1", "subreddit": "france", "subreddit_id": "t5_2qhjz"}, {"author": "Party_Basket101", "body": "Generally I’d say the best way to improve your english is through consuming media and digital content (e.g. YouTube, Netflix, Twitter, really any social media app tbh). English dominates all over the web, so try to take in a lot of content (both through listening and reading), and forming more natural sounding sentences will come over time. There are also many resources online to practice grammar if you need them.", "created_utc": "1647850496.0", "edited": "False", "id": "i1i9jeo", "is_submitter": "False", "link_id": "t3_tj5y8p", "parent_id": "t3_tj5y8p", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Party_Basket101", "body": "Basically, it’s saying that someone who needs a religion to be able to fully see, understand, and empathize with things in this world has a “limited mind” (in the sense that the religion so thoroughly guides them that they can’t see life through any other way) or a ”corrupt heart” (someone who has “sold“ their morality, which is symbolized by the heart, in order for power, money, etc., and uses a religion for the justification of such power abuses)", "created_utc": "1645911458.0", "edited": "False", "id": "hykbkn6", "is_submitter": "False", "link_id": "t3_t2327t", "parent_id": "t3_t2327t", "score": "0", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Party_Basket101", "body": "If you’re talking about Zelinsky, it would probably go something like this:\n\n“Zelinsky is a brave leader, one which any country would dream of having.”", "created_utc": "1645911167.0", "edited": "False", "id": "hykavrb", "is_submitter": "False", "link_id": "t3_t23tg5", "parent_id": "t3_t23tg5", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Party_Basket101", "body": "Just a sentence where the verb is placed to indicate giving a command, similar to “make the bed” or “do your homework”", "created_utc": "1645598364.0", "edited": "False", "id": "hy2l2gh", "is_submitter": "False", "link_id": "t3_sz7hl2", "parent_id": "t3_sz7hl2", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Party_Basket101", "body": "French! (Native english speaker) Its such a beautiful language and I hope to work in economic development/banking and/or international orgs where the language would be useful. Also really want to study abroad in Paris.", "created_utc": "1644655255.0", "edited": "False", "id": "hwmfhx1", "is_submitter": "False", "link_id": "t3_sqgq2n", "parent_id": "t3_sqgq2n", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Party_Basket101", "body": "There shouldn’t be a problem with using ”when“ + a preposition that I can think of. ”When ripe” works just fine in this phrase.", "created_utc": "1644654879.0", "edited": "False", "id": "hwmeyy1", "is_submitter": "False", "link_id": "t3_sqmt3k", "parent_id": "t3_sqmt3k", "score": "2", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "Party_Basket101", "body": "After 6 months of working for the third time ~~in~~ **with** the company, I have to say that it has been a pleasure to work there. I**’ve** learned a lot, and I was able to heal the bad relationship that I had with the company~~.~~**, as** ~~My~~ **my** previous experiences **there** weren't that good. However, this time, I was able to ~~heal the~~ **move past those** bad experiences that I had had ~~in~~ **with** the company ~~within me and to get to know my~~**, which allowed me to develop my** own opinion of **the** different employees **there**. It was a short time working there, but it was very productive, enriching, and powerful. I'm glad that I had this opportunity to ~~get this things straight and healed~~ **straighten things out and fully heal.**\n\nGood work! Make sure to use the right articles, prepositions, and descriptors as necessary :)", "created_utc": "1644654456.0", "edited": "False", "id": "hwmedc1", "is_submitter": "False", "link_id": "t3_sqjbmy", "parent_id": "t3_sqjbmy", "score": "1", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "Party_Basket101", "body": "Today is a rainy day. **It’s** The perfect day to stay in bed and listen **to** the rain. But..Noooo!! I need to work! For the evil metal. I like and don't like the rain. I like it because the sound **of it** is so relaxing**,** and **I** don't like it because I**t** **makes me** think of all the cat**s** and dog**s** who lives in the street. I am an animal lover, I have 4 cats and 3 dogs. If I ~~have~~ **had** more space in my house, I ~~adopted~~ **would adopt** every street animal. Close to my house, ~~I have~~ **there is** a really big park and it's full of homeless cats. The people ~~food~~ **feed** ~~this~~ **these** cat**s** and I have been ~~doing~~ **feeding them** too. ~~I and my dogs~~ **My dogs and I** have been walking in this park every day, even ~~in~~ **during** the lockdown. I **will** talk about my dogs and cats in another post, they need several posts.🐕🐕🐕🐈🐈🐈🐈 I only think ~~in~~ **to** rush **in**to my house to see the rain behind the windows **while** lying down in the bed~~. I think I have been very~~  **which makes me feel a bit** hypocritical**.** I talk about the homeless cat**s** and dog**s,** ~~and~~ **yet** I have a roof and cozy place. I love rainy days, and the rain **has** inspire**d** me today. Do you like rainy days?🌧\n\n&#x200B;\n\nNice work! Make sure to keep working on those pesky verb conjugations ;)\n\nAn easy way to avoid using the personal pronoun ‘I’ to often is to use other words like it/there or a use of a gerund etc. (e.x. Instead of ‘I enjoy going to school’, ‘Going to school is something that’s enjoyable to me’)", "created_utc": "1644635279.0", "edited": "False", "id": "hwlh8e2", "is_submitter": "False", "link_id": "t3_sq7sap", "parent_id": "t3_sq7sap", "score": "3", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "Party_Basket101", "body": "I've been watching Olympics at work during my lunch time these days because my colleagues ~~like that~~ **like watching it**. I watched snowboarding a few days ago, and it made me want to start snowboarding. I'm not 30 years old yet, but I don't want to start learning **how to** snowboard~~ing~~ during the pandemic. If I broke a bone during snowboarding, I'm not sure I ~~can~~  **could** get ~~enough~~ any medical care ~~under~~ given the ~~recent~~ **current** situation. But if I wait until the pandemic ends, I might be 30 years old by then. Is that too late? I hope not.\n\nNice work! I personally believe that you can start snowboarding (or many other winter sports for that matter) as long as you are healthy, active, and fit.", "created_utc": "1644634495.0", "edited": "False", "id": "hwlfjwa", "is_submitter": "False", "link_id": "t3_sqgbxy", "parent_id": "t3_sqgbxy", "score": "2", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "Party_Basket101", "body": "Today, I woke up with a mild headache. There ~~are~~ **were** no classes today, so luckily I wasn't in a hurry. I had plenty of time to have a cup of coffee and breakfast. I ~~had known~~ **knew** that cream cheese crepes were waiting for me, but not the usual ones, as it turned out.  \nUsually, we buy frozen rolled crepes with different fillings. They have to be roasted again to be hot and ready to eat. But ~~those~~ **the ones** I had this morning were ~~never~~ **not the** frozen **kind,** and had a squarish form. Since you don't have to roast them, they don't have ~~any~~  **the usual** crispy crust **(**which I ~~like so much~~ **like a lot).** Moreover, they are sweeter, and the filling isn't that creamy.  \nIt would be a lie if I said I didn't enjoy them, but I miss my frozen rolled crepes.\n\nGood job! A few errors with tense conjugation, but overall nice work!", "created_utc": "1644576605.0", "edited": "False", "id": "hwhnhxl", "is_submitter": "False", "link_id": "t3_spw9x3", "parent_id": "t3_spw9x3", "score": "2", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "Party_Basket101", "body": "I don't know how and why ~~I am arrived~~ **I’m** here but... I am ~~arrived here~~! :)So, First: Hello!I am Flowerly\\_Dream.I am on the application Duolingo, to learn many languages. And on the forum of Duolingo, I saw a post with a link to WriteStreakEN. And ~~I am here now!~~  \\*\\*that‘s how I got here!\\*\\*So, I like to read **long** ~~BIG~~ books (~~bigger~~  **the longer** ~~they are~~, ~~more I like it~~ **the better)**. I like to draw too and I like to write novels. I like to learn languages and to learn in general.What do I not like?~~I don't like~~? Well... I don't like rainy days and angry people...I am French, So I live in France and I ~~learn~~ **have learned** many languages: English (of course!), spanish, greek (I don't know why) and esperanto (Don't ask my why. I don't know!).I am very happy ~~because~~ **that** I can speak in english here, and ~~do~~ **make** mistakes, and it is not important. It's so cool ! :)Ok, I think that I said everything that I wanted to say.Have a nice day !\n\nBon travail! Je crois que tu peux parler anglais assez bien! Il y avait un peu des erreurs que tu as fait, mais, globalement, tres bien!\n\nUn peu de conseil: On utilise le mot “make” quand on écrit à propos des erreurs. Par example: “I make mistakes.” Également on dit « I arrived » ou « I have arrived » quand en utilisant le passé composé ou l’imparfait.\n\nEdit: Native English speaker and can speak French at a B2/C1 level!", "created_utc": "1644575838.0", "edited": "1644576052.0", "id": "hwhmjrk", "is_submitter": "False", "link_id": "t3_spvzde", "parent_id": "t3_spvzde", "score": "2", "subreddit": "WriteStreakEN", "subreddit_id": "t5_2y42lo"}, {"author": "Party_Basket101", "body": "There are apps which can help you connect to other English speakers (who are also in the process of learning English). Also, if you have any friends and family who speak English, maybe try and give them a call to practice your oral skills. Also, feel free to DM me, would love to talk with a native French speaker (I’m learning french right now and am a native english speaker)", "created_utc": "1643839115.0", "edited": "False", "id": "hvc2ihg", "is_submitter": "False", "link_id": "t3_sj12bj", "parent_id": "t3_sj12bj", "score": "6", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}]