[{"author": "Peasant-Homework-413", "body": "I am somewhat interested in learning it but it's honestly not much of a priority, my field of studies and (hopefully) future field of work is diplomacy and while India is very relevant, English serves that purpose well and in some ways even better due to the linguistic diversity of the country. I'm inclined to learn because of the cultural significance but i don't think i aspire to ever be fluent, as opposed to other laguages that i do hope to eventually be proficient in.\n\nTo counter your post a bit though, Bollywood and other forms of Indian cultural influence may be huge but in many countries they're just starting to become relevant. Here in South America, Indian influence is decades behind countries like Korea or China, not to even mention european countries, but you can see it, maybe in some years there will be a greater interest as trade is also increasing,", "created_utc": "1666721836.0", "edited": "False", "id": "itr534e", "is_submitter": "False", "link_id": "t3_yclmz7", "parent_id": "t3_yclmz7", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Peasant-Homework-413", "body": "I didn't quite catch from the first read that you meant predominantly in terms of interpersonal relationships, in that sense i can only agree that it should pretty much be treated as a red flag.", "created_utc": "1666667137.0", "edited": "False", "id": "itoecsl", "is_submitter": "False", "link_id": "t3_yctify", "parent_id": "t1_itoc0kd", "score": "1", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "Peasant-Homework-413", "body": "You live in a country with a two-party system, politically active people have only two institutionally relevant options to support. Now, i lean very left myself on most issues but it's not hard to see that there's variety when it comes to conservatives and if the USA had a multy-party system that would show.\n\nThat said, i can only partially dispute your title. If you mean that it is reasonable to generalize then yes, of course go right ahead as those are dominant views within the party. But i think it's also reasonable to give people the benefit of the doubt as they could be way closer to centrists than one would think.", "created_utc": "1666665543.0", "edited": "False", "id": "itob16v", "is_submitter": "False", "link_id": "t3_yctify", "parent_id": "t3_yctify", "score": "15", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "Peasant-Homework-413", "body": "Ok that's a lot of ideas and many i think come from a lot of your own misconceptions on a pretty complex issue. First of all, i'm from a palestinian migrant family (3rd gen) and also have studied a lot of Near East politics and history.\n\nThe first thing i want to address is you completely dismissing there being a valid colonial perspective on the subject. You seem to be aware of the British occupation post WWI as the context in which Israel was formed as a state. Sionism was an initiative of european jews and the vast majority of the migration into british palestine were indeed european jews, for the local population, the effects aren't much different to any other colonial project just because the colonizing population constitutes a minority in the occupying power and surrounding territories.\n\nGoing into the Nakba itself, you are clearly aware of the existance of informal hostilities before the proposed partition so you can't possibly believe that such a resolution was going to last and while i am well aware of the discourse on both sides of the conflict, Israel was the one guilty of ethnic cleansing with hundreds of thousands of arabs being expelled of their villages and cities never to be allowed to return. Additionally, the perception of the war as a conflict of ruthless aggressors against an innocent victim is flawed, the recently independent governments had every reason to fear one another as from it's inception the Israeli leadership had the objective of establishing a jewish majority state and there was no peaceful way to achieve such feat, conflict was unavoidable and it's perpetuation was more than incetivized by the influx of the previously mentioned refugees into neighbouring countries.\n\nOnwards you have mostly characterized the Israeli leadership as a passive actor that simply responds to it's environment and various palestinian actors as active parts that act on their own motivation. Viewing any conflict from this lense will make the latter part look unreasonable. Between the Nakba and Naksa palestinians even within Israel proper were under military rule and Palestine was not faring great having received a massive wave of destitute refugees not 20 years before which are also conditions that favour the growth of radicalism within political circles. All that while tensions rised in the context of the cold war.\n\nFinally, after Israel emerged victorious of the Six Day War the intention to populate the captured territories was clear and rapidly implemented (see Allon Plan for example), under such conditions at no point have negotiations really come close to the formation of a viable and independent palestinian state.\n\nI guess i dropped more of a general historic view but as a comment: Palestinian people are not the bloodthirsty antisemites that you think or at the very least not any more than plenty of Isrealis are bloodthirsty racists. Israel is not a passive actor of it's own story and the current horrible status quo has been shaped by Israeli leaders at least just as much as by Palestinian leaders. Right now there is no possible way for the palestinian territories (as in occupation areas A and B) to behave as anything resembling a sovereign state and at some point Israel will have to somehow confront the reality of the left behind non-jewish population that inhabits those pockets of land, even if it conlicts with the idea of the ethnic and religious character of the government.", "created_utc": "1666655546.0", "edited": "False", "id": "itno7hc", "is_submitter": "False", "link_id": "t3_ycls8k", "parent_id": "t3_ycls8k", "score": "2", "subreddit": "changemyview", "subreddit_id": "t5_2w2s8"}, {"author": "Peasant-Homework-413", "body": "NTA your reasoning is sound. Make sure your boyfriend understands the amount of stress raising two children will involve and that you should both be in full agreement over changes to the home environment.", "created_utc": "1666629982.0", "edited": "False", "id": "itlwudu", "is_submitter": "False", "link_id": "t3_ycfmpl", "parent_id": "t3_ycfmpl", "score": "23", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "It wouldn't be unheard of for a nanny It isn't precisely a formal environment and does include moving around a lot, specially with a 5 yo involved.", "created_utc": "1666629695.0", "edited": "False", "id": "itlw3mb", "is_submitter": "False", "link_id": "t3_ycfn1v", "parent_id": "t1_itluqur", "score": "13", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "NTA he invited you and you used the opportunity to get some closure on the whole situation. You are not obligated to meet their expectations and their immediate reaction to your refusal shows that you made the right choice.", "created_utc": "1666629484.0", "edited": "False", "id": "itlvk8l", "is_submitter": "False", "link_id": "t3_ycfrv8", "parent_id": "t3_ycfrv8", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "First of all, yes, you can set whatever rules you want for people entering your home and interacting with your children, but your post seems to ask wether or not those rules are reasonable so i'm responding based on that.   \nYTA you may work in an environment where strict dress codes are the norm but being a nanny doesn't really enter that area. Aditionally, the way you express this also sounds very judgemental of the way she dresses, she may have caught that in conversation too and therefore doesn't feel like working for you will work out.", "created_utc": "1666629188.0", "edited": "False", "id": "itlut72", "is_submitter": "False", "link_id": "t3_ycfn1v", "parent_id": "t3_ycfn1v", "score": "100", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "No you don't, there are many ways to excuse yourself from the service. You can either show any medical condition (most things will work, but specially sight, respiratory, dental or mobility related) or just present proof that you intend to study.", "created_utc": "1666496231.0", "edited": "False", "id": "itf09pm", "is_submitter": "False", "link_id": "t3_yao921", "parent_id": "t1_ited4pp", "score": "2", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Peasant-Homework-413", "body": "How is it paranoid to tell someone who is in a very vulnerable situation to be extra careful. Most people had a normal week, OP is not having a normal week and needs to take precautions.", "created_utc": "1666283154.0", "edited": "False", "id": "it35zf5", "is_submitter": "False", "link_id": "t3_y90ei9", "parent_id": "t1_it342q5", "score": "31", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Peasant-Homework-413", "body": "Oh no worries. I do recommend reading on the controversy and the four great caliphates tho, it's quite fascinating and also contains pretty relevant periods of history that are often misrepresented so misconceptions are very common.", "created_utc": "1665608412.0", "edited": "False", "id": "is2kqhv", "is_submitter": "False", "link_id": "t3_y1liut", "parent_id": "t1_is2jok3", "score": "3", "subreddit": "NonCredibleDiplomacy", "subreddit_id": "t5_51kl0n"}, {"author": "Peasant-Homework-413", "body": "Not precisely. The Shia and Sunny controversy occured at the end of Caliph Ali's rule, Mohammed had been dead for a few decades already, Shia simply means follower of Ali and Sunni are the followers of the Omeya caliphate that followed. Also while there Are many differents in belief and practice, jihad isn´t one of them or at least not in that sense. You might be referring to the difference between greater jihad (struggle of the self) and lesser jihad (defense of the community, not necessarily in a belicose way).", "created_utc": "1665607559.0", "edited": "False", "id": "is2ifzq", "is_submitter": "False", "link_id": "t3_y1liut", "parent_id": "t1_is0uhoj", "score": "4", "subreddit": "NonCredibleDiplomacy", "subreddit_id": "t5_51kl0n"}, {"author": "Peasant-Homework-413", "body": "NTA and this post also would fit r ChoosingBeggars", "created_utc": "1665510254.0", "edited": "False", "id": "irwznxu", "is_submitter": "False", "link_id": "t3_y16i36", "parent_id": "t3_y16i36", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "RemindMe! 1 day", "created_utc": "1663981310.0", "edited": "False", "id": "ipnxcq6", "is_submitter": "False", "link_id": "t3_xm9bi0", "parent_id": "t3_xm9bi0", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "Podríamos hacer un discord o plataforma similar para ir coordinando fecha y lugar.", "created_utc": "1662483198.0", "edited": "False", "id": "inc1u3i", "is_submitter": "False", "link_id": "t3_x6q1k1", "parent_id": "t3_x6q1k1", "score": "4", "subreddit": "kurzgesagt_meetup", "subreddit_id": "t5_6wry41"}, {"author": "Peasant-Homework-413", "body": "Hola, también apañaría a fin de mes luego de las fiestas", "created_utc": "1662482791.0", "edited": "False", "id": "inc0se8", "is_submitter": "False", "link_id": "t3_x6q1k1", "parent_id": "t1_inbgc1t", "score": "3", "subreddit": "kurzgesagt_meetup", "subreddit_id": "t5_6wry41"}, {"author": "Peasant-Homework-413", "body": "RemindMe! 2 days", "created_utc": "1661471512.0", "edited": "False", "id": "ilsxxh1", "is_submitter": "False", "link_id": "t3_wx927h", "parent_id": "t3_wx927h", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "RemindMe! 10 days", "created_utc": "1661470176.0", "edited": "False", "id": "ilsuzff", "is_submitter": "False", "link_id": "t3_wx580k", "parent_id": "t3_wx580k", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "NTA - Your father is also in a terrible situation there, but it's reasonable for you to have pent up anger, he did encourage you to make an important decision based on false promises. As others have suggested, calling CPS on your sister will probably be for the better given how long the problem has been going on.", "created_utc": "1660156263.0", "edited": "False", "id": "ijr3fc3", "is_submitter": "False", "link_id": "t3_wl4evm", "parent_id": "t3_wl4evm", "score": "4", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "NTA but don't yell at her, these situations can escalate if you don't communicate properly. You are definitely right to be upset though.", "created_utc": "1660155855.0", "edited": "False", "id": "ijr2byy", "is_submitter": "False", "link_id": "t3_wl4fl4", "parent_id": "t3_wl4fl4", "score": "2", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "NTA - As you said, the other kids already have a mom, you have a special place in Ava's life  that is different from the one you have in your other step kid's. Specially since you mostly do these activities when her siblings aren't around and where she could be feeling the most down because of her terrible biomom.   \nHopefully you can get your husband to understand that, while you love all your kids, the activities you do with Ava are probably very important in making her feel loved and actually having a mother figure, instead of having to be constantly reminded of the abandonment she went through.", "created_utc": "1660155096.0", "edited": "False", "id": "ijr0ap6", "is_submitter": "False", "link_id": "t3_wl43ts", "parent_id": "t3_wl43ts", "score": "11", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "RemindMe! 3 days", "created_utc": "1660149743.0", "edited": "False", "id": "ijqlr1c", "is_submitter": "False", "link_id": "t3_widgnv", "parent_id": "t1_ijesz9i", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Peasant-Homework-413", "body": "RemindMe! 3 days", "created_utc": "1659806158.0", "edited": "False", "id": "ij7h0an", "is_submitter": "False", "link_id": "t3_wf2f1p", "parent_id": "t1_iirte3o", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Peasant-Homework-413", "body": "Thank you!", "created_utc": "1656297153.0", "edited": "False", "id": "idvscmn", "is_submitter": "True", "link_id": "t3_vl9pli", "parent_id": "t1_idtukab", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Peasant-Homework-413", "body": "Thank you, found them great. Also Holm truly is beautiful!", "created_utc": "1656297137.0", "edited": "False", "id": "idvsbg5", "is_submitter": "True", "link_id": "t3_vl9pli", "parent_id": "t1_idtvce0", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Peasant-Homework-413", "body": "I applied, had my interview today and immediately 'got' the scholarship. Their payment conditions are hasty (almost scam-like) and it's quite a lot of money, may be real but i don't trust it. It also doesn't look like their connection to actual UN institutions is that relevant other than using the space.   \nI wont be participating as it does not look like they are to be trusted.", "created_utc": "1638302739.0", "edited": "False", "id": "hmpcrvk", "is_submitter": "False", "link_id": "t3_r5fc7h", "parent_id": "t3_r5fc7h", "score": "1", "subreddit": "MUN", "subreddit_id": "t5_2saa5"}, {"author": "Peasant-Homework-413", "body": "Hi, i just had interview and was offered the scholarship as well, the payment conditions and the speed of all of it seemed suspicious so i came here to check any similar case. ¿Have you received any answer since you sent the application?", "created_utc": "1638301606.0", "edited": "False", "id": "hmp9xt2", "is_submitter": "False", "link_id": "t3_iy6rsj", "parent_id": "t1_glv64iy", "score": "1", "subreddit": "MUN", "subreddit_id": "t5_2saa5"}, {"author": "Peasant-Homework-413", "body": "Wow, just wow. No wonder your boyfriend wants to break up with you, i hope that poor child doesn't grow up with you as a step mom.", "created_utc": "1631206911.0", "edited": "False", "id": "hc79w74", "is_submitter": "False", "link_id": "t3_pkoblu", "parent_id": "t1_hc4v7mp", "score": "66", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "Peasant-Homework-413", "body": "It's completely normal! Most people in their 20s have already started their sexual life and its completely fine to have done it or to wait more. Besides that, it's very common for ones first experience to be sub-par, still sucks but you're definitely not alone.\n\nNow, guys who care about virginity on a partner tend to be creeps so if a person that you're interested in shows that just run the other way. I say this as a guy in my 20s myself, if a potential partner cares abt wether or not they're your first one thats very possibly a red flag. If they call you \"dirty\" theyre definitely creeps.", "created_utc": "1623283057.0", "edited": "False", "id": "h17wx93", "is_submitter": "False", "link_id": "t3_nw9quh", "parent_id": "t3_nw9quh", "score": "6", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Peasant-Homework-413", "body": "This sounds more of an issue of attitude rather than political views, have you tried talking to her directly about it? if she understands that her behaviour bothers you she may be willing to adapt, if not then you should just directly set boundaries and tell her youd rather not talks politics. If that ends the friendship then there was no helping it.\n\nPeople can definitely put aside their political differences and be friends, specially when they aren't that broad. I consider myself a pretty politics invested person and yet i have several acquintances and friends that think differently in a lot of topics, granted im only in my 20s but half of my family works/has worked in politics-related fields and i only observe the opposite trend; older people tend to care less about political differences.", "created_utc": "1623282535.0", "edited": "False", "id": "h17vv5y", "is_submitter": "False", "link_id": "t3_nw9jo3", "parent_id": "t3_nw9jo3", "score": "1", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}, {"author": "Peasant-Homework-413", "body": "Dude no, relationships do mean having to accept someone elses habits and needs which may require adapting yourself a bit but this is out of line. There has to be a level of mutual respect and if this has been going on for two weeks she's not having that minimum consideration for you.\n\nI get that you are not \"confrontational\", but clearly expressing your feelings about something is not being confrontational, is basic relationship communication.", "created_utc": "1623281842.0", "edited": "False", "id": "h17ugrr", "is_submitter": "False", "link_id": "t3_nw4hb8", "parent_id": "t1_h17kgzg", "score": "15", "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn"}]