[{"author": "petrichorgasm", "body": "It's okay, it's just the grandparents having a laugh. Those are things they used to wear and slangs in the 1970s (my parents' generation. I grew up in the 90s)", "created_utc": "1665961726.0", "edited": "False", "id": "islu6x0", "is_submitter": "False", "link_id": "t3_y5ougl", "parent_id": "t1_islpffu", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I don't say anything unless they're saying to each other they're lost or confused because I know what that feels like and help is gold. If they're being really mean and judgey for any reason towards me or my party, then it's on. Some people from the city I was born in can be assholes and need to be shamed.", "created_utc": "1665961445.0", "edited": "False", "id": "isltku7", "is_submitter": "False", "link_id": "t3_y5hb14", "parent_id": "t3_y5hb14", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Southeast Asian checking in. I visit rural Niedersachsen and they've been so nice to me. Most likely because I'm with a native whenever I'm there. I'm so unusual that when we went to the *one* Chinese restaurant, the workers kept coming out to stare at me. One day, the owner asked what kind of Asian I am because I answered I'm from the US. \n\nI take things like that in stride. The US is far more racist and mean about it. My boyfriend said I was the first Asian in the village lol. I got invited to a BBQ next time I go. I read later that Germans and their BBQ game is legit, apparently! I'll find out next year when I visit again.\n\nSo yay! There are SEAs there! Hi!", "created_utc": "1665960908.0", "edited": "False", "id": "islse1k", "is_submitter": "False", "link_id": "t3_y5cbsn", "parent_id": "t1_isj06oc", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "True, rude drunk teenagers are rude no matter what country.", "created_utc": "1665960471.0", "edited": "False", "id": "islrf70", "is_submitter": "False", "link_id": "t3_y5cbsn", "parent_id": "t1_isj375p", "score": "6", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Can I ask you how you learned the language? I'm learning it right now but curious if you did formal classes or by immersion.\n\nUgh I *love* the Northern Germany countryside and look forward to going every year (I'm in the US). We go to where boyfriend grew up in Niedersachsen where his parents and extended family still live since before Germany was Germany lol.\n\nFirst time I felt safe as a woman of color (Southeast Asian). I noticed the stares, but the vibe was more of curiosity than malice. My boyfriend's blonde daughter and I laughing and playing got stared at, but like I said, it wasn't malice. My boyfriend said that I was the first Asian to come to the village, but I've never felt more welcomed. \n\nSame when we go to Berlin. The stares drop significantly, but that's because Berlin is huge and I'm not special. When there are tourists who speak English or my language looking all lost or trying to take an impossible selfie, I usually offer to help. \n\nThanks a lot, dude. Now I miss it lol. I can't wait until next year's trip.", "created_utc": "1665960289.0", "edited": "False", "id": "islr0rt", "is_submitter": "False", "link_id": "t3_y5cbsn", "parent_id": "t1_isiwl1k", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "41 and divorced at 38 here. I found the man who flipped my materal switch (mine, not saying everyone has it). My MD and my Obgyn says I'm good to try for a baby. I finally found the man I trust and want to have one with. It took me this long and I'm so so excited. He's the first man that I met who didn't care about my age and want to have children with me!\n\nThere are factors that prevented me from having one before. One of them being I didn't think I wanted any. Met this guy and it just felt so natural to want to have a family with him. Most importantly, with him, baby would be with parents who want them and have the resources to care for them. I've seen how much people struggle when the money just isn't there. My boyfriend isn't rich, he's just practical and has a good career that can withstand me staying at home longer than 6 weeks and more like the maternity leave where he's from. In Germany, the maternity leave is 1.5 years. The support given to new mothers there are more robust than in the US. Luckily, he can give me and future baby the same because that's financially viable for him to do.\n\nIt's different when one has found a partner who is enthusiastically on board and who enthusiastically wants to provide for said child and you. I've never had a partner who actually wanted children so when this one came into my life, it was a surprise that I too wanted one. It hits different.\n\nIdk I just wanted to assure women that it's not impossible to want children later in life or change one's mind then. It's hard swimming against the current, but it's not unusual to evolve to something entirely different.", "created_utc": "1665959091.0", "edited": "False", "id": "isloco0", "is_submitter": "False", "link_id": "t3_y5h91t", "parent_id": "t1_isjwua7", "score": "4", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "*haunts in 40s*", "created_utc": "1665956836.0", "edited": "False", "id": "islj41m", "is_submitter": "False", "link_id": "t3_y5h91t", "parent_id": "t1_isk459r", "score": "18", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Hey, thanks for this. I will do this with my boyfriend. Like you said lower in the comments, I do defend him because I love him. We take the good and the bad with each other because no one is perfect all the time.", "created_utc": "1665894234.0", "edited": "False", "id": "isi77aa", "is_submitter": "False", "link_id": "t3_y4ra9y", "parent_id": "t1_isfgcsp", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Someone said lard and I agree, but butter works too. I usually sub butter for Crisco if I don't have it. I don't keep lard around.", "created_utc": "1665833395.0", "edited": "False", "id": "isekzw7", "is_submitter": "False", "link_id": "t3_y42gi8", "parent_id": "t1_isdw2k8", "score": "8", "subreddit": "Old_Recipes", "subreddit_id": "t5_13kjsj"}, {"author": "petrichorgasm", "body": "Smiling.", "created_utc": "1665833235.0", "edited": "False", "id": "isekryd", "is_submitter": "False", "link_id": "t3_y4ioba", "parent_id": "t1_isecao0", "score": "3", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Yo, they don't have cilantro there! I had no idea! My boyfriend's sweet mum made tacos when we were there visiting because the kids love Mexican food. \n\n...she used parsley. I love her and damn right I said nothing about it!", "created_utc": "1665833130.0", "edited": "False", "id": "isekmop", "is_submitter": "False", "link_id": "t3_y4ioba", "parent_id": "t1_isecqiw", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "My German-born boyfriend is like this! \n\nWe were in San Francisco (city in California) once, walking back to our hotel from a concert late at night. We waited for the crosswalk to allow crossing. He's already pretty cautious but this confused me because there were no cars coming, no one was out, and in the years we've been together, we don't cross many streets together that late at night. I grabbed his hand and crossed the street with him.\n\nOther times, I've gotten very offended when I would buy stuff for him and he would give me the money back. Like, dude, I got it because I love you, not because I wanted to obligate. It frustrated me because I didn't grow up transactional like that.\n\nAw, I feel bad now because I probably short circuited his brain. He's actually very sweet and kind. Turns out the the things that annoy me about him are just how German culture is apparently? \n\n(For reference, I'm Southeast Asian and the culture I grew up in would never be mistaken for precision. Boyfriend and I met and live in the US)", "created_utc": "1665832778.0", "edited": "False", "id": "isek4oq", "is_submitter": "False", "link_id": "t3_y4ioba", "parent_id": "t1_iseaf0c", "score": "9", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "The Cuban Black Beans recipe in a comment back in 2013-14, I think. I don't have the link to the og post, but I still have the recipe:\n\n****\n\nBlack Beans \n\nOh my friend, it's called Cuban Black Beans. REAL Cuban black beans, not that shit they serve in restaurants.\n\nYou get a lot of diced sweet onions and peppers (red is best balance of sweetness to price) and you cook them over medium heat in a lot of olive oil. How much olive oil? Say you have one big onion and two decent sized peppers, then I say at least a half a cup. Once the onions are softening up, you add garlic. How much garlic? ALL THE FUCKING GARLIC.\n\nThen you cool it down with some white wine (not too sweet, something middling). Let it steam off for a minute. What you're doing is killing the rest of that raw garlic taste and letting the alcohol in the wine bring out the rest of the flavors.\n\nThen you add black beans. I use canned, un-drained straight beans (don't get the kind that's labeled \"black bean soup\"). Some will tell you canned isn't as good. I say bullshit. I use one and a half times as much by volume as I have of the onion/pepper/garlic mixture.\n\nSimmer the beans for a bit, low-medium. Then you will add an ounce of ground cumin, a shot glass' worth of oregano, and a packet or three of Goya Sazon (if you don't know what that is, look in the Mexican/Spanish/Ethnic section and look for little boxes that say Goya). If you want to be a boss, add three or four bay leaves, but don't forget to pull them out later -- no one wants to eat a bay leaf. Mix it in well.\n\nEither move it to a crock pot or put it in a 225* oven. Check it every once in a while -- you want the beans to be soft. You do not want this to burn, so scrape the bottom. I'd sooner eat your shit than burnt black beans, and so would you.\n\nNow after a few hours taste it. More flavor? Add more cumin and Goya. Needs a kick? Add some lime. You know what? FUCK YOU, ADD LIME ANYWAY.\n\nTraditionally, this is served over rice. FUCK THAT. I serve it in a bowl. Maybe throw some shredded pork on that bitch. FUCK ME.\n\nIf you use enough onions, peppers, and wine, these will be surprisingly sweet. (My Abuelita accused me of adding sugar, that bitch.) The beans, cumin, and oregano will give it a rich, earthy flavor. Goya is just magic. And the wine and lime will give just a hint of tartness. The beans, slow-cooked, are almost meaty (in a braised meat sort of way, not in a fuck-yeah-cow-meat kind of way). Once they cool down a bit, it will have a thicker texture, so let it sit for a little bit.\n\n\n---\n\nForever a favorite, vegetarian-friendly.", "created_utc": "1665697678.0", "edited": "False", "id": "is7lpu1", "is_submitter": "False", "link_id": "t3_y2d2nu", "parent_id": "t3_y2d2nu", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": ".....listen, I'm a CNA. I've cleaned psych patients who methed their way to old age and painted their side of the room, bed, curtains, pillow insterts, bathed themselves with fecal matter like it ain't no thang. I've cleaned up paraplegics with decent upper body strength who when they flipped over, created a rainbow arc of excrement that landed on the opposite wall. \n\nBut this...I had forgotten reading it when it was first introduced. I'm a little horrified that I couldn't get through reading that again without laughing-while-horrified, but, it says something that I'd rather go through that than suffer shitty administration, understaffing, and being bullied by manipulative mean-girl nurses who never grew up past high school, especially travel ones. \n\nIt's not the patients that are the problem.", "created_utc": "1665694524.0", "edited": "False", "id": "is7dqce", "is_submitter": "False", "link_id": "t3_y2d2nu", "parent_id": "t1_is295pr", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I scrolled through mindlessly and thought this said \"cannibalism\". Scrolled back because this isn't the usual concern that seems to be plaguing the world, that I know of.", "created_utc": "1665693085.0", "edited": "False", "id": "is79y7b", "is_submitter": "False", "link_id": "t3_y351hi", "parent_id": "t1_is6tf54", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "This question helped me realize that this country is pretty damn protected and it's just something I don't think about on a daily basis, if at all. \n\nSomeone mentioned the two oceans we're flanked by, the countries that we share borders with not having (afaik) designs on us, the ridonk military budget that for once would be applied directly for invasion here, the fact that we are a country with more guns than people.\n\nAll these are food for thought and a welcomed talking point for whatever discussion I have with people. Having experienced, oh, the past however many years, it's a good change to think about something that we're doing right. \n\nI suppose that would be USA's time to shine. I hesitate getting *too* comfortable to think we're invincible, but, my civilian ass don't know the nitty-gritty and can only see how well protected we are from physical invasion. I can't comment on technological invasion because idk what kind of \"global firewall\" we have. I just know I can access the internet at will.\n\nEta: what would I do if this happens? Shit, idk. I've spent my entire life as a nursing assistant and I have respiratory care background so most likely, I'd be part of the medical team. I learn quickly,  I can do basic assessments and triage, I have excellent people skills for all ages (working with human beings at their most vulnerable, that's something one really sharpens), I can perform any medical task that doesn't require advanced degrees. Not sure how I would handle mass casualty aftermath, but, knowing me, I'd be fine. I'm someone who can keep my wits about me in emergencies and handle death, so, I'd be one of the ones willing to step up.\n\nSo, yeah, this job I'm hella burned out on will definitely make me useful. I couldn't be a bystander during emergencies even if I tried.", "created_utc": "1665691456.0", "edited": "1665692038.0", "id": "is75qot", "is_submitter": "False", "link_id": "t3_y30j9z", "parent_id": "t3_y30j9z", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thank you for the cooking tip. On using them like bay leaves, do you have a favorite recipe or two that you're willing to share? That tea sounds comforting. I  will try that once I have the plant.\n\nHaha, true, it is rather random, isn't it. The village I stay in is even smaller. My boyfriend is German. He grew up in that village and that's where we go for the summer to visit his parents and various family members. The kids get taken there so they will use the language (their mother, boyfriend's ex-wife, is American). I tag along because I'm learning German too, but also because it's always a good time. His parents are very kind. The rest of his family are so sweet. I do come back from those trips refreshed and missing Brötchen.", "created_utc": "1665660542.0", "edited": "False", "id": "is5488p", "is_submitter": "False", "link_id": "t3_y1dtmt", "parent_id": "t1_is220mi", "score": "1", "subreddit": "IndoorGarden", "subreddit_id": "t5_2vyus"}, {"author": "petrichorgasm", "body": "That's what I read. When I'm planting from grocery store bought, I buy the organic ones.", "created_utc": "1665541057.0", "edited": "False", "id": "irz0k2d", "is_submitter": "False", "link_id": "t3_y1dtmt", "parent_id": "t1_irxygt7", "score": "2", "subreddit": "IndoorGarden", "subreddit_id": "t5_2vyus"}, {"author": "petrichorgasm", "body": "Thanks I was wondering about the leaves and stalks being edible.\n\nEta: you're in Hannover! That's where i land to visit Königslutter and I wish I could be there now cuz I miss it so much.", "created_utc": "1665540701.0", "edited": "1665540972.0", "id": "iryztqb", "is_submitter": "False", "link_id": "t3_y1dtmt", "parent_id": "t1_iryxxx9", "score": "3", "subreddit": "IndoorGarden", "subreddit_id": "t5_2vyus"}, {"author": "petrichorgasm", "body": "I subscribe to the rollerskating sub and I thought these were rollerskate wheels 😋\n\nDelicious rollerskate wheels!", "created_utc": "1665540565.0", "edited": "False", "id": "iryzjhn", "is_submitter": "False", "link_id": "t3_y1duiq", "parent_id": "t3_y1duiq", "score": "2", "subreddit": "Baking", "subreddit_id": "t5_2qx1h"}, {"author": "petrichorgasm", "body": "The whole authentic happy thought hits different now that I'm older and have had the chance to be \"Auntie\" to my cousins baby daughter and \"Papa's girlfriend\" to my boyfriend's kid. \n\nI don't have children nor do I want to adopt or be a single mother, but I understand it more than I would have if I didn't become either.", "created_utc": "1665540231.0", "edited": "False", "id": "iryyu9q", "is_submitter": "False", "link_id": "t3_y1cyrs", "parent_id": "t1_irymkcz", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Aww that's wonderful! One of my first cousins had her first baby last year. I was the cousin who lived the closest, practically a straight line of a drive for 10 minutes, so I would be over all the time, helping her with baby, playing with baby, give her some time to do new mom things like shower, decompress by baking (I got to take home so much of her amazing baked goods because it's just her, her husband, and baby in the evening).\n\nBaby and I are so very close and we adore each other. She's a little over 1 and is the sweetest, happiest girl. Whenever I came over, once she could make noises, she would squeal so loudly. Then when she started walking, whenever she sees me, she would squeal and run to me, man, being Auntie is the best feeling. Having those little arms hug my neck and having her trust me enough to fall asleep in my arms, it's so cute.\n\nI'm excited for you.", "created_utc": "1665359218.0", "edited": "False", "id": "irp70uw", "is_submitter": "False", "link_id": "t3_xzxslx", "parent_id": "t3_xzxslx", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "petrichorgasm", "body": "Yes, but this isn't Impala. There's a difference between Impala-quality high heeled skates worn by curious newcomers, and custom high-heeled skates worn by skaters who are in tune with their skills and limitations. \n\nIt's not that it can't be done, it's that Impala doing them with Impala's reputation of poorly-made rollerskates should be approached with caution, if not avoided entirely.\n\nThis skater appears to be one of the skilled skaters with custom set ups, so, less worry of her not knowing what she's doing and breaking her neck.", "created_utc": "1665262584.0", "edited": "False", "id": "irk09xi", "is_submitter": "False", "link_id": "t3_xz0mfd", "parent_id": "t3_xz0mfd", "score": "107", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Literacy? Sweaty, we were poured into, and in turn are filled with \n\n💶Ⓜ️🅾️🃏ℹ️💰\n\n\n\n🪄🔮🎲🐍🪔🥤🏖🌎🤡🛳🛫", "created_utc": "1665195438.0", "edited": "False", "id": "irh406o", "is_submitter": "False", "link_id": "t3_xx36h4", "parent_id": "t1_irdxkgk", "score": "2", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "Oh! I know this one. Back in the olden days, that's how doctor's wives are referred to (USA). I used to work in an establishment of rich old people and had an obnoxious lady who would be bitchy when the newbies would call her husband \"Mr.\", not knowing it's \"Dr.\"\nMy supervisor later told me about the whole Mrs. Dr. deal and rolled her eyed. Lady was apparently notorious for that.\n\n\nWhile I think the world of my partner's accomplishments and experience in his field, it would be weeeeird to call myself Mrs. Dr. Cool-name!! He's the one that did the work, not me. I mean, if it were reversed, it would sound just as strange: Mr. Dr. Petrichorgasm lol (that being said, it would have been cool had I continued my schooling and gotten an MD like I planned. Then if we were to follow the olden-day designation, both of us would be Dr. Dr.)", "created_utc": "1665142469.0", "edited": "False", "id": "ire61d0", "is_submitter": "False", "link_id": "t3_xxvlup", "parent_id": "t1_ire2z4k", "score": "3", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "petrichorgasm", "body": "I work in a hospital. No, that's something the Emergency Department is for. If somehow the one you go to doesn't, ask for their social worker, though I doubt you'll run into problems. ED professionals don't bat an eye on that. \n\nI take the same thing. The withdrawals are exactly like the flu. Go, fellow Zoloft redditor. Don't hesitate.", "created_utc": "1665141576.0", "edited": "False", "id": "ire4tfg", "is_submitter": "False", "link_id": "t3_xxrltf", "parent_id": "t3_xxrltf", "score": "4", "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844"}, {"author": "petrichorgasm", "body": "I used to be premed and agree with the whole money thing. One doesn't go into medicine for the money lmao. There are easier, less academic ways to be moneyed. \n\nI don't know if physicians would want to date a care assistant (UK, like you mentioned/nursing assistant (USA) anyway, but, I'd date them for the conversation because I've found that in our field, it's almost impossible to not talk about our work in the off hours.  \n\nIn fact, I went on a date with one once and the conversation was the best I've had on a date. There's so many things that we had in common. It didn't work out, but it was one of the most enjoyable dates I've been on just because the conversation was nonstop.\n\n(It's okay though, I'm with a doctor of sorts anyway now, not an MD but a PhD. We still have the best conversations, but that's because his overall knowledge is so vast, not just in what he studied [computer science]. I like to tell him that he may be the doctor, but I'm the one that can save his live. He doesn't think it's *that* funny, but my coworkers think I'm hilarious!)", "created_utc": "1665005289.0", "edited": "False", "id": "ir7cr2q", "is_submitter": "False", "link_id": "t3_xup91c", "parent_id": "t1_ir0lgbn", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Are we twins because that's how I feel too", "created_utc": "1664873162.0", "edited": "False", "id": "iqzs1v7", "is_submitter": "False", "link_id": "t3_xut03y", "parent_id": "t1_iqz9gp9", "score": "3", "subreddit": "zillowgonewild", "subreddit_id": "t5_3mvlju"}, {"author": "petrichorgasm", "body": "Lol I've been one of those. How many times did I entertain? Five in my adult life.", "created_utc": "1664873121.0", "edited": "False", "id": "iqzs09v", "is_submitter": "False", "link_id": "t3_xut03y", "parent_id": "t1_iqyxwq1", "score": "6", "subreddit": "zillowgonewild", "subreddit_id": "t5_3mvlju"}, {"author": "petrichorgasm", "body": "I don't *need* such a house, but as someone super into Victorian/Gilded Age shit, my god, yes, I do need...I mean, want it.\n\nAffording it is not what we're talking about though, right? Because I can't and that's why I don't have one. Lol", "created_utc": "1664873037.0", "edited": "False", "id": "iqzrwxc", "is_submitter": "False", "link_id": "t3_xut03y", "parent_id": "t1_iqxxoi3", "score": "3", "subreddit": "zillowgonewild", "subreddit_id": "t5_3mvlju"}, {"author": "petrichorgasm", "body": "ETA: your update is really cute. Congratulations \n\nI like what you said about keeping parenthood as an organic subject. I really wish I had been like that. I was so adamant to not have a baby at all in my previous marriage. We had that DINK life and were together for a decade, but it ended up in divorce. \n\n\nI met my current boyfriend and he was the first person to say that he's open to kids, even though he has two from his previous marriage. There was none of that militant refusal to even consider a possibility of having children. He was so chill about it, so quietly confident about it, like you said, he was organic about it. \n\n\nI was not looking to have children and he knew that. I wasn't militant, I just knew I didn't. I told him I'm not changing my mind, and he was fine with that. We fell in love. \n\n\nBut, here is someone who has a great career that can support a family, more kids, and me staying home longer than the 6 weeks here (USA), and closer to what they have where he's from (Germany), iirc, it's 1.5 yrs. As in, if I wanted to get whatever Germany gave pregnant women, the post partum support, well-baby care, anything baby and I need, he's willing to do that. In fact, we did have that talk.\n\n\nI never thought I could afford children nor have a partner who can give me *that* option. I remembered when I changed my mind, too. It was 1.5 years of us being together. I'm really really surprised that I changed my mind. But, hey, it happened. \n\nI'm aging out of the fertility window, but, oh well. Being with him has helped me to grow so much as a person. Got me out of my comfort zone, gave me a whole different understanding of myself, and what I'm capable of. Too bad I didn't meet him earlier. Raising a family with him would have been a blast.", "created_utc": "1664871482.0", "edited": "False", "id": "iqzq6yd", "is_submitter": "False", "link_id": "t3_xut9h2", "parent_id": "t1_iqzbxre", "score": "3", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "petrichorgasm", "body": "I'm a divorced, child-free woman who decided to give dating a parent a chance because he was (is) exceptional and he ticked a very specific box that I didn't even realize I had. Absolutely not what I thought was gonna happen. He seemed sweet and I liked his smile, during the meet-date. The second actual dinner-date was magical. Like out of a cheesy 90s romcom, we talked until the Italian restaurant cleared out and were were the only ones in there. \n\nIt's been 4 yrs, 1.5 years in, his nurturing ass changed my mind! Lol\n\nWe don't have kids together and I'm aging out, but I will continue being there for him and the kids. They haven't been easy children for him to raise, but, I'm there for anything, good and bad. I'm in it for the long run. \n\nI learned a lot and I'm sure I'll continue to learn.", "created_utc": "1664870472.0", "edited": "False", "id": "iqzp368", "is_submitter": "False", "link_id": "t3_xut9h2", "parent_id": "t1_iqz4rwg", "score": "5", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "petrichorgasm", "body": "Veteran CNA here. We don't want them. Putting that in their profile will also deter the RNs/ARNP/DNP.", "created_utc": "1664854314.0", "edited": "False", "id": "iqz2c2l", "is_submitter": "False", "link_id": "t3_xup91c", "parent_id": "t1_iqynroj", "score": "10", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Man....that sounds grate", "created_utc": "1664726987.0", "edited": "False", "id": "iqrjrg7", "is_submitter": "False", "link_id": "t3_xtalsy", "parent_id": "t1_iqr7hm0", "score": "18", "subreddit": "slowcooking", "subreddit_id": "t5_2s64w"}, {"author": "petrichorgasm", "body": "Yep, 41 undiagnosed years. Will be making an appointment to know for sure. \n\nI would've never suspected, but I read a book laying around. Someone I know received a formal diagnosis recently so I got curious. \n\n\nYour second sentence is spot on. So many things stood out to me that I feel the need to have a professional assessment.", "created_utc": "1664532859.0", "edited": "False", "id": "iqhcaua", "is_submitter": "False", "link_id": "t3_xr93zx", "parent_id": "t1_iqfwx03", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "Back in the early aughts, my friends and I got hold of the number for \"the loser line\". I only remember the beginning and it's \"You've reached the loser line. You got this number because the person you talked to thinks that you're a *loser*.\"", "created_utc": "1664527476.0", "edited": "False", "id": "iqh6321", "is_submitter": "False", "link_id": "t3_xr93zx", "parent_id": "t1_iqgnjji", "score": "8", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "I've read all three at different times in my life and your comment is gold", "created_utc": "1664526690.0", "edited": "False", "id": "iqh570l", "is_submitter": "False", "link_id": "t3_xrk638", "parent_id": "t1_iqg6nbh", "score": "5", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "This makes me sad because I've been through both the walking ahead and not checking on me and this.", "created_utc": "1664023275.0", "edited": "False", "id": "ipplo36", "is_submitter": "False", "link_id": "t3_xm81us", "parent_id": "t1_ipp0u9b", "score": "3", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I don't even know you and I don't like you lol", "created_utc": "1663043798.0", "edited": "False", "id": "io7vvtg", "is_submitter": "False", "link_id": "t3_xckq1s", "parent_id": "t1_io5vg4m", "score": "7", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Yay! Congratulations! I'm older and have been around the education block (who knew I had adhd!?). Being older is ok. It does feel weird to not be able to relate in age and experience, but, I liked being an older student because the profs are less like gatekeepers and more like gate openers. Being older also makes it easier to talk to the administration and speak up for yourself.", "created_utc": "1663040104.0", "edited": "False", "id": "io7p6ta", "is_submitter": "False", "link_id": "t3_xcqorz", "parent_id": "t3_xcqorz", "score": "1", "subreddit": "adhdwomen", "subreddit_id": "t5_31aao"}, {"author": "petrichorgasm", "body": "I see myself in that word lol", "created_utc": "1663015132.0", "edited": "False", "id": "io63ovf", "is_submitter": "False", "link_id": "t3_xbi6cm", "parent_id": "t1_io3x9yf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "\"Ouibo\".... whyyyyyyyyy", "created_utc": "1662967016.0", "edited": "False", "id": "io3guje", "is_submitter": "False", "link_id": "t3_xbi6cm", "parent_id": "t1_io0v211", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "I did this because we use 24hr at work (cna) when charting and it's easier to keep my phone on that setting for continuity. It really helps.", "created_utc": "1662965732.0", "edited": "False", "id": "io3fb2i", "is_submitter": "False", "link_id": "t3_xbnid1", "parent_id": "t3_xbnid1", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Um...", "created_utc": "1662965075.0", "edited": "False", "id": "io3ehg4", "is_submitter": "False", "link_id": "t3_xbxxsw", "parent_id": "t1_io3bpaz", "score": "19", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "My ex husband and I were raised in a Christian home and we left the church eventually. What I understand, what you're describing could also be under the \"agnostic\" umbrella.", "created_utc": "1662920998.0", "edited": "False", "id": "io0qw51", "is_submitter": "False", "link_id": "t3_xbd0r3", "parent_id": "t1_io0oiui", "score": "5", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "petrichorgasm", "body": "Telemetry tech here. No. No no no. That's artifact. Show the entire 6-sec strip or nothing.", "created_utc": "1662421722.0", "edited": "False", "id": "in8ym08", "is_submitter": "False", "link_id": "t3_x28twi", "parent_id": "t3_x28twi", "score": "13", "subreddit": "illnessfakers", "subreddit_id": "t5_g49g0"}, {"author": "petrichorgasm", "body": "That's how he made enough money to take a trip to Europe.\n\nPoor guy just wanted to be his authentic self: a European", "created_utc": "1661900691.0", "edited": "False", "id": "img9ecd", "is_submitter": "False", "link_id": "t3_x1snlm", "parent_id": "t1_imfldna", "score": "5", "subreddit": "LinkedInLunatics", "subreddit_id": "t5_25tcjz"}, {"author": "petrichorgasm", "body": "I would spend the money for good fitting high quality bras and I'm in the pnw. Thanks op", "created_utc": "1661627969.0", "edited": "False", "id": "im1e7bl", "is_submitter": "False", "link_id": "t3_wz9j3v", "parent_id": "t3_wz9j3v", "score": "68", "subreddit": "ABraThatFits", "subreddit_id": "t5_2s8kf"}, {"author": "petrichorgasm", "body": "Oof, so satisfying", "created_utc": "1661300717.0", "edited": "False", "id": "ilj3h0e", "is_submitter": "False", "link_id": "t3_ww1yha", "parent_id": "t3_ww1yha", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "They're not a US brand. They're known in Europe and are based in Hamburg, Germany. Afaik, in Europe, Wifas, Rios, Chayas, and Lunas are the bigger brands.", "created_utc": "1661285168.0", "edited": "False", "id": "ili1fbb", "is_submitter": "False", "link_id": "t3_wvmlk6", "parent_id": "t1_ilgpytf", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I used to perform on stage (also sober). I've always thought it was the lights and the awful ventilation of old buildings back then. Now it's probably better since the lights are cooler, but goddamn, those lights made it hell when one wears like 15lbs of costume (I was studying opera).\n\nI saw Nightwish in San Fransisco at the Warwick earlier this year and their singer, Floor Jansen, does something pretty damn clever to combat the stage sweaties. She sings with a fan on (not a person but a fan with the three blades lol). Strategically angled and downstage, it simultaneously kept her cool and gave her flowing model hair. Might have to cop that if I ever perform again. Just not in an opera.", "created_utc": "1660443779.0", "edited": "False", "id": "ik7ey1f", "is_submitter": "False", "link_id": "t3_wn8soz", "parent_id": "t1_ik5ybwp", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Yes, I will put up a link when I get back", "created_utc": "1660415663.0", "edited": "False", "id": "ik5q4hh", "is_submitter": "False", "link_id": "t3_wnf6wu", "parent_id": "t1_ik5inqe", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I saw Skate Land and I thought it was the one in Des Moines, IA. I've only been there for private parties, but nevertheless, I would hate it if my boyfriend's daughter had to deal with that.", "created_utc": "1660415620.0", "edited": "False", "id": "ik5q0vc", "is_submitter": "False", "link_id": "t3_wmv37g", "parent_id": "t1_ik3g4z8", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Those pulse lites are what I want too 😊", "created_utc": "1660376958.0", "edited": "False", "id": "ik3r5of", "is_submitter": "False", "link_id": "t3_wjc2k0", "parent_id": "t3_wjc2k0", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Omg! Really?? This gives me hope! I'm 9wks post-op, PT, still in post-op boot. Broke my ankle on Memorial Day and had to cancel my annual trip to Germany, missing sk8jam Berlin today 😭\n\nI'm so happy you posted! I've been doom scrolling, and if it wasn't for the skaters I interact with on IG, I would still be so sad and isolated.", "created_utc": "1660376853.0", "edited": "False", "id": "ik3r0v9", "is_submitter": "False", "link_id": "t3_wji0ss", "parent_id": "t3_wji0ss", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Haha you know it!", "created_utc": "1660375715.0", "edited": "False", "id": "ik3plad", "is_submitter": "False", "link_id": "t3_wlugeq", "parent_id": "t1_ijw38wt", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Chaya Melrose Premiums! Go to a skate shop and try them on. I love them so much I got both colors. Most padded, supportive skates I have. They're my park skates. Measure your feet. As far as sizing goes, I wear 7.5/8 US. EU38 is way small for me, but the 39s fit perfectly.\n\nFor indoor and rhythm, my go tos are my Luna skates that I got from a skate shop in Belgium (they ship to the US). I love those so much, I have them all except for the Shadow color. With those, the EU38 have the snug fit I like, though I also have them in 39s. \n\nBoth are much more supportive than my Lollies and I love them. I have wide feet and both are so very comfortable.\n\nHave you tried Sure-Grip or Riedell?", "created_utc": "1660375545.0", "edited": "False", "id": "ik3pdoz", "is_submitter": "False", "link_id": "t3_wn4g2n", "parent_id": "t3_wn4g2n", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Goals!", "created_utc": "1660372952.0", "edited": "False", "id": "ik3lzbt", "is_submitter": "False", "link_id": "t3_wm1bb6", "parent_id": "t3_wm1bb6", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I feel you, fellow skater. I broke two bones in my ankle on Memorial Day. I'm still in pain and progressing ever so slowly in physical therapy. The therapist I work with said she thinks I can get back to skating eventually, but not yet.\n\nI can't wait to get back out there. The rollerskaters I follow and interact with on ig have been so instrumental in keeping me from feeling isolated. I'm bummed that I'm missing sk8jam Berlin, which is tomorrow (or in a few hours since I'm in the US; it's already Saturday morning there), and also had to cancel my annual trip to Germany.\n\nHeal well! I'm rooting for you. ❤️🛼❤️", "created_utc": "1660372717.0", "edited": "False", "id": "ik3lnyh", "is_submitter": "False", "link_id": "t3_wn39fz", "parent_id": "t3_wn39fz", "score": "5", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Heyyy, great progress! Watching you even helped me with the footwork planning. Go you!", "created_utc": "1660372263.0", "edited": "False", "id": "ik3l1n7", "is_submitter": "False", "link_id": "t3_wn1mc0", "parent_id": "t3_wn1mc0", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Makes sense. I just read about the work that comes with hearth cooking and I can see why modern ovens are preferable!", "created_utc": "1660364190.0", "edited": "False", "id": "ik38nzp", "is_submitter": "False", "link_id": "t3_wmjo7p", "parent_id": "t1_ik1rhrq", "score": "1", "subreddit": "DIY", "subreddit_id": "t5_2qh7d"}, {"author": "petrichorgasm", "body": "Wow, I would have loved to have a house with a cooking fireplace! I love to cook and I dig old recipes, so, personally, I would have kept the fireplace cooking-functional. But I realize not everyone feels the same. A mud room is also functional.\n\nWould cooking fireplaces like this be only in farmhouses? Where else would they have been found? \n\nThanks for posting!", "created_utc": "1660332428.0", "edited": "False", "id": "ik19uoy", "is_submitter": "False", "link_id": "t3_wmjo7p", "parent_id": "t3_wmjo7p", "score": "3", "subreddit": "DIY", "subreddit_id": "t5_2qh7d"}, {"author": "petrichorgasm", "body": "I want to live in your neighborhood.", "created_utc": "1659903743.0", "edited": "False", "id": "ijcr2uo", "is_submitter": "False", "link_id": "t3_wiefxm", "parent_id": "t1_ijbgetm", "score": "1", "subreddit": "RedditForGrownups", "subreddit_id": "t5_2sh93"}, {"author": "petrichorgasm", "body": "Gardening such a wholesome activity!", "created_utc": "1659903514.0", "edited": "False", "id": "ijcqis3", "is_submitter": "False", "link_id": "t3_wiefxm", "parent_id": "t1_ijbc3m5", "score": "2", "subreddit": "RedditForGrownups", "subreddit_id": "t5_2sh93"}, {"author": "petrichorgasm", "body": "As someone who likes to talk to friendly strangers, I'd be into the idea of a talking section.", "created_utc": "1659903348.0", "edited": "False", "id": "ijcq4ko", "is_submitter": "False", "link_id": "t3_wiefxm", "parent_id": "t1_ijc9k6g", "score": "8", "subreddit": "RedditForGrownups", "subreddit_id": "t5_2sh93"}, {"author": "petrichorgasm", "body": "Learning how to meditate has been helpful to me. I also noticed that when I meditate, I'm much quieter. I get tangential when I talk a lot and even confuse myself sometimes.", "created_utc": "1659903292.0", "edited": "False", "id": "ijcpzsn", "is_submitter": "False", "link_id": "t3_wi0ohh", "parent_id": "t1_ijajftc", "score": "1", "subreddit": "RedditForGrownups", "subreddit_id": "t5_2sh93"}, {"author": "petrichorgasm", "body": "Whoa, nostalgia. I had this poster on my wall.", "created_utc": "1659873828.0", "edited": "False", "id": "ijav8by", "is_submitter": "False", "link_id": "t3_wi1v5l", "parent_id": "t3_wi1v5l", "score": "1", "subreddit": "OldSchoolCool", "subreddit_id": "t5_2tycb"}, {"author": "petrichorgasm", "body": "This brings back memories to when I used to work in a nursing home as an activities assistant. \n\nGoing home and making the recipes from the \"Cooking for two\" column in Reminisce magazine and recipes in Good Old Days was how 23 yo me progressed beyond packaged ramen and omelets. I owe a lot to those magazines. I wouldn't be the kitchen goddess that I am today without them. I want to try the slaw.", "created_utc": "1659752776.0", "edited": "False", "id": "ij4yujz", "is_submitter": "False", "link_id": "t3_w1o9hh", "parent_id": "t3_w1o9hh", "score": "3", "subreddit": "Old_Recipes", "subreddit_id": "t5_13kjsj"}, {"author": "petrichorgasm", "body": "Ooh! I'd be interested in a maultaschen recipe and Erdbeere Kuchen, bitte. I'm supposed to be in Germany right now, but I broke my ankle. I'm reeeeally missing the Erdbeere Kuchen made with strawberries from the next village. \n\nETA: oh wow, the print type is so cool! I have German cookbooks, but they're in English.", "created_utc": "1659749030.0", "edited": "1659749718.0", "id": "ij4r7uf", "is_submitter": "False", "link_id": "t3_wfe6qx", "parent_id": "t3_wfe6qx", "score": "3", "subreddit": "Old_Recipes", "subreddit_id": "t5_13kjsj"}, {"author": "petrichorgasm", "body": "I'm recovering from a broken ankle otherwise I'd love to go. Off the top of my head, there is a skate park in Northgate and one on 155th in Shoreline. Further up, a Lynnwood Bowl and Skate on 205th...just make sure you're in the Lynnwood part of 205th and not the Shoreline part. That was a lesson I learned.\n\nAlki is good for trail skating. I haven't been to Green Lake to skate, but I used to go all the time there. Check first on the Green Lake path though because a few months ago, I read that wheels were being banned from the inside path, but then didn't hear about it anymore. So, I hope it's still okay to skate there. That was one of my favorite spots.\n\n\nIn the meantime, here's this:\n\nhttps://www.wheretoskate.org/", "created_utc": "1659724633.0", "edited": "False", "id": "ij35v8s", "is_submitter": "False", "link_id": "t3_wdwy5b", "parent_id": "t3_wdwy5b", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "No contest, I'd head right to my boyfriend and go home. He's the one I love and the one I want. 4 years in and I haven't changed my mind.", "created_utc": "1659644896.0", "edited": "False", "id": "iiypctj", "is_submitter": "False", "link_id": "t3_wg700z", "parent_id": "t3_wg700z", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thanks for this. With qualified immunity making it difficult to say for sure what an officer should know, couldn't that be improved by making police training more akin to what police training entails in Norway, Finland, and the Netherlands? By that, I mean, change the length and intensity of training to longer than the current 21-weeks, plus create a standardized curriculum that will give the candidates bachelor's degrees? While there's no guarantee that a degree equates to a well-rounded intelligence, the longer and more intense training would create an even ground of basic knowledge that can create better-informed police officers.\n\nI'm just a layperson going by your post and what I know in passing about police training in other developed countries.", "created_utc": "1659643312.0", "edited": "False", "id": "iiylf8a", "is_submitter": "False", "link_id": "t3_wg40ev", "parent_id": "t1_iiy6fyb", "score": "1", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "petrichorgasm", "body": "Well put! My empathy recognizes your empathy. A little secret, we survivors of trauma and child abuse who have done the work to heal recognize each other. You're on a good path, my friend. Stay the course and take no shit. I'm happy to have brought you encouragement.", "created_utc": "1659406626.0", "edited": "False", "id": "iilba3k", "is_submitter": "False", "link_id": "t3_wdc5x2", "parent_id": "t1_iijtoz0", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Either overappeasing or so laid back that the partner doesn't know or can't glean what the other's preferences and priorities are.", "created_utc": "1659379563.0", "edited": "False", "id": "iiji4xx", "is_submitter": "False", "link_id": "t3_wdc5x2", "parent_id": "t1_iiht8hz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I'm really proud of you for doing the work. I know what that's like. We both are fortunate to be self-aware enough to know that what we experienced were not normal and that we need to take steps to address our traumas with the help of a professional. Keep it up.\n\nAs for your question, healthy, self-aware individuals know \"born perfect\" is not a possibility. When someone seems like they were \"born perfect\", it's most likely they have really good discipline, healthy guidance, or are untested in adversity. I used to put people on a pedestal when I was younger due to self-esteem issues and undiagnosed neurodivergence. I know better now. \n\nMost healthy people who are looking for partners know that no one is perfect. \"Red flags\" is where our boundaries step in to protect us. While there are universal red flags, people will have different tolerance levels, and that doesn't necessarily mean it's unhealthy. \n\nKeep being self aware and doing that work.", "created_utc": "1659379073.0", "edited": "False", "id": "iijgv8a", "is_submitter": "False", "link_id": "t3_wdc5x2", "parent_id": "t1_iij650o", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "An American (US) mix of Southern California and the Seattle part of Washington State (West Coast of the USA) \n\nI'm Indonesian and grew up in Southern California, but have lived in Seattle longer.", "created_utc": "1659326971.0", "edited": "False", "id": "iigvjip", "is_submitter": "False", "link_id": "t3_wcvdk9", "parent_id": "t3_wcvdk9", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Inert feline chemistry", "created_utc": "1659288368.0", "edited": "False", "id": "iiekqc4", "is_submitter": "False", "link_id": "t3_wcff5j", "parent_id": "t1_iiegdtw", "score": "6", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "Agreed. I happen to know that everyone who has ever come in contact with dihydrogen monoxide dies. So sad.", "created_utc": "1659288254.0", "edited": "False", "id": "iiekgoi", "is_submitter": "False", "link_id": "t3_wcff5j", "parent_id": "t1_iiehcdt", "score": "24", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "If you're still looking for a ds mascara reco, Maybelline Volum' Express Colossal Curl brought me back to using mascara after they discontinued sky high curves back in 2005. \n\nMy straight Asian lashes LOVED the sky high curves. When it was discontinued, I just stopped using any. I tried everything, even dropped the cash for Diorshow twice. After using great lash, CG, clinique, I gave up. I didn't trust anything, not even the one Meghan Markle made famous. But when I saw the volum' express colossal curl (white and yellow tube) reviewed somewhere, I gave it a try. It had been 16 years and I found sky high curves replacement. \n\nSo...yeah. That. \n\n....I don't think it has roadkill piss, unfortunately.", "created_utc": "1659271547.0", "edited": "False", "id": "iidjiaz", "is_submitter": "False", "link_id": "t3_wcff5j", "parent_id": "t3_wcff5j", "score": "9", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "So glad to know this! She's so inspiring. Thanks for sharing!", "created_utc": "1659124383.0", "edited": "False", "id": "ii64kl7", "is_submitter": "False", "link_id": "t3_wb4xr2", "parent_id": "t1_ii5jec0", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I had that same reaction 🛼💖", "created_utc": "1659124306.0", "edited": "False", "id": "ii64dq5", "is_submitter": "False", "link_id": "t3_wb4xr2", "parent_id": "t1_ii4munb", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Yay! Wanna see more of this, it's so fun to watch.", "created_utc": "1659124259.0", "edited": "False", "id": "ii649gz", "is_submitter": "False", "link_id": "t3_wb4xr2", "parent_id": "t3_wb4xr2", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "With this optimism, you will get there, fellow skater!", "created_utc": "1658959777.0", "edited": "False", "id": "ihwuih7", "is_submitter": "False", "link_id": "t3_w9jpzt", "parent_id": "t1_ihwsvkx", "score": "3", "subreddit": "rollerskatingplus", "subreddit_id": "t5_43uh09"}, {"author": "petrichorgasm", "body": "Hi there! There's no worry necessary. When I got back to rollerskating, I was shaky and embarrassed too. But I kept at it knowing that my legs will get stronger and I will learn to hold my core. \n\nThere's nothing wrong with you. This is usual. You just need to get your body used to skating again and that will take persistence and time. You can do this!", "created_utc": "1658959726.0", "edited": "False", "id": "ihwue1b", "is_submitter": "False", "link_id": "t3_w9jpzt", "parent_id": "t3_w9jpzt", "score": "10", "subreddit": "rollerskatingplus", "subreddit_id": "t5_43uh09"}, {"author": "petrichorgasm", "body": "Fritzy's was wonderful. I made the drive from Seattle proper to Tacoma and the person helping me was so welcoming. I have thought about driving there again because it was such a positive experience. She was familiar with both rinks I skated at, offered her experiences at both places, and was just a pleasant person in general. *That's* how to win a loyal customer. She definitely went above and beyond.", "created_utc": "1658604686.0", "edited": "False", "id": "ihcwrp5", "is_submitter": "False", "link_id": "t3_w5ptn3", "parent_id": "t1_ihasqn6", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Please do. I like having a skate shop not only nearby, but with the wonderful addition of prices that are not gouging. I felt a little off being in there as a skater coming back to the sport after skating as a kid, but I thought it was because I was shy. I haven't been back in a while, and I used to drop serious money there. But with OOP's post, I feel validated with my \"off\" feeling. It would be such an amazing shop if only the employees are friendlier.", "created_utc": "1658604395.0", "edited": "False", "id": "ihcw3wk", "is_submitter": "False", "link_id": "t3_w5ptn3", "parent_id": "t1_ihcmh1u", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I know which one this is too! Should we name and shame?? It's really too bad because their prices are on point. But as a consumer, I would like to not be belittled when I'm going to spend my money and contribute to their profits so they can stay afloat.", "created_utc": "1658604027.0", "edited": "False", "id": "ihcv9z8", "is_submitter": "False", "link_id": "t3_w5ptn3", "parent_id": "t1_iha8eec", "score": "4", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Oh my God, are we thinking about the same shop?!?! Whoa, that's bad for them. I buy from them to support small business and because I'm not patient sometimes, but it's a relief to know my gut was right. I thought it was just me.", "created_utc": "1658603905.0", "edited": "False", "id": "ihcuzv0", "is_submitter": "False", "link_id": "t3_w5ptn3", "parent_id": "t1_iha3ssj", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I've skated in both Lollies and Lunas. I have the Lunas in all colors but the Shadow because they are a really good fit for me. I'm one of the ones that like the way the Luna boots feel and performs. I got the Lollies because they were pretty and I got them before I got the Lunas. So, AFAIK, they both have their advantages and I didn't mind dropping the money for them. I got the impala as a first time skate I didn't like the fit even just from trying them on. So now I have a skate that I'm not using. Had I just bought the Lollies or Lunas right away, I wouldn't have wasted the money on ill-fitting skates. I didn't know to buy them from a skate shop. I got them online.", "created_utc": "1658567042.0", "edited": "False", "id": "ihaw7de", "is_submitter": "False", "link_id": "t3_w57onp", "parent_id": "t1_ih6avft", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I too am a fan of Lunas and Chayas! As for the kingpin angle, I like it much better. But that's just me though. I don't mind skating on either angles. I do notice that my Lunas are very responsive for dancing.", "created_utc": "1658547735.0", "edited": "False", "id": "iha41ql", "is_submitter": "False", "link_id": "t3_w5d1zv", "parent_id": "t3_w5d1zv", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Is this something one can do through apprenticeship? More education? How does someone get into this?", "created_utc": "1658468206.0", "edited": "False", "id": "ih5jqx1", "is_submitter": "False", "link_id": "t3_w4qu85", "parent_id": "t1_ih48epm", "score": "6", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Ew. No. There's 500+ women on IG and only one you. You're a bird in the hand while he's all about the 500+ in the bush. Let him live in his fantasy. There are 500+ men irl who are waiting to meet you and treat you better. Let this dud go and go find one out of the 500+ men.", "created_utc": "1658364049.0", "edited": "False", "id": "igzlege", "is_submitter": "False", "link_id": "t3_w3db3l", "parent_id": "t3_w3db3l", "score": "3", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Subbed! I've been into saving scraps to feed my garden, but this is leveling up! Thanks", "created_utc": "1658363191.0", "edited": "False", "id": "igzjkex", "is_submitter": "False", "link_id": "t3_w3stjw", "parent_id": "t1_igyvr4z", "score": "3", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I understand this reference", "created_utc": "1658179862.0", "edited": "False", "id": "igp1m5z", "is_submitter": "False", "link_id": "t3_w1y2ev", "parent_id": "t1_ignwf0q", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "That's a great build! Looking at it makes me happy. Good job on the color scheme.", "created_utc": "1658179833.0", "edited": "False", "id": "igp1jhq", "is_submitter": "False", "link_id": "t3_w1y2ev", "parent_id": "t3_w1y2ev", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Holy shit that website *is* wonderfully dangerous. Thank you!", "created_utc": "1658091524.0", "edited": "False", "id": "igk97gu", "is_submitter": "False", "link_id": "t3_w18qht", "parent_id": "t1_igjy6qw", "score": "3", "subreddit": "BuyItForLife", "subreddit_id": "t5_2ss1q"}, {"author": "petrichorgasm", "body": "I've lost 40 lbs. It's very noticeable. But because weight is a volatile subject, no one but people who hadn't seen me in a while commented on it. I was pretty big before and I'm still not at my goal, but I have heard, \"Whoa! You're skinny now!\" \n\nI just smile and say thank you. Don't worry, OP, they are noticing.", "created_utc": "1658091245.0", "edited": "False", "id": "igk8k6t", "is_submitter": "False", "link_id": "t3_w172o6", "parent_id": "t3_w172o6", "score": "1", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "petrichorgasm", "body": "Haha good bot.\n\nBut it's not really a haiku without a mention of season. Good effort bot.", "created_utc": "1658090783.0", "edited": "False", "id": "igk7hih", "is_submitter": "False", "link_id": "t3_w16s6x", "parent_id": "t1_igk67k9", "score": "-1", "subreddit": "freebies", "subreddit_id": "t5_2qi1v"}, {"author": "petrichorgasm", "body": "Mine too! I know that feel. \n\nMy name is pronounced the same way in my boyfriend's language (German) and my language (Indonesian in Manadonese dialect) but differently in American English. My boyfriend doesn't speak my language yet, but the few times he's pronounced my name in \"our\" language made me melt. I wish he'd do it more often, tbh, for the same reason you mentioned.", "created_utc": "1658090673.0", "edited": "False", "id": "igk789u", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igk4flo", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Just ordered mine, ready in a few minutes to pick up in store. Thank you!", "created_utc": "1658090229.0", "edited": "False", "id": "igk66i3", "is_submitter": "False", "link_id": "t3_w16s6x", "parent_id": "t3_w16s6x", "score": "3", "subreddit": "freebies", "subreddit_id": "t5_2qi1v"}, {"author": "petrichorgasm", "body": "I do. I very much like my name, as unusual as it is. It fits me and my free spiritedness. \n\nAs a bonus, there are two different pronunciations of it depending on whether I'm speaking English or German/Indonesian. It's neat.", "created_utc": "1658088695.0", "edited": "False", "id": "igk2kwo", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igk045b", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Preach!", "created_utc": "1658086932.0", "edited": "False", "id": "igjyi6h", "is_submitter": "False", "link_id": "t3_w1a6j2", "parent_id": "t1_igjrmxk", "score": "7", "subreddit": "RomanceBooks", "subreddit_id": "t5_2sxjx"}, {"author": "petrichorgasm", "body": "Lmao! I still like it though! I wish she was still in my life so I can text it to her. She did eventually marry a guy in the US military, iirc he may have been stationed in Southern Germany in the mid 2000s. Four years ago, I met my boyfriend who is a German from Northern Germany, so we both got our German fetish on 😆. Keep the dream alive, u/jumpingsquirrels\n\nWe stopped being friends for the stupidest reason, but my recollection of her is of fondness.", "created_utc": "1658085133.0", "edited": "False", "id": "igjuabl", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igjqd86", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Isn't it? I learned French before I learned German. It took a few tries for me to call her the German way. But gosh, she was gracious and never took offense.", "created_utc": "1658084745.0", "edited": "False", "id": "igjteg3", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igjrm1l", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "My name won't be anywhere here. My ex husband gave me a keychain he got while on a trip and on the keychain was, \"they didn't have your name\".\n\nWe're still good friends now, so I still have the keychain. (And no, no chance in here or hereafter of us getting back together. We know we suck together and better as friends)", "created_utc": "1658084589.0", "edited": "False", "id": "igjt1fy", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t3_w16p22", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I first heard this name in Under the Tuscan Sun and liked it ever since.", "created_utc": "1658083946.0", "edited": "False", "id": "igjrjvv", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igizk52", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Idk man, Dorothy Dandridge was pretty foxy.", "created_utc": "1658083566.0", "edited": "False", "id": "igjqnsn", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igiylv0", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Za-BEE-nuh. I do prefer the German pronunciation. \n\n(I know a German Sabine. She's sweet and she's the reason I know that they say \"ciao\" in Germany as a goodbye and alternative to auf wiedersehen. Although now I know enough German to know there's other phrases for leave-taking.)", "created_utc": "1658083140.0", "edited": "False", "id": "igjpody", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igjoiwf", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Well, you're one Nicole who is self aware and self aware people are rarely crazy.", "created_utc": "1658082929.0", "edited": "False", "id": "igjp6rm", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igjnjke", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Dixie Normous", "created_utc": "1658082859.0", "edited": "False", "id": "igjp0rk", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igj3nfa", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Gotta say, this sounds like a conversation my high school best friend and I would have had as we drove around the neighborhood where our exchange student crushes lived. Yes, we were dorks and were sheltered and should have known what stalking is. \n\n(But you don't understand, they were *German* and as you know, German is the sexiest of all the languages\n\n...and that makes stalking 👍🏼   /s)\n\nLate 90s were a special time.", "created_utc": "1658082271.0", "edited": "False", "id": "igjnnjh", "is_submitter": "False", "link_id": "t3_w16p22", "parent_id": "t1_igisxpp", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "41 here and nope! \n\nGo out there and balance! You can do this. You will fall and that's okay. Make sure you're wearing protective gear.", "created_utc": "1657995403.0", "edited": "False", "id": "igf8dbs", "is_submitter": "False", "link_id": "t3_vzoa60", "parent_id": "t3_vzoa60", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I played this a lot one summer when I babysat my boyfriend's kid. We had fun talking about Area 51.", "created_utc": "1657982344.0", "edited": "False", "id": "igedvpg", "is_submitter": "False", "link_id": "t3_w0btwg", "parent_id": "t1_ige35g6", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Klassik", "created_utc": "1657982266.0", "edited": "False", "id": "igedplo", "is_submitter": "False", "link_id": "t3_w0btwg", "parent_id": "t1_ige14wv", "score": "2", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Zu Schnell Vorbei, aber Floor Jansen version von Sing Meinen Song.", "created_utc": "1657982223.0", "edited": "False", "id": "igedm6q", "is_submitter": "False", "link_id": "t3_w0btwg", "parent_id": "t3_w0btwg", "score": "1", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Agree with you about how it feels different to speak German and English. I had a hard time getting the \"L\" sound until I read a random reddit reply that said speaking German is unlike speaking English in that with German, one speaks with the whole mouth and all of your tongue. I know it sounds weird, but that made sense to me and ever since then, my pronunciations are better, but only if I remember to think to \"switch\".\n\nSame thing happens when I speak my native language, Indonesian. If I speak it with an American placement, I speak it with an American accent. I have to remember to \"switch\" for Indonesian too.\n\nThanks for sharing your insight! Learning this language is such a pleasure and visiting the country is always a great experience. Visiting the country with a native is a treat as well. I felt so welcomed.", "created_utc": "1657981088.0", "edited": "False", "id": "igeb5qi", "is_submitter": "False", "link_id": "t3_w0bajf", "parent_id": "t1_ige8oyv", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "Sandra Bullock is one of my favorites! She grew up there and moved back to the US as a teenager. Her mother was German and an opera singer, her father is American of German descent and a voice teacher. I studied voice when I was younger and learned some German pieces (before meeting my boyfriend years later and actually learning it instead of just making the sounds make sense). My teachers really drilled us students how to sing and form the words in the language we are singing. Singing is very different than speaking, but singing in German helped me learn it years later. The drilling was...incessant, but we students did it faithfully.\n\nSo, she's very talented and lucky in that her parents most likely made sure her pronunciations are spot on.", "created_utc": "1657980210.0", "edited": "False", "id": "ige9ay8", "is_submitter": "False", "link_id": "t3_w0bajf", "parent_id": "t1_ige47cu", "score": "7", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "I'm not German but my boyfriend is and he has two children who were born in the US. His ex-wife/the children's mother is American. He speaks German to them all the time. He speaks English to them too, but roughly 90% German. When they were little, they went to German school once a week. Since the older one was a few months old, they go to Germany every Summer to visit Oma+Opa+family, as well as to learn it further.\n\nI'm used to hearing my boyfriend, so I can tell that the older kid does speak German with an American accent. The younger kid does not. I asked boyfriend why that is since both kids learned from him since before they started talking. He said it's just that the older one doesn't practice. I think comprehension is about the same for the kiddos.\n\n(I can hear older kid's accent because I'm good with accents. English is my second language and I'm learning German. I try to copy the pronunciation, but I still sound \"French\". Younger kid said I will never sound like a native. She wasn't being mean, just matter-of-fact)", "created_utc": "1657979655.0", "edited": "False", "id": "ige85s9", "is_submitter": "False", "link_id": "t3_w0bajf", "parent_id": "t3_w0bajf", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "Aww you've made her happy 😊", "created_utc": "1657977382.0", "edited": "False", "id": "ige3ofv", "is_submitter": "False", "link_id": "t3_w01ps9", "parent_id": "t3_w01ps9", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I haven't thought about it like that. My dearest is also 7 years older. I adore him so much and I'd be devastated. We're both staying healthy right now, so, I hope we live long happy lives without very much health problems, and that we can be physically strong enough go to the bathroom without falling and dying. \n\nAnything else we can handle together.", "created_utc": "1657963914.0", "edited": "False", "id": "igdjgjj", "is_submitter": "False", "link_id": "t3_vybl8r", "parent_id": "t1_ig3280y", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Yeah, bummer about the Wifas.\n\nNever thought of it that way! I've heard great things about Bont, but I prefer high cut boots. I do have their red bearing press along with their electronic bearing cleaner and those I can also vouch for 🙂", "created_utc": "1657681277.0", "edited": "False", "id": "ify0o3f", "is_submitter": "False", "link_id": "t3_vxlks3", "parent_id": "t1_ifxyila", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I have Luna skates (one of them is the Moon Rose on the picture) and I definitely recommend them over Lollies. If you look through my posts, I talk about them extensively. I'm in the US and this brand is not known here yet, but it's available in 4 shops. I got my first pair from rollatl, and the rest I ordered from Belgium. I have 4 pairs that I interchange because they are *so* affordable, cute, supportive, and *responsive as heck!* They're designed in Hamburg, Germany and made in China, but it's well-made and worth the price. If you're looking for something suede not made in China, I haven't tried Wifas, but they are suede and made in Vienna, iirc.\n\nHappy to answer any questions. I may make a detailed post about my Lunas in the future because I feel so lucky to have found this brand and how good it is to skate on them. Lollies are perfectly fine to skate on and they're made in California, but I thought I'd chime in with my experience with my skates.", "created_utc": "1657680706.0", "edited": "False", "id": "ifxzi6t", "is_submitter": "False", "link_id": "t3_tuwulr", "parent_id": "t3_tuwulr", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "You're lucky! I love ordering from them. Even with the international shipping, it's cheaper and they arrive within 3 days to me. I've never been to the shop in person, but I've gotten 3 of my Lunas from there and I feel as if I know \"Maarten\" personally 😆. \n\nAs for the specs, the suede on the Lunas is stiffer and *way* more supportive than Lollies. Lollies are *very* soft. Someone compared them to socks and after skating in them, in Lunas, and in Chaya premium, I concur. Pricewise, yes, Lunas are better for your money. Lollies are pretty and have more colors, but you mentioned Wifas and they have many colors too. I'm looking to try Wifas just out of curiosity, but I wanted to try them on in person. I was to go to Germany next month for my annual trip, but with this injury, the 12 hour flight was out of the question. I suppose I can try them on here too, but, I figured I'd buy them in Germany since the prices are comparable to here and if I'm there anyway, it would be 10% cheaper in €.\n\nI'd be interested to know how you find the Wifas and Lunas. I've seen that Oumi Janta uses wifas on her insta and she skates hard, so it must be a good recommendation on that alone. I also know that Wifas started out as an ice skate company, so they're at least knowledgeable about boots.", "created_utc": "1657679606.0", "edited": "False", "id": "ifxx6wx", "is_submitter": "False", "link_id": "t3_vxlks3", "parent_id": "t1_ifxulgk", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "It's okay if you don't like the plates, everyone's feet are different and will have preferences. Someone on another post said the boots pinch them on parts of their foot, but it got better as the boots molded to their feet. \n\nYou can replace the plates and sell the ones that came with them if you'd like. (Not to me, just in general)", "created_utc": "1657678531.0", "edited": "False", "id": "ifxuwdo", "is_submitter": "False", "link_id": "t3_iczwwi", "parent_id": "t1_hv70sx0", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Seconding Lunas. I got my Savannahs from RollATL! The rest I ordered from Belgium. Love these skates so much. Bummer that I'm recovering from ankle surgery. I miss skating so much.", "created_utc": "1657678273.0", "edited": "False", "id": "ifxucw3", "is_submitter": "False", "link_id": "t3_iczwwi", "parent_id": "t1_hqvbvsw", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "If you're still looking for park skates, I skate on chaya melrose Premiums and save my Lunas for dance.", "created_utc": "1657678078.0", "edited": "False", "id": "ifxty01", "is_submitter": "False", "link_id": "t3_iczwwi", "parent_id": "t1_hnd7q98", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Eta: I just saw on the rules that I'm not allowed to link to products, so I removed the link to the insoles and just named them.\n\nI have almost all the Luna skates, except for the black ones (Shadow) and I love and recommend them. They have aluminum trucks and plates painted black so they're durable. If you search my profile, I talk about them a lot and got almost all of them from Sucker Punch Skateshop in Belgium, even though I'm in the US. \n\nAs for the sizing, I wear US 7.5-8, but I like my skates snug, so the EU38 fits me best. I switched out the insoles to the Pedag Pure Cotton Terry Barefoot insole.\n\nHappy to answer any questions. I ended up selling my Moxi Lollies because I love these more. They're not as soft as Lollies. But if you're looking for cushion and even more ankle support, I also skate on Chaya Premiums at the park (Lunas for trails, rink, and dance). The sizing on those are more true to size. I tried on EU 38, 39, and 40, and the 39 fits best.", "created_utc": "1657677471.0", "edited": "1657677772.0", "id": "ifxsmiw", "is_submitter": "False", "link_id": "t3_pms30q", "parent_id": "t3_pms30q", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I have them and the red ones skate smoother out of the box, with trucks and wheels loosened to my taste. The green ones weren't as smooth straight out of the box, but I replaced the bearings with the green yellow jacket premium (because matching) and they skated great! As for sizing, I'm wear 7.5-8 and the EU39 is perfectly molded to me. They're really solid skates. The boot is so very comfortable.", "created_utc": "1657675724.0", "edited": "False", "id": "ifxoqlw", "is_submitter": "False", "link_id": "t3_oz9az0", "parent_id": "t1_h8192qq", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I have medium wide feet and wear a US 7.5. Lunas in 38 fits perfectly. The 39s were a little loose, so I had to put insoles in. \n\nThese are the insoles I put in: Pedag Summer Pure Cotton Terry Barefoot Insole\n\nEta: I just saw on the rules that I'm not allowed to link to products, so I removed the link to the insoles and just named them.", "created_utc": "1657675404.0", "edited": "1657677913.0", "id": "ifxo0yf", "is_submitter": "False", "link_id": "t3_u4b8a1", "parent_id": "t3_u4b8a1", "score": "1", "subreddit": "rollerUK", "subreddit_id": "t5_2mknnq"}, {"author": "petrichorgasm", "body": "Huge Luna Skates fan from the US checking in (they're very popular in Germany. I got them from Belgium's Sucker Punch Skateshop all but one time. At the time, the € and $ were very close, today it's one for one). \n\nI have them in all the colors but Shadow. I'm recovering from a skate injury, so right now they're just waiting for me on my shelf. However, when I did skate on them, I never wanted to stop. I sold almost all my Lollies and only kept the black one, although I may sell those too and buy the Luna Shadows and complete the collection. Yes, I'm one of those people who gets things in different colors when they really really perform well for me.\n\nCaveat though, it's personal preference, but Lunas have a kingpin angle of 45° (Or 33, according to a UK skate site) instead of 10-15 on other popular skates. It's meant to be more responsive and have more maneuverability and I've found that to be true. It's not mentioned anywhere except on reddit. When I tried it without knowing, I was so shocked at how much better it felt for me to skate on it. Without knowing the kingpin angle difference, my first thought was how *responsive* it was when I skated on my Savannahs for the first time (the dark beige ones). At that angle though, it is said to be less stable, so a beginning skater may wobble and fall more unless they have really good balance. \n\nLike I said, it's personal preference. It also comes on aluminum plates and trucks painted black. I'm a rhythm/jam skater myself so Idk how they perform at the park. I skate on chaya melrose Premiums (*for park skating), but skating at the park injured me, requiring surgery. That's due to my own inexperience, though. The skates are great.", "created_utc": "1657674702.0", "edited": "1657679780.0", "id": "ifxmgru", "is_submitter": "False", "link_id": "t3_vxlks3", "parent_id": "t1_ifx9mdx", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "My ex husband's maternal side is from Galway and Isle of Man. We had always wanted to visit. We still might because we're still good friends. Also, your reply sounds exactly what Grandma would say ❤", "created_utc": "1657416773.0", "edited": "False", "id": "ifjlyt0", "is_submitter": "False", "link_id": "t3_vv4gdc", "parent_id": "t1_ifjeua6", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Oh wow. This thrifter thanks you", "created_utc": "1657400035.0", "edited": "False", "id": "ifin2v6", "is_submitter": "False", "link_id": "t3_vuxyv0", "parent_id": "t1_ifhriq4", "score": "1", "subreddit": "Frugal", "subreddit_id": "t5_2qhbe"}, {"author": "petrichorgasm", "body": "My resourceful and creative friends melts them down and makes jewelry out of them. But they have a workshop their retired machinist grandfather built back in the 60s. Now that he doesn't use them as often, they get to. I'm envious. They get to be as creative as they want because it's encouraged. I love their grandpa. He's such a good man.", "created_utc": "1657397538.0", "edited": "False", "id": "ifihijp", "is_submitter": "False", "link_id": "t3_vqygme", "parent_id": "t1_iezk5pm", "score": "2", "subreddit": "ThriftGrift", "subreddit_id": "t5_572rcs"}, {"author": "petrichorgasm", "body": "What?? You mean you don't get dressed up in your fineries and accept an invitation to the ball given by the Duchess anymore? Smh...culture is dead.\n\n/s", "created_utc": "1657397310.0", "edited": "False", "id": "ifih0m3", "is_submitter": "False", "link_id": "t3_vqygme", "parent_id": "t1_ieuauul", "score": "1", "subreddit": "ThriftGrift", "subreddit_id": "t5_572rcs"}, {"author": "petrichorgasm", "body": "Look, the tape I'd buy and idc who gives me the side eye.", "created_utc": "1657397161.0", "edited": "False", "id": "ifigow2", "is_submitter": "False", "link_id": "t3_vp6rxk", "parent_id": "t3_vp6rxk", "score": "2", "subreddit": "ThriftGrift", "subreddit_id": "t5_572rcs"}, {"author": "petrichorgasm", "body": "Excuse me, it's ViCtOriAn aNtiQue mmkayyy", "created_utc": "1657397078.0", "edited": "False", "id": "ifigif6", "is_submitter": "False", "link_id": "t3_vp7uu9", "parent_id": "t1_iew7ttm", "score": "1", "subreddit": "ThriftGrift", "subreddit_id": "t5_572rcs"}, {"author": "petrichorgasm", "body": "There was an amaaaazing Savers in the city I used to live in. Hunting there always gave me good stuff and the prices were right on. When they closed, I was so sad that I went on a thrift strike for a while.", "created_utc": "1657396677.0", "edited": "False", "id": "ififmpb", "is_submitter": "False", "link_id": "t3_te7ucj", "parent_id": "t1_i7t3siv", "score": "1", "subreddit": "ThriftGrift", "subreddit_id": "t5_572rcs"}, {"author": "petrichorgasm", "body": "I saw an Oxfam store when I was in Braunchweig, Germany! I didn't give it much thought because it was my first time visiting the city, not to mention, the country, but if it's still there whenever it is that I return, I'll give it a look. I just knew that it's a charity. I thought it was an office for them or something", "created_utc": "1657396434.0", "edited": "False", "id": "ifif3un", "is_submitter": "False", "link_id": "t3_te7ucj", "parent_id": "t1_i0pvro6", "score": "1", "subreddit": "ThriftGrift", "subreddit_id": "t5_572rcs"}, {"author": "petrichorgasm", "body": "Seconding Deseret Industries. Last time I went, the prices look more like a thrift store. They have me hope for thrifting.", "created_utc": "1657396143.0", "edited": "False", "id": "ifieh2y", "is_submitter": "False", "link_id": "t3_te7ucj", "parent_id": "t1_i96fb5g", "score": "2", "subreddit": "ThriftGrift", "subreddit_id": "t5_572rcs"}, {"author": "petrichorgasm", "body": "Oh. \n\nWell I'm already there. Whats another chunk of my life", "created_utc": "1657337199.0", "edited": "False", "id": "iffjz59", "is_submitter": "False", "link_id": "t3_vubkth", "parent_id": "t1_ifcgjzg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Ooh! Great find.", "created_utc": "1657251740.0", "edited": "False", "id": "ifat2x6", "is_submitter": "False", "link_id": "t3_vtmdym", "parent_id": "t3_vtmdym", "score": "1", "subreddit": "sewhelp", "subreddit_id": "t5_2srbo"}, {"author": "petrichorgasm", "body": "I'm almost 42 and I would love a gummy bear ultrasound 🙁", "created_utc": "1657230387.0", "edited": "False", "id": "if9h6dk", "is_submitter": "False", "link_id": "t3_vtl8y3", "parent_id": "t1_if86rbh", "score": "3", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "Can confirm, I was the gel on the wand", "created_utc": "1657230278.0", "edited": "False", "id": "if9gxe4", "is_submitter": "False", "link_id": "t3_vtl8y3", "parent_id": "t1_if9675k", "score": "29", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "While I'm into pre-code silent movies, it may be too long for someone who isn't into that genre or into film to watch for the German in it. \n\nI did watch it and enjoyed it immensely for the sets, the history, the storyline, but it was a heavy movie for me because when I watched it years ago, I was really really burned out on work. I can't watch it again anytime soon.", "created_utc": "1657173900.0", "edited": "False", "id": "if6b3lf", "is_submitter": "False", "link_id": "t3_vsrryf", "parent_id": "t1_if5mxad", "score": "1", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "Stromberg", "created_utc": "1657173561.0", "edited": "False", "id": "if6alt5", "is_submitter": "False", "link_id": "t3_vsrryf", "parent_id": "t1_if4mbgl", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "I'm watching Altes Geld right now and the jokes catch me off guard in the best way.", "created_utc": "1657173423.0", "edited": "False", "id": "if6af1q", "is_submitter": "False", "link_id": "t3_vsrryf", "parent_id": "t1_if3v976", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "Oh my gosh, yes for Queer Eye Germany! I cried at almost all of the episodes. I want to hang out with them all. So, so, positive ❤️", "created_utc": "1657173357.0", "edited": "False", "id": "if6abna", "is_submitter": "False", "link_id": "t3_vsrryf", "parent_id": "t1_if4a82h", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "Loooove Barbarians. The Classical Latin is right up my alley too because my Latin teacher way back when is German, so Latin has a German accent in my head, along with the unrolled letter \"r\".", "created_utc": "1657173291.0", "edited": "False", "id": "if6a850", "is_submitter": "False", "link_id": "t3_vsrryf", "parent_id": "t1_if44a71", "score": "3", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "Seconding Fack ju Göethe. I liked it, but I watched it because my boyfriend has it on DVD.\n\nWhat else I've watched (with and without my boyfriend who is a native speaker that I can have a discussion with afterwards)\n\nCharitè (fictional drama set in 1888, the year of three eights, three Kaisers, about the early days of medicine in the Berlin hospital that's still running today. Soapy, period piece. CW: huge age gap romance storyline between a couple of characters who aren't the main characters)\n\nSchubert in Love (Vater werden ist nicht schwer; adult comedy)\n\nHow to be really really bad (Meine teuflisch Gute Freundin; adorable, teen comedy)\n\nOver Christmas (Über Weihnachten; romantic comedy, I've watched it every Christmas season, and whenever I miss Germany)\n\nWe are the Wave (Wir sind die Welle; drama about older teens wanting to topple capitalism, racism, greed, etc.)\n\nThe Last Word (Das Letzte Wort; adult dramedy about the funeral business, the actress is a well known comedian in Germany)\n\n\nall of them in German, filmed in Germany, on US Netflix. \n\nI have a soft spot for Schubert in Love also because there's a scene there that I experienced irl when I met my boyfriend's father for the first time in Germany, except instead of oncology research, it was with history. Something else my boyfriend noticed is that there are puns and inside jokes all around the movie that a non-native speaker/someone not fluent wouldn't get. It didn't hinder my enjoyment though. It's a funny silly very German movie imo. By very German, I mean, there are things in it that would only happen in Germany.\n\nFor music, I listen to German pop because the words repeat. Vanessa Mai, Wincent Weiss, Madeline Juno, are the ones in my Spotify, though they've been in there for a few years. Right now I'm really loving Floor Jansen's cover of \"Zu Schnell Vorbei\" by Clueso from Sing Meinen Song, a German TV show that my boyfriend and I watch together. All the covers are on Spotify, mostly in German, some songs are in English.\n\nHope that helps!", "created_utc": "1657172904.0", "edited": "False", "id": "if69nvy", "is_submitter": "False", "link_id": "t3_vsrryf", "parent_id": "t1_if2xt4h", "score": "4", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "I caved and got the Bont electric bearing cleaner because I'm impatient. I was *dreaming* of cleaning bearings after using them. It only cleans one bearing at a time, but with that and the bearing press, I look forward to cleaning them and lubing them. The skates are smooooth", "created_utc": "1656991903.0", "edited": "False", "id": "iewfi0g", "is_submitter": "False", "link_id": "t3_viqenf", "parent_id": "t3_viqenf", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Wow. Send them this way.", "created_utc": "1656991708.0", "edited": "False", "id": "iewf5ve", "is_submitter": "False", "link_id": "t3_viqenf", "parent_id": "t1_idgjhem", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I broke my ankle skating and had to have surgery. It hurts like a mofo and I'm so over laying in bed with my ankle above my heart. It's boring af and I'm missing Sk8jam Berlin. I was supposed to go to Germany next month with my boyfriend, but I can't bear weight until September. \n\nTomorrow is my PT assessment and according to my post-op discharge paperwork, I won't be fully healed until Valentine's Day. I can't wait for PT. They're one of the most knowledgeable people about human mechanics. \n\nSo for now, OP, stay off your ankle and let time do its thing, but like someone else said, get physical therapy.", "created_utc": "1656990149.0", "edited": "False", "id": "iewcdax", "is_submitter": "False", "link_id": "t3_vqw436", "parent_id": "t3_vqw436", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I have the red Bont press and I love it. Spacers are no problem. Definitely worth the money. \n\nThe red ones will fit 65s and are meant for rollerskates. But if you're doing inlines, the yellow one is bigger. Both are the same price.", "created_utc": "1656989617.0", "edited": "False", "id": "iewbe1k", "is_submitter": "False", "link_id": "t3_vrihy3", "parent_id": "t3_vrihy3", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Sure! It doesn't have to be rare. Learning for the sake of learning is more fun anyway because you chose to learn.\n\nI don't have to learn Polish, but it sounds cool and the country is next to Germany, so there could be a time I'll use it. I did get to hear Polish in the wild while in Germany and even though at the time I only knew a few words and phrases, I recognized it enough to know. I also saw semis and delivery trucks in Polish and knew what they were delivering so that was cool. Had I not learned it, that would have been one less experience.", "created_utc": "1656954287.0", "edited": "False", "id": "ieu7ag4", "is_submitter": "False", "link_id": "t3_vqgct8", "parent_id": "t3_vqgct8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Dziękuję!", "created_utc": "1656953331.0", "edited": "False", "id": "ieu4zag", "is_submitter": "False", "link_id": "t3_vq2odu", "parent_id": "t1_ieomvsp", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Fashion fades, style is eternal. Do you. The kids will always push the envelope of propriety. We did the same thing, like you said. I mean, is this the hill anyone wants to die on? Not me. I'll wear it if it looks good on me. That's the only thing I go by.", "created_utc": "1656944386.0", "edited": "False", "id": "ietk0kj", "is_submitter": "False", "link_id": "t3_vqvn9g", "parent_id": "t3_vqvn9g", "score": "5", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I'm dying of laughter\n\nOr\n\n\"Dead\"\n\nHence, the skull.\n\nNow that we know that, it's no longer cool and is now a part of every day vernacular.", "created_utc": "1656944204.0", "edited": "False", "id": "ietjmap", "is_submitter": "False", "link_id": "t3_vqvn9g", "parent_id": "t1_ieti74b", "score": "39", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Same. I'm with a German now who is, like, only a tiny bit impressed by the fact that I'm learning German\n\nso...a tiny bit of a change in encouragement?", "created_utc": "1656834506.0", "edited": "False", "id": "ieo9udl", "is_submitter": "False", "link_id": "t3_vq2odu", "parent_id": "t1_iemzlm2", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "What will show if someone speaks  Indonesian and learned French, but in Monaco? Genuinely asking because I'm Indonesian and know some French, I just didn't learn it in Monaco so this would be hypothetical, I'm just curious.", "created_utc": "1656834253.0", "edited": "False", "id": "ieo9jum", "is_submitter": "False", "link_id": "t3_vphl9z", "parent_id": "t3_vphl9z", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Jein! 🤯", "created_utc": "1656828134.0", "edited": "False", "id": "ieo1yy2", "is_submitter": "False", "link_id": "t3_vphl9z", "parent_id": "t1_ien4a7o", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Wanted to tell you your user name made me smile. My boyfriend's German and your u/ made me think of when he and I met.", "created_utc": "1656791296.0", "edited": "False", "id": "iem3uyl", "is_submitter": "False", "link_id": "t3_vphl9z", "parent_id": "t1_iejjykr", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Thank you for this. I wanted to bring my knitting on my flights to Germany, but my *boyfriend is hyper-cautious. But good to know for next time! Maybe I'll even bring my German knitting needles (the Addis which, I'm sorry, aren't as precise as my favorites 😅)", "created_utc": "1656710867.0", "edited": "1656796632.0", "id": "iei44yf", "is_submitter": "False", "link_id": "t3_vp3aqy", "parent_id": "t1_iehxmgn", "score": "2", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "petrichorgasm", "body": "I wanted to brighten someone's day and you want to shit on it, that's on you. That elderly couple was adorable and the interactions and life stories I get is a perk of my work. As a nursing assistant, I've seen and experienced a lot of negativity and sadness in this world already, in and out of work. I won't apologize for having learned compassion nor be brought down by people who want to dim my light. I'm too seasoned for that. \n\nI hope that when you are in a hospital, you get someone who is kind and experienced. Yes, just like me.", "created_utc": "1656710396.0", "edited": "False", "id": "iei32ex", "is_submitter": "False", "link_id": "t3_voxacm", "parent_id": "t1_iehqd2u", "score": "3", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "petrichorgasm", "body": "Haha oops! I don't always need to swipe to the Deutsch keyboard so some German words have been learned by the \"English (US)\" keyboard and here we are.", "created_utc": "1656699119.0", "edited": "False", "id": "iehc53z", "is_submitter": "False", "link_id": "t3_voxacm", "parent_id": "t1_iehaqky", "score": "7", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "petrichorgasm", "body": "Thanks! My job is physically demanding, but the moments of human connection like that I don't get anywhere else and I appreciate the stories I'm trusted with.\n\nAlso du brauchst nicht zu weinen 🤗", "created_utc": "1656698884.0", "edited": "False", "id": "iehbkj4", "is_submitter": "False", "link_id": "t3_voxacm", "parent_id": "t1_ieh81mh", "score": "9", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "petrichorgasm", "body": "\"Eat healthier and work out really hard\" needs that mental determination and that's what sets you apart in your success. There's no magical plan or portion to lose weight, it's the following through on a deceptively simple \"plan\". You've worked hard and conquered a lot. It shows. Now, enjoy all the attention because, damn you look good. Idk how your personality is, but, if you're kind, caring, and single, you won't be single for long, if you choose. If you're partnered, hey, I know what weight loss does to a couple's love life. \n\nYou did well. Now the next 40 years will be much more enjoyable. (source: I'm a nursing assistant and have seen a lot of obesity-related issues in the elderly compared to the elderly who kept healthy. You want to be the latter)", "created_utc": "1656698068.0", "edited": "False", "id": "ieh9jsl", "is_submitter": "False", "link_id": "t3_vp23rx", "parent_id": "t1_iegzf9p", "score": "22", "subreddit": "progresspics", "subreddit_id": "t5_2sl0y"}, {"author": "petrichorgasm", "body": "Maybe they went to Brazil.", "created_utc": "1656697120.0", "edited": "False", "id": "ieh76jg", "is_submitter": "False", "link_id": "t3_voxacm", "parent_id": "t1_ieh0zxt", "score": "1", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "petrichorgasm", "body": "Aww, I got to use my limited German on someone elderly who called the hospital I worked at who was looking for their family. I never thought I'd have to use it because all the patients I had whose first language is German usually also spoke English plus another language. If you are my patient, I would speak as mich German as I can with you just so you'd feel comfortable. Hospitals can be an intimidating place so as a nursing assistant, because I spend more time with a patient, I try to relieve some of that fear and uncertainty. \n\nI sometimes speak German to the older patients who learned German from their parents or grandparents. It was mostly for nostalgia for them. Their smiles when they hear me speak, I can't explain how cute it is. I'm Southeast Asian so I'm probably the last person they'd expect to know how to speak it. \n\nRandom story: There was a really sweet old couple once and the woman was my patient. I recognized their accents as German and asked them. She was so adorable when she proudly said that she was from East Germany and he was from West Germany and I get the sense that they went through some shit to stay together.", "created_utc": "1656697069.0", "edited": "False", "id": "ieh721l", "is_submitter": "False", "link_id": "t3_voxacm", "parent_id": "t1_iegxep6", "score": "70", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "petrichorgasm", "body": "Not just when jogging", "created_utc": "1656655690.0", "edited": "False", "id": "ief4wcg", "is_submitter": "False", "link_id": "t3_vog5jt", "parent_id": "t1_iee0g8n", "score": "8", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Happy Anniversary. I hope to be someone's wife bestie. Haven't found anyone, but, I know this is what I would be good at and someone will appreciate me the way I them.", "created_utc": "1656631822.0", "edited": "False", "id": "iedvdd9", "is_submitter": "False", "link_id": "t3_vog5jt", "parent_id": "t1_iedsse8", "score": "134", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thanks for saying this. I do the same and one of my exes thought I was weird for thanking people who do their jobs. I tried to explain, but, it didn't get through. I'm going through a rough break up with another guy and my self worth is in the toilet. It's good to see something that I do be recognized as a good thing.", "created_utc": "1656631658.0", "edited": "False", "id": "iedv056", "is_submitter": "False", "link_id": "t3_vog5jt", "parent_id": "t1_ieddmfc", "score": "13", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Oh, yes, I'm aware. It's that OP is the first progress pic that I saw as my goal who has a thigh gap. It's not something I'm vehemently after as it's all about body composition that I have no control over.", "created_utc": "1656550929.0", "edited": "False", "id": "ie9ehjs", "is_submitter": "False", "link_id": "t3_vnhxlh", "parent_id": "t1_ie8k956", "score": "1", "subreddit": "progresspics", "subreddit_id": "t5_2sl0y"}, {"author": "petrichorgasm", "body": "Thank you for asking this! I like those shorts too.", "created_utc": "1656536799.0", "edited": "False", "id": "ie8i7on", "is_submitter": "False", "link_id": "t3_vnhxlh", "parent_id": "t1_ie7zv4q", "score": "3", "subreddit": "progresspics", "subreddit_id": "t5_2sl0y"}, {"author": "petrichorgasm", "body": "Hi! Lady here. We have similar body types and your progress pic is how I want my goals to be. Can I ask you for tips? \n\nI didn't think a thigh gap could be possible! Only time will tell whether or not I end up achieving it, but it's still impressive to me. You're doing marvelous, sis! TIA", "created_utc": "1656536708.0", "edited": "False", "id": "ie8hzl7", "is_submitter": "False", "link_id": "t3_vnhxlh", "parent_id": "t3_vnhxlh", "score": "6", "subreddit": "progresspics", "subreddit_id": "t5_2sl0y"}, {"author": "petrichorgasm", "body": "Ah, yes, I meant when I didn't have it installed on my laptop for hausaufgaben 😄\n\nIt was quickly resolved by my German boyfriend.", "created_utc": "1656536371.0", "edited": "1656796668.0", "id": "ie8h5dk", "is_submitter": "False", "link_id": "t3_vl4f4p", "parent_id": "t1_iduy44n", "score": "1", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "Could be that you just have a preference that makes you happy, sis. Nurture aside, you're still your own person with your own preferences. \n\nHa, I married my ex husband because I told him at least then it means my kids will have a chance at being average height. Ya, I said *my* kids because he's the one with the height gene. We didn't have kids though. We ended up being DISCOs (Double Income, Small Cat Owners; a riff on DINK, double income, no kids).", "created_utc": "1656536177.0", "edited": "False", "id": "ie8gnv7", "is_submitter": "False", "link_id": "t3_vnfbcg", "parent_id": "t1_ie8b7nw", "score": "8", "subreddit": "RomanceBooks", "subreddit_id": "t5_2sxjx"}, {"author": "petrichorgasm", "body": "Haha I never thought of it like this. This type of height difference is like me and my ex-husband, but I don't hate him. We're still friends so I don't imagine him and me, I just have a type.", "created_utc": "1656533134.0", "edited": "False", "id": "ie88ysj", "is_submitter": "False", "link_id": "t3_vnfbcg", "parent_id": "t1_ie6qa0t", "score": "3", "subreddit": "RomanceBooks", "subreddit_id": "t5_2sxjx"}, {"author": "petrichorgasm", "body": "Lol I'm 5'2\". My ex-husband is 6'5\" and looks every inch the Norwegian Viking descendant that he is (grandma has the papers from when her family came to America). This is accurate and hilarious af. We're not this fit though. Both working on it separately and encourage each other.", "created_utc": "1656532978.0", "edited": "False", "id": "ie88jhz", "is_submitter": "False", "link_id": "t3_vnfbcg", "parent_id": "t3_vnfbcg", "score": "3", "subreddit": "RomanceBooks", "subreddit_id": "t5_2sxjx"}, {"author": "petrichorgasm", "body": "I'm learning German and AFAIK, in German, the 'ä\" is pronounced like the \"a\" in \"later\". Without the umlaut, it would be spelled \"ae\". I do it when I don't have the German keyboard installed. I have to because there are words in German that's spelled the same and with the addition of the umlaut, it changes meaning or makes it plural.\n\nDating a German guy whose name had a letter with an umlaut and when I saw it spelled without one the first time, I was confused.\n\nStill though, I had to read that product twice and was amused that the ä was placed correctly.\n\nAlso, probably microdose of acid.", "created_utc": "1656278334.0", "edited": "1656796687.0", "id": "idup4xk", "is_submitter": "False", "link_id": "t3_vl4f4p", "parent_id": "t1_idu7y4d", "score": "24", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "Oh my goodness, you are so wholesome. Here I am feeling so, so badly and I have no reason to be because I'm alive. My ankle is broken, but I had surgery and now I'm healing. Thanks for this positivity. May your business continues to thrive.\n\nCan we redditors set up something for this guy to grow his business? If he wants to. I'm not savvy with that kind of thing at all.", "created_utc": "1655873116.0", "edited": "False", "id": "id9ov8s", "is_submitter": "False", "link_id": "t3_vhczkl", "parent_id": "t1_id7ilby", "score": "4", "subreddit": "Baking", "subreddit_id": "t5_2qx1h"}, {"author": "petrichorgasm", "body": "I don't have the 250k to split with you either. Thinking of that rink and the acreage conjures up so much! Well, I'll keep watching and see what happens. I mean, I'm not set to get a windfall, I'm just so interested. I hope the rink doesn't get taken down. I hope someone moves the rink elsewhere if the place is bought and not turned into a skating heaven. Great find and thanks for sharing. This could be someone's \"Under the Tuscan Sun\" but in the US.", "created_utc": "1655784514.0", "edited": "False", "id": "id57dj9", "is_submitter": "False", "link_id": "t3_vfb2ar", "parent_id": "t1_icw1wl7", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Eta: sorry I didn't read your title thoroughly. These aren't for toe stops. They're washers for wheels. The thickness of 1.6mm is probably more like what you need though. \n\n---\n\nThese are the kind I got. They're not as thick and are identical to the ones that came on my chaya Premiums. I put them on all my skates.\n\nFavordrory M8 Flat Washer, 304 Stainless Steel, 100 PCS (M8 x 16 x 1.6mm 100PCS) https://a.co/d/5xjWRkY", "created_utc": "1655577047.0", "edited": "1655578802.0", "id": "icuxaid", "is_submitter": "False", "link_id": "t3_velzc2", "parent_id": "t3_velzc2", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "If I did, my goodness, I'd make that into a sort of rollerskating camp/vacation place. Everything is already there.\n\nHell, compared to where I am, 500k is cheap for all that acreage...just not cheap for me lol\n\nOh what a dream! So many business opportunities centering around rollerskating.", "created_utc": "1655576734.0", "edited": "False", "id": "icuwnbk", "is_submitter": "False", "link_id": "t3_vfb2ar", "parent_id": "t3_vfb2ar", "score": "6", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "If you're size 8 in women's, I'll give you mine for free. I already have a lot of skates and just want to give it since I won't be using it. All I did was try them on. They're the pastel rainbow ones.", "created_utc": "1654682493.0", "edited": "False", "id": "iblatju", "is_submitter": "False", "link_id": "t3_v7hjci", "parent_id": "t3_v7hjci", "score": "5", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "He was on board before I was. I was childfree but the longer I was with him and seeing how caring of a father he is with his children (from previous marriage), I realize that he's the first man I've been with that actually wants children with *me*. That was a wonderful realization. We're trying and not opposed to ivf. I'm not that old and I have wonderful advanced maternal age physicians on my team who are so, so, great.", "created_utc": "1654659483.0", "edited": "False", "id": "ibkhh6s", "is_submitter": "False", "link_id": "t3_v70eof", "parent_id": "t3_v70eof", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Small space dweller here. Do share your treasure.", "created_utc": "1654657515.0", "edited": "False", "id": "ibke2jd", "is_submitter": "False", "link_id": "t3_v6t8ka", "parent_id": "t1_ibhg1b7", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I'm with you on this one. The bands/artists I like are not mainstream here in the US so I try to get good seats when they come. Now I have a boyfriend and it's not just me, so, it took some convincing to my boyfriend to get the good seats for a band we both looooove. Man, I'm still buzzing over how great that show was. \n\nWhen I was in college and the subsequent cheap years, I'd get what I can or volunteer so I can see free shows. I don't have time like that anymore.", "created_utc": "1654657433.0", "edited": "False", "id": "ibkdx2k", "is_submitter": "False", "link_id": "t3_v6t8ka", "parent_id": "t1_ibhuwpk", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Same!", "created_utc": "1654296693.0", "edited": "False", "id": "ib39fb8", "is_submitter": "False", "link_id": "t3_v437ib", "parent_id": "t1_ib2b2ml", "score": "5", "subreddit": "ABraThatFits", "subreddit_id": "t5_2s8kf"}, {"author": "petrichorgasm", "body": "Every year I fly from US to Germany and, god, the layover. Next time I will bring my skates. Thanks for sharing!", "created_utc": "1654295058.0", "edited": "False", "id": "ib36f7y", "is_submitter": "False", "link_id": "t3_v3lhvy", "parent_id": "t3_v3lhvy", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Sigh...dude is so smart. He's got a PhD in CompSci, works for a hug tech company that takes care of him very well, and he's so humble about it all. Meanwhile, I'm here...still dreaming about my AA. \n\nBut we're good together and love each other and like the song says, I could not ask for more.", "created_utc": "1653443341.0", "edited": "False", "id": "i9vsu0y", "is_submitter": "False", "link_id": "t3_uwmpm5", "parent_id": "t3_uwmpm5", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I dig your username, btw", "created_utc": "1652919811.0", "edited": "False", "id": "i955615", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i9152kn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Haha, yes, I'm not young, but I don't have children nor am I married so I'm still pretty free to pursue that since I made mistakes in the past. I'm dating someone though and it's going well.", "created_utc": "1652919786.0", "edited": "False", "id": "i95545u", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i91dphq", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I'd like to know too. <2h!", "created_utc": "1652918880.0", "edited": "False", "id": "i9537a9", "is_submitter": "False", "link_id": "t3_usobfl", "parent_id": "t3_usobfl", "score": "1", "subreddit": "nightwish", "subreddit_id": "t5_2sfhd"}, {"author": "petrichorgasm", "body": "Wellll....my theory is that they are the California drivers, seeing by how they drive, because I used to drive the same way. But back then, the police would ticket for speeding. Not so much now. A bunch of my Californian friends and family also learned their lesson.", "created_utc": "1652905091.0", "edited": "False", "id": "i947wrw", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i92y4v3", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "The Starbucks is open, Pike Place is still there, the Aquarium is open, etc. Though I'm still salty that they moved Ye Olde Curiosity shop away and place it in the back, even though it's the same building. That weirdo, strange collector vibe (in a good way) is gone. The storefront is also not as cool.\n\nThe homeless people everywhere part is true, at least where I live, and along that main street near the railroad tracks. But as far as protests and Seattle being a post-apocalyptic place from that one Star Trek episode, no. I'm glad that you're asking, though, and I'm happy to dispel rumors. As much as we aren't fans of tourists, it wouldn't be nice for me to discourage. I do love this city, it's that the changes are so stark. Maybe it's like that in all Metropolitan cities, but I only know this one.", "created_utc": "1652889775.0", "edited": "False", "id": "i9363gi", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i929sqi", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Whether you like it or not, a majority of Reddit thinks of and wants to move to Seattle Metropolitan area. Very few, if any, are thinking about Yakima, Spokane, or what's in between. As for me, I work and live in Seattle proper and would still need affordable housing here and I'm not willing to uproot just because some rando who doesn't want to wipe ass for a job says so.", "created_utc": "1652850649.0", "edited": "False", "id": "i91g7yv", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i91byxq", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I grew up in Redlands. I wish I can still handle California. I adore Corona Del Mar. Everyone was sooooo nice. But I can't afford to live there.", "created_utc": "1652847696.0", "edited": "False", "id": "i91bq23", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i90yz9i", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I adore Bellingham! I used to go there a lot when I had friends who went to Western, and now go there when I need to get away. I'm definitely looking at other hospitals. I'm not happy being a nursing assistant, but as long as I'm near a place where I can go back to school, I'm good.\n\nThe thing is, the hospital I work in is really generous with their tuition help. I know I have to make a decision before I have to get out of my apt.", "created_utc": "1652847544.0", "edited": "False", "id": "i91bgr0", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i90owdn", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Idk about not being able to visit. On the weekends it's back to being touristy again. I live about a 5min drive from Pike Place and other than all the construction replacing the viaduct, it's still going. Not as big a crowd as it used to be and the shops aren't as good, but what's there is good enough. A lot of the quirky things that made the market good has almost all but disappeared or hiked up in price, though. Idk, once the news stand disappeared, it lost a part of its personality. Gum wall is still there and you can still catch an improv show, but, to me, it doesn't feel like home. Crazy that I live so close but feel like an outsider.", "created_utc": "1652847269.0", "edited": "False", "id": "i91b0b5", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i912yx1", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "My bestie is looking for houses and all the northern counties have homes for 450k+\n\nMy boyfriend is looking for a house and where he is, a suburb of Seattle, the homes are rarely under 700k. He wants to stay in that neighborhood because the schools are good for the kids. He's also stubborn, so....I guess that's on him.", "created_utc": "1652846973.0", "edited": "False", "id": "i91aijx", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i90vefg", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "\nI think that you missed a perfectly good moment to say, \"Llama know what you think!\"\n\nBestie and I also do Llama-themed things! Upvoted", "created_utc": "1652829404.0", "edited": "False", "id": "i90auw0", "is_submitter": "False", "link_id": "t3_urlntc", "parent_id": "t3_urlntc", "score": "2", "subreddit": "muglife", "subreddit_id": "t5_2w4zr"}, {"author": "petrichorgasm", "body": "Clam-damned.", "created_utc": "1652826869.0", "edited": "False", "id": "i905gue", "is_submitter": "False", "link_id": "t3_urx7e9", "parent_id": "t3_urx7e9", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Ohhh, I see. I'm American too. I tag along with my boyfriend every Summer when he takes his kids to see Oma und Opa and to improve their German. I've learned some German too so I can get around by myself; which proved useful last time I was there....long story. We live in the Pacific Northwest so we have the entire US and the Atlantic to go through 😆\n\nBut, off season, the plane tickets are affordable! Most places in Berlin speaks English (along with any other popular language because they start learning a foreign language in our equivalent of 5th grade) and the train minimize the need for a separate car, plus, it's a very walkable city. Berlin is huge. To get from Brandenburg Tor to the Wall, we needed to take the train. People were friendly and helpful. If you ask \"Sprechen sie Englisch?\" (Do you speak English?) Either they do or they'll get someone who does.\n\nI consider Northern Germany like my second home. My boyfriend's parents are so nice and so are the rest of his extended family. I miss them.\n\nIf you have any questions now or in the future about anywhere between Berlin to Hamburg, shoot me a DM and I'll try to find the answer. I hope you get to go over the Atlantic soon.", "created_utc": "1652826337.0", "edited": "False", "id": "i904att", "is_submitter": "False", "link_id": "t3_ursg7n", "parent_id": "t1_i901x4v", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Me too. I want to go to North Sulawesi, where my family is from. I've never been there.", "created_utc": "1652825330.0", "edited": "False", "id": "i9023bi", "is_submitter": "False", "link_id": "t3_ursg7n", "parent_id": "t1_i8zctsm", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Yes! I miss Germany and can't wait to return this summer! I drove through Hamburg on the way to Denmark, so I'd love to actually visit. I mostly spend my time in Niedersachsen (people I know live there), and even there, there's a lot to explore, so, more of that state would be great. \n\nHaven't been to Bavaria and the South, even though my boyfriend was born there, but, I'm sure it's just a matter of time. \n\nHope you get to go! 🖤❤💛", "created_utc": "1652825212.0", "edited": "False", "id": "i901tre", "is_submitter": "False", "link_id": "t3_ursg7n", "parent_id": "t1_i8z5qg5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Oh my God I loved Berlin. Can't wait to go back. Seeing and standing next to the wall was surreal. Being in the vicinity of Brandenburg Gate was surreal. Coming home and seeing historical pictures of them and knowing I stood there was surreal. \n\nI definitely recommend it. I went the summer before Covid struck, but I think the only thing that has changed is maybe there will be less people. I'll know for sure once I return this summer.", "created_utc": "1652824920.0", "edited": "False", "id": "i90164h", "is_submitter": "False", "link_id": "t3_ursg7n", "parent_id": "t1_i8z5o0b", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Asheville huh....I'll check that out. If I can get a job there, I might consider moving from Seattle.", "created_utc": "1652823471.0", "edited": "False", "id": "i8zxvoi", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i8zrxby", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I've heard of that place. Not very many people know it though, so, might wanna jump on that before it gets pricey.", "created_utc": "1652823338.0", "edited": "False", "id": "i8zxkk1", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i8z76ia", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Really?? Oh God we have I-5 and I-405 from North to South and it's backed up from 7am to 11am then 2pm to 8pm, 9-10pm sometimes. The 520 is tolled and so is the 405, so the 90 gets really backed up. On weekends I go to see my best friend in Anacortes and the back roads I knew from living in Everett is not everyone's back roads thanks to Google maps and Waze. Many of my back roads are now slammed.\n\nI really really love living here. It's distressing that I'm being priced out and I can't live within the neighborhoods that my hospital is in.", "created_utc": "1652823148.0", "edited": "False", "id": "i8zx4mr", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i8zvf6c", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Oof. I'm in Seattle, live in Seattle proper, and have lived here since 1999.\n\nReeeeally should visit before you come out here. It used to be a great place and that's all I will say about that. All the great things being said about this area is about 10-15 years out of date. \n\nImo, take a wfh tech job and take that money to live in a less expensive place. Studios that are bigger than 250ft² run from $900plus to 1400. One bedrooms that are 400ft² and shitty are hard to find and they're all $1250 and above for a month. The nice 1 bedrooms start at $1595. The nice bedrooms start at $2400. That's in Seattle. You can go to the suburbs, but then it's a commute for 1.5 hours (or more) from Everett to downtown Seattle. I used to commute from Everett to North Seattle and it used to take 30 min. I've felt the creep.\n\nI'm looking for a new place because my building was just bought out and my rent is going from $1050 to $1595 for a building built in 1963 and has no soundproofing and is next to a major street, one of two ways to get to a popular neighborhood. To pay it online since the new owner took over is a $10 convenience fee. That's how I know how much the rentals are going for. In choosing a place to live, they're slim pickins.\n\nI'm a nursing assistant in a hospital, so I can't wfh. I make way over minimum wage, but now I can't live by myself anymore. It's a big contradiction. I make more money than I ever have, but I can afford less. \n\nBut I guess if you're in tech or a hospital worker that's not CNA, housekeeping, or dietary, that's a different story. With that, you'll have to deal with all the mentally ill homeless and addicts that come through my hospital while they're out in the wild, before they set fire to a garbage can and are detained. I'm not saying they're all bad, I have no way to tell. All I know is what I've experienced. \n\nAlso, the freeways are getting more dangerous. I say this as a former California driver. Everyone here used to follow the traffic laws, but this year, there are more and more cars driving aggressively.\n\nI wish I can move, but I've built my life here. Nothing could have prepared me for how unaffordable the city that I loved so much has become.", "created_utc": "1652820064.0", "edited": "False", "id": "i8zpt36", "is_submitter": "False", "link_id": "t3_urs49t", "parent_id": "t1_i8z7dfq", "score": "35", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Oh! I have a story! One of my best friends in high school had a huge, and I mean, *huge* crush on Devon Sawa. One time, she didn't come with us to Six Flags. My other friends and I met him and his girlfriend at the gift shop as we were leaving. There's a picture of us somewhere in my old photo albums. \n\nHe was friendly and approachable and kindly let us interrupt his browsing for a picture. I tried not to be starstruck, but, I too was pulled to his magnetic presence. It was around the time when he was in Idle Hands. I thought he was cute in Little Giants, but by the time I met him, I had moved on.", "created_utc": "1652166277.0", "edited": "False", "id": "i80ugz3", "is_submitter": "False", "link_id": "t3_um9s8b", "parent_id": "t1_i80jcg5", "score": "7", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I got a layover in Schiphol in January on my way to Hannover and everyone was nice and welcoming. As an Indonesian who had never been there before, I felt self conscious handing my passport to them. I've read about our history, and even though my father lived in Amsterdam for a few years in the 1970s, and my grandmother was one of the few Indonesian women allowed to be educated back in the day, I still felt weird being there. Wasn't expecting that. I'm always excited to go to Germany, so it was a strange dichotomy within myself.\n\nI really hope I don't encounter anyone mean there when I decide to visit for real before I get these feelings sorted. I grew up in the US and consider myself American, so, to be there and be confronted emotionally by a history of colonialism was something I didn't expect to feel, if that makes sense.\n\nI might delete this, but I wanted to write it out just the same.", "created_utc": "1652119653.0", "edited": "False", "id": "i7y5i6c", "is_submitter": "False", "link_id": "t3_ult7el", "parent_id": "t1_i7xoue2", "score": "19", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Wow. Just read their website. Can you or anyone else tell me your/their experience with Harlick skates, the customer service and why you decided on them? Yes, they're pricey, I'm just curious because I'm thinking about getting customized wifa boots when I go to Germany this summer. I also just like knowing about the different skates that can be had out there. This hobby is therapeutic for me and the more I know, the more I can point people to rollerskating. Thank you!", "created_utc": "1652118885.0", "edited": "False", "id": "i7y3mhi", "is_submitter": "False", "link_id": "t3_ulv8r1", "parent_id": "t1_i7xwdzl", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Same! I am not a fan of IPAs! I'm in Seattle too. I started with Fat Tire and eventually that started to taste like soy sauce to me. A good friend introduced me to Hefeweizen. Oh my God was my love for beer rekindled with that one!\n\nSomehow I found the one German guy who doesn't drink a lot of beer. I didn't find this out until a good few weeks in of dating him. He also doesn't play or watch soccer despite going to university living close to the central office of BvB, but that's a whole other thing.\n\nHe took me to Germany. Northern, not Southern, so they've got their own flavor and taste. They're legit serious about that shit, to the point of having beer purity laws called Reinheitsgebot, if you don't know. Not an IPA anywhere. Witbier heaven. I pretty much know I'm with the right man.\n\n🍻 Prost!", "created_utc": "1651905375.0", "edited": "False", "id": "i7nf1hc", "is_submitter": "False", "link_id": "t3_ujr70q", "parent_id": "t1_i7ma9x9", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "You're definitely goals, sis!", "created_utc": "1651877392.0", "edited": "False", "id": "i7m0ww0", "is_submitter": "False", "link_id": "t3_ujp7dj", "parent_id": "t3_ujp7dj", "score": "13", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I can relate. I got the blue Barbie Lollies when what I wanted were the pink ones.  I returned them and got a pair of the strawberry pink ones off FB marketplace, almost new ones because the previous owner didn't warm up to rollerskating like she wanted to. I paid well under $300 for them and I'm happy. They are pretty *and* a joy to skate on.\n\nIf it's causing you much emotion, return or sell them and get yourself what you really want. Someone will be really happy with them and you will be happy with what you truly want. That is, if you can't bond with these skates. Yes, most people can't afford them and this can be an exercise in gratitude, but it's also no problem if you can afford it to switch.", "created_utc": "1651875372.0", "edited": "False", "id": "i7lwmlw", "is_submitter": "False", "link_id": "t3_uj30j3", "parent_id": "t3_uj30j3", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I just saw the post that had someone's before and after they took their Boardwalks to a cobbler and I'm blown away. I second this.", "created_utc": "1651874791.0", "edited": "False", "id": "i7lvena", "is_submitter": "False", "link_id": "t3_uj84no", "parent_id": "t1_i7hjg3r", "score": "1", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Thanks for this! I never thought of bringing them to the cobbler. You're right, it would be worth it with pricey skates. The difference is so obvious! Happy skating!", "created_utc": "1651874689.0", "edited": "False", "id": "i7lv6s5", "is_submitter": "False", "link_id": "t3_uioexg", "parent_id": "t3_uioexg", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Oh, this is sweet. Yeah, call your moms and Omas!", "created_utc": "1651873575.0", "edited": "False", "id": "i7lsqz9", "is_submitter": "False", "link_id": "t3_ujihib", "parent_id": "t1_i7k85ee", "score": "4", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "So wholesome! I started my morning with this and showed it to my boyfriend so he'll be inspired. I just want him to share the fun since his tween daughter and I are both quad skaters. You can do it, my love!", "created_utc": "1651873454.0", "edited": "False", "id": "i7lshho", "is_submitter": "False", "link_id": "t3_ujihib", "parent_id": "t3_ujihib", "score": "5", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Ah for the dribble and stiffness, I felt the same way for both brands. I only lace until two of the hooks are left on top. That helper, maybe that will help you top. Thanks for the plate tip! I didn't  look at the actual plate, so I'll do that. \n\nFeel free to DM me if you have any more questions. Where did you buy your Lunas? I'm in the US but buying them from Belgium, even with the shipping, was cheaper.", "created_utc": "1651700722.0", "edited": "False", "id": "i7cigun", "is_submitter": "False", "link_id": "t3_tub8s1", "parent_id": "t1_i79ywup", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I....feel your pain so damn much \n\nI have adhd and impulse buying is so...hard. I got so many skates and now they are past the return window. \n\nI know it's not Saturday, but, maybe if it's comments and not a whole-ass post, it's OK? I'm trying to sell my new in box Chaya Melrose Premiums in size 38 and 40. I ended up being a 39. I wear 8 in street shoes. If anyone reading is interested, send me a DM and we can chat.", "created_utc": "1651697711.0", "edited": "False", "id": "i7casqi", "is_submitter": "False", "link_id": "t3_ui8wcr", "parent_id": "t3_ui8wcr", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I love this 😀 ❤", "created_utc": "1651653774.0", "edited": "False", "id": "i79pvoy", "is_submitter": "False", "link_id": "t3_uhju0o", "parent_id": "t3_uhju0o", "score": "2", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Hi! Yes, I'll be happy to chime in. I got the Lunas in Princess, Savannah, and Mint Flash plus both colors of Chaya Premiums. I loosened my trucks and wheels (to my taste) using the tools that came with the Chayas, which, my goodness, was was wonderful surprise.\n\nLunas: Princess and Savannah are the most responsive skates I've ever skated on! They are great for jam skating. But the Mint Flash feels like there's something wrong with them. I've tried loosening the trucks and wheels, but they are still so hard to skate on. I'm going to try to reach out to sucker punch and see if I can get a replacement. They've been really good and responsive. Once I tried on my Princess when I first got them, I liked them better than my Lollies! The Lunas do have better cushioning and are more responsive as stock. I understand that adding insoles are possible. \n\nChayas: I got these after and was really surprised how much I liked them even more! I got them for park skating, but have yet to take them to a park. Here's the thing though, the Berry Red pair feels much more responsive and smoother than my Juniper Green ones. I'm going to tinker a little and maybe replace the wheels, cushions, and bearings. The boots are omg....like skating on clouds! \n\nIf all the pairs of the Berry Reds are that smooth to skate on, I'd fill my closet with them.\n\nBoot comfort, the Chaya Premiums win.  But I skate on all of my skates. With all three of the brands of skates I'm on, I'm impressed with the fact that I skated for hours on them and nothing hurt my 40 year old feet and legs, even though I haven't skated since I was a little girl.\n\nAs far as supportiveness, I'd rate them Chaya Premiums first, then Lunas, then Lollies. I'm so impressed with my red Chayas though. Enough to tell you that if you're debating getting another, do it. There's a reason why I have both 🙂.", "created_utc": "1651652515.0", "edited": "1651652829.0", "id": "i79ofzs", "is_submitter": "False", "link_id": "t3_tub8s1", "parent_id": "t1_i6wunfd", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "This video also helped me in backwards skating. She's responsive on her insta too. (I only have Insta because I'm too busy for anything else, but she's in tiktok too)", "created_utc": "1650922760.0", "edited": "False", "id": "i66o690", "is_submitter": "False", "link_id": "t3_ubrjvj", "parent_id": "t1_i665es9", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Oh my god! Thank you sooooo much!", "created_utc": "1649198309.0", "edited": "False", "id": "i3jviyv", "is_submitter": "False", "link_id": "t3_tx37ri", "parent_id": "t1_i3jrbqj", "score": "3", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "There's a skate park in Anacortes, La Conner, Lopez Island. There's a rink in Marysville. I'm in Seattle, my best friend lives in Anacortes, and I drive there often. I'll keep an eye out for more when I drive there. Parking garages are an excellent idea too", "created_utc": "1649198082.0", "edited": "False", "id": "i3jv03g", "is_submitter": "False", "link_id": "t3_tx37ri", "parent_id": "t3_tx37ri", "score": "2", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Hey, thanks! I'd really be interested in proper foundation and conditioning drills. I skated and bladed when I was a kid, now I'm getting back into it. Skating older and not knowing basics feels so much harder, like I'm working harder than I need to, if that makes sense.", "created_utc": "1649197708.0", "edited": "False", "id": "i3ju4ll", "is_submitter": "False", "link_id": "t3_tx2pa2", "parent_id": "t3_tx2pa2", "score": "5", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "Oh noooo! I almost got Boardwalks! \n\nI got the Lunas and the Chaya Premium instead and I'm glad. Sure Grip Boardwalks came with such great reviews, but the day I was going to buy them, I changed my mind, ordered the Chayas that day and Luna not far after. \n\nI also think reaching out to Sure Grip will be worth your while. Don't feel bad, you didn't know you were going to get your skates in this condition.", "created_utc": "1648931374.0", "edited": "False", "id": "i35boo6", "is_submitter": "False", "link_id": "t3_tub8s1", "parent_id": "t3_tub8s1", "score": "4", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "I second the Moxi lolly. I've got other skates to compare them to and the lollies fit what you want best; that is lightly padded, narrow, and very soft. \n\nLike the other poster here said, they also make them as ice skates and I believe the Jacks too, but I haven't tried those on.", "created_utc": "1648674672.0", "edited": "False", "id": "i2rkvmp", "is_submitter": "False", "link_id": "t3_tsdkbs", "parent_id": "t3_tsdkbs", "score": "6", "subreddit": "Rollerskating", "subreddit_id": "t5_2vjfl"}, {"author": "petrichorgasm", "body": "If all goes well and no additional travel restrictions are made, I'll be there in a few months! (But too late for cherry blossoms so thanks for sharing)", "created_utc": "1648674125.0", "edited": "False", "id": "i2rjje1", "is_submitter": "False", "link_id": "t3_ts5g4w", "parent_id": "t3_ts5g4w", "score": "3", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Zac Efron. I'm okay with this. I feel a little creepy pervy since afaik, he's in High School Musical, but, guess he's gonna grow up sometime.\n\n(Been watching The Greatest Showman so the googling wasn't completely random)", "created_utc": "1642592935.0", "edited": "False", "id": "htb28au", "is_submitter": "False", "link_id": "t3_s7iho4", "parent_id": "t3_s7iho4", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I have a kitchenaid. The pasta maker and ice cream bowls are game changers.", "created_utc": "1635905957.0", "edited": "False", "id": "hj3i32k", "is_submitter": "False", "link_id": "t3_qle1q7", "parent_id": "t1_hj2dbd0", "score": "3", "subreddit": "AskBaking", "subreddit_id": "t5_3f2xj"}, {"author": "petrichorgasm", "body": "I think I'll retract that application to be OR assistant for our Level 1.", "created_utc": "1630281825.0", "edited": "False", "id": "hav8v4d", "is_submitter": "False", "link_id": "t3_pdzzrw", "parent_id": "t1_haulb1u", "score": "12", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "CNA here. That was a hauntingly beautiful story and the ending is poignant. Thank you for taking the time to write it out.\n\nOur field attracts so many caring people who get used and abused and still come back, but what people can never realize is how we see every facet of humanity and how we're able to (or forced to as well) roll it over like water on a duck's back and come back day after day, year after year. Take care.", "created_utc": "1630276655.0", "edited": "False", "id": "hauy3p2", "is_submitter": "False", "link_id": "t3_pdzzrw", "parent_id": "t1_haui71f", "score": "22", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thanks that's a great idea", "created_utc": "1629186326.0", "edited": "False", "id": "h99ihf1", "is_submitter": "False", "link_id": "t3_p5t627", "parent_id": "t1_h99efkt", "score": "7", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "petrichorgasm", "body": "Thank you so much!", "created_utc": "1626155351.0", "edited": "False", "id": "h50autm", "is_submitter": "False", "link_id": "t3_oiq7vk", "parent_id": "t1_h509hh8", "score": "1", "subreddit": "AskBaking", "subreddit_id": "t5_3f2xj"}, {"author": "petrichorgasm", "body": "Would aquafaba work in this case? I read that it could be used in place of egg whites, but I don't remember where I read that", "created_utc": "1626152849.0", "edited": "False", "id": "h507ig1", "is_submitter": "False", "link_id": "t3_oiq7vk", "parent_id": "t1_h4xvzsv", "score": "1", "subreddit": "AskBaking", "subreddit_id": "t5_3f2xj"}, {"author": "petrichorgasm", "body": "I'm so angry for you that I can't even type fast enough to tell you my opinion. Get a second opinion, do not go back to this nurse practitioner. Her information is about 30 years outdated. I'm 100% sure that no MD or other ARNP/DNPs  are allowed to renew their license without having continuing education and if she is seeing patients for ADHD issues, this is very, very concerning for all of us in this subreddit who can potentially receive the same misinformation.", "created_utc": "1622696065.0", "edited": "False", "id": "h0eke2h", "is_submitter": "False", "link_id": "t3_nqp98w", "parent_id": "t3_nqp98w", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "*Goddammit, why do I attract these dudes when I'm super outgoing?!*\n\nOpposites attract, I guess?", "created_utc": "1622436232.0", "edited": "False", "id": "h01ttfn", "is_submitter": "False", "link_id": "t3_no8dzw", "parent_id": "t3_no8dzw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thank you! This is so helpful. I followed you on Insta.", "created_utc": "1622193077.0", "edited": "False", "id": "gzqmj7b", "is_submitter": "False", "link_id": "t3_nmngan", "parent_id": "t3_nmngan", "score": "2", "subreddit": "MealPrepSunday", "subreddit_id": "t5_37cer"}, {"author": "petrichorgasm", "body": "Ah, I didn't see that.", "created_utc": "1622160446.0", "edited": "False", "id": "gzp88e0", "is_submitter": "False", "link_id": "t3_nmb9wx", "parent_id": "t1_gzp7r78", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "This year, for Nurses Week, the nurses got rocks. \"Healing Stones\"", "created_utc": "1622159701.0", "edited": "False", "id": "gzp6sws", "is_submitter": "False", "link_id": "t3_nmb9wx", "parent_id": "t1_gzp2n4y", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Yes, I am so burned out emotionally. My body luckily hasn't been damaged, but my god, I don't think anyone can understand what CNAs put up with. The nurses get the hero stories, the recognition, and after 19 years, it's wearing on me.", "created_utc": "1622159582.0", "edited": "False", "id": "gzp6khr", "is_submitter": "False", "link_id": "t3_nmb9wx", "parent_id": "t1_gzp0voq", "score": "12", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "CNA here. Yes. What we can describe we can put Michael Crichton into shame!", "created_utc": "1622159303.0", "edited": "False", "id": "gzp60gh", "is_submitter": "False", "link_id": "t3_nmb9wx", "parent_id": "t1_gzp0fmm", "score": "51", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I hear ya. I wanted to go work with Doctors Without Borders regardless of how it paid. I didn't have any dreams of getting married or having a family, I had dreams of helping people who couldn't afford it, rural medicine too. I have no designs of living lavishly, cuz I know enough that being an MD is not about money. \n\nI've shadowed a bunch, made friends with MDs to really get to know how it works, so I'm not going into a fantasy mindset over it. I grew up poor too, so, $55k/yr to live on as a resident is the most money I would ever make. 5 years of that is fine. I don't have children. Once I become a pulmonologist, that jumps and it's not like I don't know about lifestyle creep. I picked the apartment I am in now because it's cheap enough that I could live in it for all those years.\n\nAaaand I gotta take my meds because I'm rambling", "created_utc": "1622158617.0", "edited": "False", "id": "gzp4nsx", "is_submitter": "False", "link_id": "t3_nlreba", "parent_id": "t1_gzmqym0", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Haha, please do. It's a mystery to this day for me too. So if you find it, holler at me.", "created_utc": "1622157681.0", "edited": "False", "id": "gzp2u7f", "is_submitter": "False", "link_id": "t3_nlm773", "parent_id": "t1_gzn2tkc", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "I find that to be true in my case, learning German as an adult. I took a formal class sequence and when that ended, I continued to immerse myself when I can, with media and a native German speaker (my boyfriend). It would really have helped if only there was a luxury of not producing the language until I was ready. \n\nI wanted to learn everything before speaking so that I can chew on it a bit. That would have been perfect. However, I'm learning it now and I only speak to myself when I'm practicing and only speak it to my boyfriend when I'm feeling bold.\n\nDo you know how that differs with children who learn a language by immersion? I'm curious because I learned English with immersion when I came to America as a child and don't recall any structure or one-on-one instruction. I wasn't put into ESL, but I remembered my group was called CELL and I can't find anything on that. There was a difference between the ESL and CELL students at the time. My group spoke English very quickly, within 3 months, and the ESL students weren't talkative.", "created_utc": "1622094360.0", "edited": "False", "id": "gzlu38d", "is_submitter": "False", "link_id": "t3_nlm773", "parent_id": "t1_gzjqynw", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Brad Pitt in that movie is how I feel I sound when I'm trying to speak German now.\n\nUnless you're learning a logographic language, it can't be all bad to have taken Latin? Latin is the language of science precisely because it's dead, since science requires duplicating results and what better standard than a language that no longer evolves (I won't go into the other languages that makes up science because idk the history of how and why Greek & German also came to be used...especially with German because of the dialects)\n\nBack when I was in high school, Spanish, French, Italian, German, and Latin were offered. I knew enough to know that Latin would give me root words for all of those and I've found that to have helped me now that I'm learning German.\n\nLatin also helped me \"pick up\" Spanish (grew up in Southern California), learned French in college, understand some Italian when I studied voice; all because of the latinate in all of those languages.\n\nNow that I'm learning German in my 40s, those three years of in high school with a very intelligent German woman who spoke with a German accent I had never heard before made Latin in my head spoken with a German accent, so, in that sense, Latin *really* helped me, even though German is not classified as Romance despite their latinate.", "created_utc": "1622093256.0", "edited": "1622094483.0", "id": "gzlslt4", "is_submitter": "False", "link_id": "t3_nlm773", "parent_id": "t1_gzkvnqw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "I feel you. In this manner, my boyfriend has been such a great help to me, reminding me about doctors appointments and the like. Whenever he reminds me, I do it while he's in front of me so I don't forget again.\n\nMaybe you can do the same with your person? Or set an alarm to do it so you can forget about it and move on to something else without carrying that mental load. When the alarm rings, you do it.", "created_utc": "1622080735.0", "edited": "False", "id": "gzl8836", "is_submitter": "False", "link_id": "t3_nlasuq", "parent_id": "t1_gzknp4d", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Thank you for helping me be able to put it into perspective.", "created_utc": "1622080407.0", "edited": "False", "id": "gzl7smy", "is_submitter": "False", "link_id": "t3_nlltzb", "parent_id": "t1_gzklb4n", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "I just straight up asked her. I don't beat around the bush with mine. She's one of the good ones.", "created_utc": "1622069250.0", "edited": "False", "id": "gzklec6", "is_submitter": "False", "link_id": "t3_nlasuq", "parent_id": "t1_gzkb0kc", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "I don't talk about my diagnosis anymore. I was so excited to be dx in my late 30s, that I couldn't stop being so happy. \n\nAfter continuously degraded at different pharmacies, being made to wait for hours, pharmacy staff looking at me suspiciously saying, \"this is our license\" my self confidence took a nosedive. When I finally found a pharmacy that treats me like I'm human, I stuck to it, even when I moved half an hour away. \n\nI've been a nursing assistant since the 90s and know the drill, but the stark difference of being judged by pharmacists that I don't know in drug stores vs having a good rapport and support with the department at the hospital I worked at, really took the wind out of my sails and eventually took me out of healthcare altogether. \n\nYou're right, it rubs me the wrong way too.", "created_utc": "1622069193.0", "edited": "False", "id": "gzkl9y6", "is_submitter": "False", "link_id": "t3_nlasuq", "parent_id": "t3_nlasuq", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "If I go to the beach unmedicated, I look down and start collecting rocks instead of enjoying my time off.", "created_utc": "1622068622.0", "edited": "False", "id": "gzkk2xv", "is_submitter": "False", "link_id": "t3_nlltzb", "parent_id": "t3_nlltzb", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Yea, people look at me weird when they ask me what would I do if I won the lottery or had endless money, I'd go to medical school to learn what interests me about the human body, find the answers in places no one looked at before,  advocate for off-label use of medications (example: Viagra was a heart medication when it was realized that it also helps with ED). \n\nRare diseases would be my jam, especially within cardiopulmonary concentration. I went to RT school and found that's my passion. But, life, money, and obligations cut off my career before I began. \n\nIt's fine, I can't change the past. I do dream about it though. Boy, do I....especially when I'm not medicated. Haha", "created_utc": "1622068017.0", "edited": "False", "id": "gzkisbo", "is_submitter": "False", "link_id": "t3_nlreba", "parent_id": "t3_nlreba", "score": "46", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "That is adorable", "created_utc": "1622049532.0", "edited": "False", "id": "gzjbxbx", "is_submitter": "False", "link_id": "t3_nl8jl7", "parent_id": "t1_gzihxte", "score": "1", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "petrichorgasm", "body": "Yeah, I used to be awakened in the middle of the night, or get screamed at, and have been kicked out into the night. For a few days after something like that happened, I'd have a bag packed with essentials because the first night, I'd just get thrown out with the clothes on my back.\n\nI never thought about how traumatic growing up was for me.", "created_utc": "1622016159.0", "edited": "False", "id": "gzhnzjy", "is_submitter": "False", "link_id": "t3_njrvgm", "parent_id": "t1_gzeb2gy", "score": "9", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Wow, this hits home. I didn't know packing \"stuff\" is a form of ptsd. I used to always carry a bunch of stuff I don't need, even my purses used to be huge and heavy. Back when I was much younger, packing for slumber parties, choir trips, camping, or youth group weekends used to feel so stressful. \n\nI'm in a completely different place mentally now and packing is different. I now have a master pack list that I stick to.  Hugs to you. You are making excellent progress.", "created_utc": "1622015921.0", "edited": "False", "id": "gzhnpgk", "is_submitter": "False", "link_id": "t3_njrvgm", "parent_id": "t1_gzclsoc", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Ah, with me is for his mum and so I can talk to the kids' cousins whenever I go there. His mum is so sweet and I adore her. One time she confided in my boyfriend that she really likes me but talking to me in English is stressful.\n\nI want to make her feel not stressful. His father speaks perfect English with a British accent and we get along well do no problems there. \n\nViel Glück! I've been learning it for a couple of years now and it's been so rewarding. \n\nBtw, you reminded me that I would love to learn Norwegian because there is a free class given nearby. My ex-husband is of Norwegian ancestry and we used to live in a neighborhood here in the US that has a sister city in Bergen. King Olav was here a one of the years to dedicate a park.", "created_utc": "1622004142.0", "edited": "False", "id": "gzh8acq", "is_submitter": "False", "link_id": "t3_nj6w45", "parent_id": "t1_gz6zyyd", "score": "2", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "Talk to myself in German at home when I'm alone\n\nStream German shows with German subtitles, German dictionary beside me\n\nListen to German pop (the words repeat)\n\nWrite my daily Journaling in German\n\nLook up German words\n\nI have a notebook of German phrases that I add to\n\nThose are ways that I came up with on my own. Repetition helps me a lot. I also have a tiny German tutor, my boyfriend's 11 yr old daughter who is also learning it. Everything else, my boyfriend helps me. I'm learning this because he's German and his parents are still there. He and his father were teachers so I lucked out there. \n\nI hope it helps!", "created_utc": "1621796744.0", "edited": "False", "id": "gz6w864", "is_submitter": "False", "link_id": "t3_nj6w45", "parent_id": "t3_nj6w45", "score": "5", "subreddit": "German", "subreddit_id": "t5_2qq51"}, {"author": "petrichorgasm", "body": "The Fast and the Fuhr-ious", "created_utc": "1620852582.0", "edited": "False", "id": "gxwetbv", "is_submitter": "False", "link_id": "t3_najy1z", "parent_id": "t1_gxwecad", "score": "15", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "The sass on that reporter is everything. Had me replaying it and cracking up.", "created_utc": "1620850922.0", "edited": "False", "id": "gxwat4j", "is_submitter": "False", "link_id": "t3_naq2op", "parent_id": "t3_naq2op", "score": "1", "subreddit": "nottheonion", "subreddit_id": "t5_2qnts"}, {"author": "petrichorgasm", "body": "I have the bowl lift and my cousins have the tilt-head. I got mine because I wanted to do breads and pasta. Makes kneading sooo much easier. My cousins only do cakes, so it's perfect for them. \n\nAs for me, being used to the pro bowl lift, the tilt-head doesn't feel as stable. \n\nIf you're only doing cakes, the tilt head is fine. It looks cool too.", "created_utc": "1620803573.0", "edited": "False", "id": "gxttcrt", "is_submitter": "False", "link_id": "t3_na1r45", "parent_id": "t3_na1r45", "score": "6", "subreddit": "AskBaking", "subreddit_id": "t5_3f2xj"}, {"author": "petrichorgasm", "body": "I just received a harvest of fresh rhubarb and now know what to do with it. Thank you!", "created_utc": "1620721319.0", "edited": "False", "id": "gxpgxg6", "is_submitter": "False", "link_id": "t3_n7xrch", "parent_id": "t3_n7xrch", "score": "2", "subreddit": "Old_Recipes", "subreddit_id": "t5_13kjsj"}, {"author": "petrichorgasm", "body": "How cool! I've got The New Settlement Cookbook and have been wondering what the original looks like! Thanks for sharing!", "created_utc": "1620696501.0", "edited": "False", "id": "gxogxgz", "is_submitter": "False", "link_id": "t3_n97za5", "parent_id": "t3_n97za5", "score": "2", "subreddit": "Old_Recipes", "subreddit_id": "t5_13kjsj"}, {"author": "petrichorgasm", "body": "Agreed, these look at lot like my sugar pumpkins I have that I started from seed.", "created_utc": "1619600053.0", "edited": "False", "id": "gw5hin1", "is_submitter": "False", "link_id": "t3_n044y1", "parent_id": "t3_n044y1", "score": "1", "subreddit": "SquareFootGardening", "subreddit_id": "t5_2rlah"}, {"author": "petrichorgasm", "body": "He handed me a glasses case that I had left in his car and asked if it was mine. I was headed to change for our date. I glanced at it and said yes. He said he wanted me to be sure if it's mine so if I could please just check if the glasses inside were mine. \n\nIt wasn't my glasses that were inside, but a rose, cut to size. I had never realized that my case had the inscription: *nice to see you*\n\nI love being surprised like that and that was really smooth. I'll never forget that feeling. That was the last Valentine's Day we had together as a couple. A few days later, the first Covid case in the United States hit Seattle and with me being a nursing assistant, a lot changed very quickly. \n\nWe're just friends now, but, he remains the smoothest ex boyfriend I've ever had. I don't want him back because we just aren't a match, but as far as knowing how to treat women, that guy is on such a different level.", "created_utc": "1618722684.0", "edited": "1618728120.0", "id": "guxup2k", "is_submitter": "False", "link_id": "t3_msy7ko", "parent_id": "t3_msy7ko", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thank you 😊", "created_utc": "1618600798.0", "edited": "False", "id": "gurbtx1", "is_submitter": "False", "link_id": "t3_ms2hs2", "parent_id": "t1_gur2nhc", "score": "1", "subreddit": "news", "subreddit_id": "t5_2qh3l"}, {"author": "petrichorgasm", "body": "Oh, yay! I saw the German recipe first and was thinking I'll have to have my boyfriend translate the steps, but now I can leave him alone.\n\nAnd yes, so worth it.", "created_utc": "1618509972.0", "edited": "False", "id": "gumqftk", "is_submitter": "False", "link_id": "t3_mrf4qr", "parent_id": "t1_gum6bry", "score": "6", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Keine Probleme. I'll take the previous suggestion of making my own seitan and put it into your recipe instead of meat. Danke", "created_utc": "1618509607.0", "edited": "False", "id": "gumplhr", "is_submitter": "False", "link_id": "t3_mrf4qr", "parent_id": "t1_gum6x88", "score": "3", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Ah, youre right. Yes, I do know how to make seitan from scratch and didn't even think about that. One question though, how can I make my seitan softer? Do I just squeeze out less water than I've been doing?\n\nThank you u/LiuCatlin", "created_utc": "1618509528.0", "edited": "False", "id": "gumpf5n", "is_submitter": "False", "link_id": "t3_mrf4qr", "parent_id": "t1_gum71zx", "score": "2", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Aww, Maultaschen can be made in America. I've done it and my German-born boyfriend says it's yummy.\n\nIf you have a pasta maker, it's a lot easier. I have a manual one that I got in a thrift store for $20. It hangs out on my dining room table and is a handcrank. Use any pasta recipe and  use the sheet attachment up until the second to last thinnest level. On mine it's 5.", "created_utc": "1618500914.0", "edited": "False", "id": "gum5h9x", "is_submitter": "False", "link_id": "t3_mrf4qr", "parent_id": "t1_gum2ldn", "score": "12", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "Anyone have a vegetarian Maultaschen recipe that they like? I have vegetarian youngies in my life that I'd love to make these for.\n\nThis is the best Maultaschen I've seen that doesn't look like ravioli (not that ravioli is bad, I just wanted a different shape).\n\nLast batch I made fell apart and so I improvised them into Königsberger Klopse. My boyfriend ate them for days after I went home, I'm sure, because the recipe made viel meatballs. (Mein Freund kommt aus Deutschland, so, he always says yes when I suggest German food for dinner. The aforementioned youngies are his vegetarian children)", "created_utc": "1618500592.0", "edited": "False", "id": "gum4qfs", "is_submitter": "False", "link_id": "t3_mrf4qr", "parent_id": "t3_mrf4qr", "score": "5", "subreddit": "germany", "subreddit_id": "t5_2qi4z"}, {"author": "petrichorgasm", "body": "The one near me is surrounded by other grocery stores. I didn't know what it was until I read this, so thanks.", "created_utc": "1618466867.0", "edited": "False", "id": "guksvls", "is_submitter": "False", "link_id": "t3_mr2rrr", "parent_id": "t3_mr2rrr", "score": "2", "subreddit": "Frugal", "subreddit_id": "t5_2qhbe"}, {"author": "petrichorgasm", "body": "I made this yesterday and am munching on it right now, actually. It's my go-to and the only recipe I use. \n\nI weigh the flour and sugar instead of using cups. I add chopped walnuts and replace half of the flour with whole wheat flour. \n\nWould recommend.\n\nDefinitely would recommend.", "created_utc": "1618466398.0", "edited": "False", "id": "guksba5", "is_submitter": "False", "link_id": "t3_mqvun5", "parent_id": "t1_guk417j", "score": "2", "subreddit": "AskBaking", "subreddit_id": "t5_3f2xj"}, {"author": "petrichorgasm", "body": "Good bye, Earl of Simmons. Party up. 😢", "created_utc": "1618002477.0", "edited": "False", "id": "gtz4e9t", "is_submitter": "False", "link_id": "t3_mnkp67", "parent_id": "t3_mnkp67", "score": "1", "subreddit": "Music", "subreddit_id": "t5_2qh1u"}, {"author": "petrichorgasm", "body": "The cum cum guy from that Jennifer Aniston and Vince Vaughn movie.", "created_utc": "1617648716.0", "edited": "False", "id": "gthf07s", "is_submitter": "False", "link_id": "t3_mkie5q", "parent_id": "t1_gtgqmag", "score": "21", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Yes. Thank you for telling me about this.", "created_utc": "1616704359.0", "edited": "False", "id": "gs7r118", "is_submitter": "False", "link_id": "t3_mcckh3", "parent_id": "t3_mcckh3", "score": "1", "subreddit": "LadyBoners", "subreddit_id": "t5_2sate"}, {"author": "petrichorgasm", "body": "Love me a good polyglot. He needs to crossover to r/germanladyboners\n\nEdit: looks like he already has", "created_utc": "1616704122.0", "edited": "False", "id": "gs7qhnx", "is_submitter": "False", "link_id": "t3_md2pux", "parent_id": "t3_md2pux", "score": "8", "subreddit": "LadyBoners", "subreddit_id": "t5_2sate"}, {"author": "petrichorgasm", "body": "Close up, I can see if the pattern was bigger, it'd have a Grateful Dead vibe. But because it's so small, it's mush from far away.", "created_utc": "1616259762.0", "edited": "False", "id": "grlstm7", "is_submitter": "False", "link_id": "t3_lv1vtz", "parent_id": "t3_lv1vtz", "score": "1", "subreddit": "LuLaNo", "subreddit_id": "t5_a8u29"}, {"author": "petrichorgasm", "body": "If I had these last month, I would have worn them under my scrubs", "created_utc": "1616259589.0", "edited": "False", "id": "grlsh6l", "is_submitter": "False", "link_id": "t3_lypuzi", "parent_id": "t3_lypuzi", "score": "1", "subreddit": "LuLaNo", "subreddit_id": "t5_a8u29"}, {"author": "petrichorgasm", "body": "Yes! As buffet pants!", "created_utc": "1616259485.0", "edited": "False", "id": "grls9r6", "is_submitter": "False", "link_id": "t3_m00oyy", "parent_id": "t1_gq6clkq", "score": "1", "subreddit": "LuLaNo", "subreddit_id": "t5_a8u29"}, {"author": "petrichorgasm", "body": "Don't do Dali like that", "created_utc": "1616259415.0", "edited": "False", "id": "grls4qr", "is_submitter": "False", "link_id": "t3_m0jr40", "parent_id": "t1_gqa80fa", "score": "1", "subreddit": "LuLaNo", "subreddit_id": "t5_a8u29"}, {"author": "petrichorgasm", "body": "I.......actually like this one. 🙊\n\nGet in, loser. We're going thrifting.", "created_utc": "1616258888.0", "edited": "False", "id": "grlr2vg", "is_submitter": "False", "link_id": "t3_ltuqky", "parent_id": "t3_ltuqky", "score": "1", "subreddit": "LuLaNo", "subreddit_id": "t5_a8u29"}, {"author": "petrichorgasm", "body": "Wait, is that a take on those Notorious RBG shirts? With a dissent collar and errthang.", "created_utc": "1616258732.0", "edited": "False", "id": "grlqrsi", "is_submitter": "False", "link_id": "t3_lthqjl", "parent_id": "t3_lthqjl", "score": "2", "subreddit": "LuLaNo", "subreddit_id": "t5_a8u29"}, {"author": "petrichorgasm", "body": "I don't know what I will do with my one pair of wool pants. I don't even know why I *have* wool pants. I wore scrubs to work since 1997 up until last month.", "created_utc": "1616249746.0", "edited": "False", "id": "grla11l", "is_submitter": "False", "link_id": "t3_m8zdl7", "parent_id": "t1_grkvnqe", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Yes! I know exactly what you are talking about. Bonus points if your crush and his/her friends sing some Newsboys/Audio Adrenaline/Barlow Girl/etc.", "created_utc": "1616230258.0", "edited": "False", "id": "grknbyj", "is_submitter": "False", "link_id": "t3_m6hbnp", "parent_id": "t1_grggfn0", "score": "1", "subreddit": "Youniqueamua", "subreddit_id": "t5_3n4el"}, {"author": "petrichorgasm", "body": "Oh, that's nice, there are at least 17 people interested in Mortuary Sciences.", "created_utc": "1615967822.0", "edited": "False", "id": "gr7ssz3", "is_submitter": "False", "link_id": "t3_m6h4rf", "parent_id": "t3_m6h4rf", "score": "12", "subreddit": "Youniqueamua", "subreddit_id": "t5_3n4el"}, {"author": "petrichorgasm", "body": "Thanks, I hate it.", "created_utc": "1615967147.0", "edited": "False", "id": "gr7s4v1", "is_submitter": "False", "link_id": "t3_m6hbnp", "parent_id": "t3_m6hbnp", "score": "17", "subreddit": "Youniqueamua", "subreddit_id": "t5_3n4el"}, {"author": "petrichorgasm", "body": "Thank you.", "created_utc": "1615770420.0", "edited": "False", "id": "gqysl3a", "is_submitter": "False", "link_id": "t3_m47ub7", "parent_id": "t1_gquchhk", "score": "1", "subreddit": "Frugal", "subreddit_id": "t5_2qhbe"}, {"author": "petrichorgasm", "body": "I like this. What kind of drill tips? I read diamond once. Is that what you use?", "created_utc": "1615674932.0", "edited": "False", "id": "gqucc6k", "is_submitter": "False", "link_id": "t3_m47ub7", "parent_id": "t1_gqu5y6r", "score": "2", "subreddit": "Frugal", "subreddit_id": "t5_2qhbe"}, {"author": "petrichorgasm", "body": "The ECCC I went to was the first and last one I had the chance to go to. It was the one that David Tennant and Billie Piper was in and they are my absolute Doctor/Companion duo. David was so amazingly kind and I'm so glad. Billie looked like she wasn't very happy (my guess is jet lag). I got to tell her that she's the reason I gave Doctor Who a chance and that I've been a fan of hers since Honey to the B and that I used to blast Because We Want To coming home from school in the 90s. Her face lit up and made sure my ex and I had a great picture. She made my...life! I don't think many people tell her that she's the reason they watch Doctor Who. Someone in line was like, \"that was way more than 30 seconds.\" Lol, come on, I've been a fan of Billy since 1998! David liked my ex's cosplay. I sewed it so, I was floating the rest of the year. David Tennant complimented my sewing!!", "created_utc": "1615615307.0", "edited": "False", "id": "gqrwwul", "is_submitter": "False", "link_id": "t3_m3nhmj", "parent_id": "t1_gqr5xt6", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I would like to know more too, please.", "created_utc": "1615585528.0", "edited": "False", "id": "gqqiv8y", "is_submitter": "False", "link_id": "t3_m3mpjf", "parent_id": "t1_gqq7ef8", "score": "5", "subreddit": "HistoryPorn", "subreddit_id": "t5_2skqi"}, {"author": "petrichorgasm", "body": "Dzień dobry. Where did you learn Polish from? That's one of the languages I'm trying to learn.", "created_utc": "1614984174.0", "edited": "False", "id": "gptqzyx", "is_submitter": "False", "link_id": "t3_lyc796", "parent_id": "t1_gpsd832", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "That is so disappointing. Thanks for posting. I'm a little bit of a kitchen knife snob. I used to work for a catalog company that sold both Henckles and Wüstof and got pretty deep into being their fangirl. I've got some older Henckles that are doing pretty well. I do notice that if you look on the blade, mine says China, Spain, and Portugal. If I had seen the Chia made one earlier, I wouldn't have gotten it. Luckily, it wasn't a chef's knife it was a regular smaller knife. I'm reeeeally picky about my chef's knife. The one that is my workhorse is not at all branded, it only says \"Japan\" on the blade. Haven't come across anything Made in Germany, but, I don't really know their history either. Nowadays, I look for full tang and how it feels when handled. The cleavers in the Asian stores are impressive, pricey for the store, but my mom has one that she's used that's all steel. I'd buy it, but, I don't really care to butcher anything. I ask the meat guy to do it.\n\nAnyway, I guess my fangirling is reserved for Wüstof now. I have to remember that I've got all I need knifewise.", "created_utc": "1614642314.0", "edited": "False", "id": "gpcvkoj", "is_submitter": "False", "link_id": "t3_iyut7s", "parent_id": "t3_iyut7s", "score": "2", "subreddit": "BIFLfails", "subreddit_id": "t5_htv05"}, {"author": "petrichorgasm", "body": "An interior designer friend recommends Crate&Barrel over West Elm. Sorry this happened to you. WE isn't cheap!", "created_utc": "1614641657.0", "edited": "False", "id": "gpcub8r", "is_submitter": "False", "link_id": "t3_j7bdxz", "parent_id": "t3_j7bdxz", "score": "1", "subreddit": "BIFLfails", "subreddit_id": "t5_htv05"}, {"author": "petrichorgasm", "body": "I was diagnosed in my late 30s from reading a reddit post reply, figure that. Also got my ex-husband diagnosed. Couldn't save the marriage, but saved the friendship, at least. Shoutout to r/adhd for figuratively saving my life. \n\nI came from the generation where everyone started to think it was overdiagnosed and used to make fun of my symptoms as adhd...and I actually was.\n\nSquirrel!", "created_utc": "1613943117.0", "edited": "False", "id": "go9pp7k", "is_submitter": "False", "link_id": "t3_loo05u", "parent_id": "t1_go75906", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Trust that your doc wants what's best for you. I was shaking and stuttering when I told my doctor and she was very understanding. She referred me to a psychiatrist and he corroborated the diagnosis. I'm on adderall and what used to take me 4 hours gets done with much less time. \n\nYou can do this. You're not weird. Your brain doesn't make enough neurotransmitters. I tell myself something I read on r/adhd, and that is my medicated is other's normal.", "created_utc": "1613942554.0", "edited": "False", "id": "go9oinr", "is_submitter": "False", "link_id": "t3_loo05u", "parent_id": "t1_go8keom", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thank you! That's a great idea!", "created_utc": "1612066301.0", "edited": "False", "id": "glg2kzf", "is_submitter": "False", "link_id": "t3_kryiza", "parent_id": "t1_gigaszt", "score": "1", "subreddit": "UrbanGardening", "subreddit_id": "t5_2vunn"}, {"author": "petrichorgasm", "body": "Mine is a Kenmore and has the same feature. Commenting in case someone has a Kenmore too.", "created_utc": "1612066129.0", "edited": "False", "id": "glg2a6x", "is_submitter": "False", "link_id": "t3_l8oeyv", "parent_id": "t1_gldow1x", "score": "1", "subreddit": "sewhelp", "subreddit_id": "t5_2srbo"}, {"author": "petrichorgasm", "body": "Ah, apologies for the assumption. Would she share her recipe? My family is from Northern Sulawesi so I wonder how the recipes would differ or match up.", "created_utc": "1611730836.0", "edited": "False", "id": "gkx7vog", "is_submitter": "False", "link_id": "t3_l5el4d", "parent_id": "t1_gkx783m", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Because I want to tell people that my screen cracked when I dropped it going into Legoland in Denmark back in 2019 (I'm American and that was the last time I traveled before Covid) \n\nS9+ for life! But for real though, I want to travel again, but with a cell phone that has a case.", "created_utc": "1611730686.0", "edited": "False", "id": "gkx7oof", "is_submitter": "False", "link_id": "t3_l5tpi5", "parent_id": "t3_l5tpi5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "We can't let that stop us 🤗", "created_utc": "1611730120.0", "edited": "False", "id": "gkx6z1i", "is_submitter": "False", "link_id": "t3_l3idq4", "parent_id": "t1_gkjxbtg", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Yes! How come I had to scroll so far to find rendang? My mom is a great cook, but she doesn't use recipes. What Indonesian mom does? I'm assuming you're Indonesian. \n\nMy dad watched her cook and wrote down the recipe for me because I live in another state. My Papa has legendary patience because my mom is cerewet, especially in the kitchen.", "created_utc": "1611729864.0", "edited": "False", "id": "gkx6n61", "is_submitter": "False", "link_id": "t3_l5el4d", "parent_id": "t1_gku94f1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thank you for sharing! I'm always on the lookout for fried chicken recipes. I just got a cast iron pot and it needs breaking in", "created_utc": "1611726117.0", "edited": "False", "id": "gkx1ggn", "is_submitter": "False", "link_id": "t3_l5el4d", "parent_id": "t1_gktwlv6", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "u/firelenze had success with this one. They posted it in the comments.\n\nhttps://www.williams-sonoma.com/recipe/sticky-toffee-pudding.html?cm_src=RECIPESEARCH", "created_utc": "1611725889.0", "edited": "False", "id": "gkx145e", "is_submitter": "False", "link_id": "t3_l5el4d", "parent_id": "t1_gkw1pmv", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "u/firelenze had success with this one. They posted it in the comments.\n\nhttps://www.williams-sonoma.com/recipe/sticky-toffee-pudding.html?cm_src=RECIPESEARCH", "created_utc": "1611725869.0", "edited": "False", "id": "gkx132y", "is_submitter": "False", "link_id": "t3_l5el4d", "parent_id": "t1_gkw7jbe", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "u/firelenze had success with this one. They posted it in the comments.\n\nhttps://www.williams-sonoma.com/recipe/sticky-toffee-pudding.html?cm_src=RECIPESEARCH", "created_utc": "1611725838.0", "edited": "False", "id": "gkx11gn", "is_submitter": "False", "link_id": "t3_l5el4d", "parent_id": "t1_gkw2ti0", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Seattle here, I'm down.", "created_utc": "1611472153.0", "edited": "False", "id": "gki8rm3", "is_submitter": "False", "link_id": "t3_l3idq4", "parent_id": "t1_gkhf2fb", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Oh my god. You all must suffer as I have suffered.\n\nhttps://i.redd.it/fjw93jfe5je51.jpg", "created_utc": "1611281533.0", "edited": "False", "id": "gk4qvgh", "is_submitter": "False", "link_id": "t3_l22jl1", "parent_id": "t1_gk4ch13", "score": "41", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "Neat! I love duck facts! Saw some loons last year for the first time and I was so excited. For over a decade I wanted to see and hear them without having to go out of state and I finally did.", "created_utc": "1610227363.0", "edited": "False", "id": "gip0uk4", "is_submitter": "False", "link_id": "t3_ktrz2a", "parent_id": "t1_giodmbh", "score": "1", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "petrichorgasm", "body": "Does it not need holes on the bottom for the runoff? Genuinely asking. I'd love to do this, but last time I used tin cans and drilled holes on the bottom for the water", "created_utc": "1610044549.0", "edited": "False", "id": "giga7zx", "is_submitter": "False", "link_id": "t3_kryiza", "parent_id": "t3_kryiza", "score": "2", "subreddit": "UrbanGardening", "subreddit_id": "t5_2vunn"}, {"author": "petrichorgasm", "body": "Definitely. I went through a bunch of different ones before I arrived at my products.", "created_utc": "1609572609.0", "edited": "False", "id": "ght4chy", "is_submitter": "False", "link_id": "t3_korcac", "parent_id": "t1_ghsv8u3", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I'll be happy to share my routine for you to get ideas.\n\nI turn 40 soon and I've been told I look much younger. Part of it is most likely genetic, but I've also been taking care of my skin since I was in my late teens. I wore sunscreen and limited my sun exposure since I grew up in Southern California. I live in Seattle now and the people I grew up there with have much more fine wrinkles than I do.\n\nI was sold on surgical interventions like Botox and fillers, but haven't needed to go there yet, and when I do, I have someone I trust; a perk of working in the medical field.\n\nMy routine is as follows:\n\nMorning: \n\n1. wash my hands, and then a splash of water on my face. That's it, to retain moisture. \n\n2. Then this:\nhttps://smile.amazon.com/dp/B01CLTKI4A/ref=cm_sw_r_cp_apa_fabc_1Jb8Fb1Q4BHA3 \n\n3. Followed by this:\nhttps://www.amazon.com/dp/B00STAV016?ref=ppx_pop_mob_ap_share\n\n- sunscreen for face. I use a lot of Asian sunscreen because they are thinner and I like the smell.\n\n\nBedtime:\n\n- Massage and tissue off:\nhttps://smile.amazon.com/dp/B00Q2BSSIW/ref=cm_sw_r_cp_apa_fabc_gMb8FbFJXBKRT\n\n- Foaming cleanser:\n\n(I got this at a shop in SoCal on a whim and it has replaced every face wash I've tried. I don't remember the name of the place, but it was an Asian grocery store. It's cheap and keeps my face moisturized without feeling gross. It moisturizes so well that sometimes I just wash with this and put on the Scinic honey ampoule when I'm tired)\n\nhttps://m.tsemporium.com/en_us/xproduct/index/index/s/4713968489010\n\n\n- Alternate between these two products nightly, applied with cosmetic round exfoliating side:\n\n https://smile.amazon.com/dp/B00OZ9WOD8/ref=cm_sw_r_cp_apa_fabc_qZb8Fb0JBQHF9\n\nhttps://smile.amazon.com/dp/B073P6ZQ4V/ref=cm_sw_r_cp_apa_fabc_d1b8FbJTJRN0M\n\n(I also use these on my neck and \"chicken skin\" upper arms. It's been great. Not completely gone, but it improved it a lot)\n\n- Wash your hands and wait 30m\n- Apply CosRX birch lotion from above\n- Apply Scinic honey ampoule from above.\n\nI put on masks once a week on the weekend, in the evening, after the aha/bha.\n\nHope that helps! My primary care doctor told me that until she looked at my chart, she thought I was ten years younger. Haha I'll take it.\n\nHope that helps. I just know the aha/bha is what we should be using now in late 30s/early 40s. I haven't had to tweak my routine in 2 years. I got a pimple from stress recently, but it was gone in two days and I can't even tell I had one.", "created_utc": "1609572331.0", "edited": "1609572521.0", "id": "ght41j5", "is_submitter": "False", "link_id": "t3_korcac", "parent_id": "t3_korcac", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Thank you for your kindness. I appreciate my patients, they are my social interaction so I don't get too stir crazy being locked in. \n\nWhen you're stuck in a hospital room and you can't see your family, I recognize that the hospital staff become like your crew. It can't be easy having strangers see you at your most vulnerable state. I try to remember that and leave my problems at home.", "created_utc": "1608772386.0", "edited": "False", "id": "ggurmmc", "is_submitter": "False", "link_id": "t3_kh2ad5", "parent_id": "t1_ggk49bu", "score": "2", "subreddit": "truechildfree", "subreddit_id": "t5_2uy7g"}, {"author": "petrichorgasm", "body": "Thank you! My birthday is in January and I'm turning 40. I love to bake so I will be baking myself a birthday cake and give myself a fancy dinner that I prepared for myself. Treat myself how I treat others is what my new motto. We healthcare workers give and give and need to be reminded to spend some of that compassion on ourselves. \n\nStay healthy ❤", "created_utc": "1608771728.0", "edited": "False", "id": "gguqexg", "is_submitter": "False", "link_id": "t3_kh2ad5", "parent_id": "t1_ggj8bt0", "score": "4", "subreddit": "truechildfree", "subreddit_id": "t5_2uy7g"}, {"author": "petrichorgasm", "body": "Thank you. It helps to read encouraging responses. \n\nYou're right about regaining the emotional space. It was so bad towards the end. I've decided that I will let myself feel all the feels and be kind to myself because this is a mourning.\n\nA good friend introduced me to the Shine app and meditation and it helps.\n\nThe quarantine also helped me control my eating!", "created_utc": "1608771416.0", "edited": "False", "id": "ggupu9z", "is_submitter": "False", "link_id": "t3_kgvqr2", "parent_id": "t1_ggnv6qu", "score": "2", "subreddit": "sewing", "subreddit_id": "t5_2sczp"}, {"author": "petrichorgasm", "body": "This is my first Christmas single, living alone. My family is scattered and there is a lockdown. I'll be working though. I'm essential, apparently. I'll be the best and happiest nursing assistant I can be.  Even though I'm heartbroken about a recent breakup, I have much to be thankful for this year.\n\nI want to bring joy into the hospital, not more sadness, you know? I'm lucky.", "created_utc": "1608503904.0", "edited": "False", "id": "ggiykcb", "is_submitter": "False", "link_id": "t3_kh2ad5", "parent_id": "t3_kh2ad5", "score": "48", "subreddit": "truechildfree", "subreddit_id": "t5_2uy7g"}, {"author": "petrichorgasm", "body": "That is a frickin cool frock! Thanks for sharing!", "created_utc": "1608499040.0", "edited": "False", "id": "ggioy93", "is_submitter": "False", "link_id": "t3_kgeqsi", "parent_id": "t3_kgeqsi", "score": "1", "subreddit": "sewing", "subreddit_id": "t5_2sczp"}, {"author": "petrichorgasm", "body": "I wrote your comment and u/ inside my actual diary because when I grow up, I wanna be just like you. You are #goals!\n\nActually, I've been having a difficult time and lost my confidence after two brutal breakups, but who isn't having a hard time rn, right? Thanks for your ray of sunshine. Your post gave me my perky back! No one can bring me down! You. Are. Everything.", "created_utc": "1608498937.0", "edited": "False", "id": "ggioqvc", "is_submitter": "False", "link_id": "t3_kgvqr2", "parent_id": "t1_gghpclf", "score": "121", "subreddit": "sewing", "subreddit_id": "t5_2sczp"}, {"author": "petrichorgasm", "body": "I dated a German dude who's hella into linguistics (super smart guy, that's what he did for fun). He once told me that Yiddish is a German dialect after I let loose with an \"Oy vey\" and his daughter asked what that meant.\n\nAt the time I was learning German too and knew some of the German words, like Schmutzig, Spiel, Mensch from the Yiddish I picked up from  being married once to someone with a Jewish background.", "created_utc": "1607462744.0", "edited": "1607462951.0", "id": "gf3gubn", "is_submitter": "False", "link_id": "t3_k911ib", "parent_id": "t1_gf2te2r", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Oh that sounds fun! The part where you said you want to take your knowledge and apply it to other fields and come up with applications. \n\nI feel like that with all the knowledge I have since I can't seem to stick with anything. \n\nI'm one of those who knows a little about a lot of things. I'm pretty lowly in my field (nursing assistant) and I notice that the combo of my hyperfocus, my time in it, all the classes I've taken for prereqs that I keep on having to retake because they expire, all help with on the field decision making. Little decisions though, like, who to escalate to, having more descriptive language to use, and how to be a good preceptor. \n\nAnyway, thanks.\n\nEta: I didn't mean I want to do CS, I don't think I have the brain for that, but what you said hit something :)", "created_utc": "1607461442.0", "edited": "False", "id": "gf3e2i8", "is_submitter": "False", "link_id": "t3_k954kl", "parent_id": "t1_gf3abyw", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "When I tell people math fascinates me, I get asked \"Why?!\", accompanied with a face reserved for when they encounter roadkill\n\nBut my answer seems to make them think and that is, because it's the same in every language and for the most part, there's a solution.\n\nI'm actually terrible at math. Somehow my long term memory doesn't apply to it. I can never get higher than a C and can't go past algebra. I did use to hate math until I had 3 teachers subsequently, all for algebra, who were so patient with me that I realized the above. The last one, I had just been diagnosed with adult adhd and I asked him if he had any study tips for students with it. He was a brilliant and welcoming teacher, so I felt comfortable asking that. He said not really and he said good luck, BUT, for the final, he staggered the students' seating and specifically placed me to sit facing the blackboard with only one student kitty corner to me. I didn't realize it until years later and it dawned on me that he probably researched it after I talked to him.\n\nAnyway, yeah, math rules and I need to take my adhd meds now.", "created_utc": "1607460715.0", "edited": "False", "id": "gf3ci37", "is_submitter": "False", "link_id": "t3_k954kl", "parent_id": "t1_gf35czu", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "\"I know you can polish a German, but can you ever just...German a polish?\"\n\n\"I think you can in Europe\"", "created_utc": "1606668410.0", "edited": "False", "id": "ge1x63o", "is_submitter": "False", "link_id": "t3_k36rn0", "parent_id": "t1_ge1hnzi", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "petrichorgasm", "body": "Haha, yes it did 🤣", "created_utc": "1606552869.0", "edited": "False", "id": "gdul701", "is_submitter": "False", "link_id": "t3_k0sqey", "parent_id": "t1_gdo3p58", "score": "1", "subreddit": "BuyItForLife", "subreddit_id": "t5_2ss1q"}, {"author": "petrichorgasm", "body": "You're not selfish. Pictures are memories and without our memories, we're left without a sense of wholeness. \n\nTake care of your mother and do remember to take care of yourself. I'm a nursing assistant in a major hospital and have seen a lot. I've taken pictures for parents with preemie babies, parents with their firstborn, pictures of dying family members, pictures of survivors, and I've also gotten my picture taken when a family member survived a quadruple bypass. I know what the pictures mean and I don't think that you are taking it for selfish reasons. It sounds like your mom understands that. \n\nIt also helps me to understand why my mom wants so many pictures. She has major anxiety and she is fearful that we will forget her. Sometimes it's annoying, I have my moments where I don't want to be photographed, but even when I'm not feeling pretty, I do it for my mom, if only to ease her anxiety.\n\nAlso, for you, it's okay to get away and take a break. Try not to get to the point of caregiver burnout. It's very very hard to recover from that. I'm speaking from personal experience and field experience.", "created_utc": "1606336957.0", "edited": "False", "id": "gdl96wl", "is_submitter": "False", "link_id": "t3_k0rc3a", "parent_id": "t3_k0rc3a", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "petrichorgasm", "body": "I never thought about it this way. My ex husband called me spoiled when we were dating and he saw that I have a Louis Vuitton wallet in college. We were music students in the early 00s...that should tell you how much money we had haha, La Boheme and all that jazz. He had the audacity to ask if it was real! \n\nLater I explained to him that it's not that I'm a snob, I would not have bought that on my own at that time. It was a birthday present from my Aunt. Two of my aunts are comfortably wealthy, not super wealthy, but they're good with money, or at least my uncles are and they followed suit. I kind of just absorbed their mentality throughout my formative years that even though you are \"poor\", don't settle for cheap shit, go without until you can get the best for your money. \n\nOne thing too though, this way of thinking works best when you have a partner (if you're partnered) who either understands or follows the same philosophy. It's shit if you see money differently. I've dated since then and while my ex husband gets it (we're simply friends now), one of my ex boyfriends takes it to the extreme, to the point that I just couldn't see myself with him with our attitudes about money being not quite matching up. Then, another ex bf, like, damn, brotha let your wallet breathe.\n\nI'm single now and it's great to be able to control my spending and hold off until I find quality.", "created_utc": "1606336310.0", "edited": "False", "id": "gdl7xgf", "is_submitter": "False", "link_id": "t3_k0sqey", "parent_id": "t3_k0sqey", "score": "3", "subreddit": "BuyItForLife", "subreddit_id": "t5_2ss1q"}, {"author": "petrichorgasm", "body": "I was given a Kenmore sewing machine for Christmas 5ish years ago by my former MIL who is a commercial seamstress. While there are many things that I would side-eye her on, this baby is still running on its original things. I've sewn fleece, denim, and everything in between. Not yet ventured into leather, but I do have the needle for it. \n\nAll I've had to do is change the needle to suit the fabric and it's good to go. It's a plastic body, but, everything I've sewn has held up, as has the machine. I don't mend with it, I mend things by hand, so this thing gets used for my original, self-drafted things.\n\nI do see great machines at the thriftstore. Still kicking myself for not buying that Babylock, but my justification was that I already have a machine that suits my needs at home.", "created_utc": "1606335527.0", "edited": "False", "id": "gdl6fd4", "is_submitter": "False", "link_id": "t3_k0sqey", "parent_id": "t1_gdkuo7d", "score": "8", "subreddit": "BuyItForLife", "subreddit_id": "t5_2ss1q"}, {"author": "petrichorgasm", "body": "Fellow Seattleite in the same boat, giving you good vibes. I work in one of the hospitals downtown and addition to being alone, I get the extra paranoia of catching covid too. Luckily, this time around, PPE won't be as much if a problem.\n\n\nThank you for isolating! The covid unit in my hospital is open again and I'm bracing myself when they overrun into the other units with reverse-flow capabilities. I'm so sorry you're alone, just know somewhere in the city, I am doing the same and we're in it together (you can dm me if you're curious where I am)\n\nI usually am the baker. Over the summer, my exbf (who JUST broke up with me whom I also love with all my heart...I'm gonna try not to cry...again...) got me a KitchenAid bowl-lift stand up mixer and I was SO excited to use it for the holidays. But there's no one to bake for.\n\nI commiserate with you, sister!\n\nE: If you'd like to meet for a social distance chat or something on Thanksgiving this week (5 people outdoors is ok according to the rules), dm me for that too. The weather is cold, but sunny.  \n\nIt'll give me an excuse to use Chrissy Teigen (that's what I named my KitchenAid) and bake something. No pressure, just an offer. Truthfully, while I enjoy my solace, meeting new people would be nice.", "created_utc": "1606183036.0", "edited": "1606183475.0", "id": "gde9qre", "is_submitter": "False", "link_id": "t3_jzrxup", "parent_id": "t3_jzrxup", "score": "4", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Ah, that makes sense. They drill into us the branding. \n\nAs for the milk, I have this one:\nhttps://smile.amazon.com/dp/B07PZZTS6W/ref=cm_sw_r_cp_apa_fabc_7hzPFbY6GKGB7\n\n\n\nI like to steam milk with the espresso machine (when I had it) because the milk makes a certain sound that my ears are attuned to when it's frothing properly. Not being a snob, it's just what my brain did when I was being trained. I also sing, so that's probably why I latched on to the sound.", "created_utc": "1604686729.0", "edited": "False", "id": "gbdck19", "is_submitter": "False", "link_id": "t3_jnp6iv", "parent_id": "t1_gbd6w5l", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "No worries with soy misto. It's café au lait and that one you can make at home too if you want, with steamed milk, no foam required. This isn't really trade secrets, they have descriptions on their websites. \n\nFun fact, if you write/email them compliments or complaints, Starbucks will respond. They employ people who go through each and every one sent in. \n\nAt least that was how it was when I was a Barista. My biggest regret is not buying their stocks at discounted prices as an employee. They let you do that.", "created_utc": "1604683202.0", "edited": "False", "id": "gbd4w0u", "is_submitter": "False", "link_id": "t3_jnp6iv", "parent_id": "t1_gbcye1i", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "It's a grinder that grinds more evenly, extracting the coffee better.", "created_utc": "1604648798.0", "edited": "False", "id": "gbbp9qw", "is_submitter": "False", "link_id": "t3_jnp6iv", "parent_id": "t1_gb4tjmb", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Me too! My German boyfriend's mother introduced me to the pourover last year (he doesn't drink coffee, so, more for me, yay). I haven't looked back. So quick, so good. I don't drink more than a cup a day and it works for me. I just put half and and and some brown sugar and I'm good to go.\n\nMelitta brand filters, of course. Before this, I was way into the French Press. But the pourover is my new favorite. So easy to clean!", "created_utc": "1604648397.0", "edited": "False", "id": "gbbotac", "is_submitter": "False", "link_id": "t3_jnp6iv", "parent_id": "t1_gb3ay9g", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I'm a big fan of the pourover, since it's just for me. My boyfriend doesn't drink coffee. I heat up filtered water in an electric kettle and pour that over cone shaped pourover mug lined with a cone filter, with my mug underneath. Right now I'm too busy to get whole bean and grind them myself, so, ground is my go-to. I'm not as much a coffee snob as I used to be. \n\n\nSometimes I do my own cold brew too. I use it for iced coffee or blend it with ice, half and half or ice cream, and a little bit of xantham gum. Xanthan gum makes it like the coffee shops'.\n\n\nI was a Starbucks Barista back in the day. I don't know how they train the baristas now, but it was very detailed when I was trained. I'm in Seattle, maybe it was more detailed here. I went to coffee classes, they trained me in tastings (like a sommelier, but with the different roasts and tea), and if there were downtime, we were encouraged to come up with different drinks that could be presented to corporate. I didn't come up with anything, but found how I like my green tea Frappuccino.  Although, I don't drink that anymore. I reduced my sugar intake and no matter what, it's still too sweet now. \n\n\nSome of my friends worked in coffee shops with people really passionate about their coffee. I used to have my own espresso machine, but the ex-husband got that now. I was all about the French press, but there's so many parts to clean properly with that too. Someday I'll get my own espresso machine again. The only thing I didn't learn was how to make the foam designs. But I do know how to make tasty foam and the cross-hatch of caramel. Oh, and their whipped cream.\n\nThere's a lot of sugar in their drinks, y'all. Don't have it every day.", "created_utc": "1604647746.0", "edited": "False", "id": "gbbo2k1", "is_submitter": "False", "link_id": "t3_jnp6iv", "parent_id": "t3_jnp6iv", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Movies: Made of Honor, Legends of the Fall, Amadeus, Robin Hood: Men in Tights, 10 Things I Hate About You,  Legally Blonde\n\nShow: Schitts's Creek, Gilmore Girls, Mad Men", "created_utc": "1604644439.0", "edited": "False", "id": "gbbk2fx", "is_submitter": "False", "link_id": "t3_jovops", "parent_id": "t3_jovops", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Same!!!! Oh god, you've made me feel so much better about myself", "created_utc": "1597539207.0", "edited": "False", "id": "g1os4dx", "is_submitter": "False", "link_id": "t3_ia7odn", "parent_id": "t1_g1m36d9", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "I'm a Certified Nursing Assistant with a lot of experience than others I've worked with. I've done intensive/critical care (my favorites, I almost graduated with a Respiratory Therapy degree, but a long time ago), long term acute care, rehab, elderly care, and Labor & Delivery. \n\nLast Summer, I went to Northern Germany, loved being there, and want to go back after seeing that there was a facility near where I want to be. When I came back to the US, I started learning German, formally and with the guidance of my German boyfriend and his 10 yo who is still learning German too. He thinks I have very little chance to move there without him, but I found two listings, one for the facility I saw, and one for another company that's a religious organization. Those listings both mention what sounds like they will help me get settled, pay for me to learn German, and help me to find an apartment. \n\n\nI have read that my German would have to be at a certain level, so, I won't move  just yet.\n\nHow legit is something like that? What are the chances that I have since I'm considered to be \"third country national\"? Currently, I'm an American permanent resident. I don't have a degree, but have experience and have some college. Will I be able to survive there? Can I do a short term of maybe a year or two, and then decide after that has passed?\n\nThank you in advance.", "created_utc": "1597538015.0", "edited": "False", "id": "g1ooavu", "is_submitter": "False", "link_id": "t3_ia5oxr", "parent_id": "t3_ia5oxr", "score": "1", "subreddit": "IAmA", "subreddit_id": "t5_2qzb6"}, {"author": "petrichorgasm", "body": "Aww, I remember kissing like that. It's the best feeling.", "created_utc": "1597536376.0", "edited": "False", "id": "g1oix2n", "is_submitter": "False", "link_id": "t3_ia8r2v", "parent_id": "t1_g1n7455", "score": "12", "subreddit": "OldSchoolCool", "subreddit_id": "t5_2tycb"}, {"author": "petrichorgasm", "body": "American here. I feel you. My annual trip to Germany is indefinitely postponed.", "created_utc": "1596230652.0", "edited": "False", "id": "fzwyuzj", "is_submitter": "False", "link_id": "t3_i1aa0m", "parent_id": "t1_fzwchkf", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Tl; dr today I would be flying to Frankfurt, then Hannover, to spend a good almost 3 weeks in Northern Germany, visiting people I love, making use of and improving my knowledge of the German language and *really* relaxing.  \n\n\nThis would have been the first paid vacation I've had my entire life. In the past, I would just take it because of being burned out and eat the costs. \n\n\nI requested a vacation back in January because in healthcare, we have what's called \"prime time\", meaning you need to request summertime off in January/Feb, or March as a last resort. If you request it in March, it would be first come first serve.\n\nI was lucky in that I knew when my Germany trip was going to be, so I requested the time off as soon as January 1st hit.\n\nBut then Covid happened, I had to move out of where I was living because I lived with 80 year olds, I moved in with my boyfriend where things got worse and he got bored of me, I was going to work and coming home so burned out and my boyfriend couldn't be bothered to microwave me dinner after 12 hours of me being on shift with Covid positive patients.\n\n\nDespite everything, I see Covid as sort of a blessing. It made me stop and appreciate myself, my abilities, and how the love I give is just as worthy and anyone's. \n\n\nI could wish that Covid never happened, but tbh, I needed to be busy and stop overthinking. My anxiety is not as bad as it used to be, and while I am so, so very sad that I didn't get to go to Germany, I feel grateful that I have a job that I can be proud of at the end of the day. I see that I make a difference in people's lives, in my work I see the care I feel for other people that sometimes is missing in other caregivers, nurses, doctors, administrators. \n\nWorking during Covid has helped me see that I'm not as bad a person as I tell myself and if my boyfriend doesn't see my worth, then that's not on me. Just because he has a PhD in CS, working for a giant company that everyone and their mother knows about, while I'm just a lowly certified nursing assistant trying to get by, it doesn't make him better than me, it doesn't make me weak.\n\nThis pandemic is shit. Especially if you're in healthcare, but, I will take the lessons.", "created_utc": "1596230472.0", "edited": "False", "id": "fzwy8qc", "is_submitter": "False", "link_id": "t3_i1aa0m", "parent_id": "t3_i1aa0m", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I'm sorry. Hopefully you get one soon", "created_utc": "1594521556.0", "edited": "False", "id": "fxseh1j", "is_submitter": "False", "link_id": "t3_hpda60", "parent_id": "t1_fxrgn3f", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I'm so happy you persevered! It does make a difference, doesn't it. My doctor said I was like a new person when I had my follow up. He was right! I felt so much better. \n\nI had a take home sleep study and I have 20+ interruptions an hour! No wonder!", "created_utc": "1594521513.0", "edited": "False", "id": "fxsed92", "is_submitter": "False", "link_id": "t3_hpda60", "parent_id": "t1_fxqvr3h", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Correct. I have a short neck 😞", "created_utc": "1594521327.0", "edited": "False", "id": "fxsdvc8", "is_submitter": "False", "link_id": "t3_hpda60", "parent_id": "t1_fxqp2hs", "score": "1", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Was about to suggest this. I'm a CNA who studied Respiratory Therapy. If it wasn't for RT school, I wouldn't have had my sleep study. Turns out I have sleep apnea. I got a cpap, lost a bunch of weight trying to not need ot anymore. Lost the weight, still have the CPAP. My sleep doctor said it's my anatomy.\n\nGet the sleep study done. The trick to a CPAP is to find a mask that works for you; that is, fits you well, and makes you fall asleep within a few minutes. I have the hybrid and it's working. My ex husband has the nasal and he loves it \n\nPlease don't give up if it turns out you need a CPAP. Find a mask that works for you, find a pressure that works for you. Advocate for yourself.  Sleep is one of my interests. Today's CPAPs will relay the information of the amount of pressure you need to keep your airway open. It will save your life and your sleep quality will improve immensely. \n\nI have patients who adamantly refuse to wear them and it's heartbreaking. No one ever tells CPAP needers the info they need and when I was in school, that was one of my goals. To get more patients to take their sleep apnea more seriously. They used to make masks that even claustrophobic patients love, but, idk what the equivalent of that is today.", "created_utc": "1594490239.0", "edited": "False", "id": "fxppzs7", "is_submitter": "False", "link_id": "t3_hpda60", "parent_id": "t1_fxpjl02", "score": "17", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Thank you for your encouragement. I would welcome advice if you have any, but it's not required. You've encouraged me a lot. My eyes got misty reading it. I have no one to talk to, he's not a talky guy, more so lately, and I'm not into therapy right now. I will find a therapist, and I'm adamant about having one that matches.\n\n\nI've applied for an apartment. They are hard to come by at my budget and area so it's been a difficult search. Right now I'm sitting in his dining room after fulfilling my promise of binge watching Steven Universe with his daughter.\n\nMy heart is broken and carved out. I feel hollow. But, if he doesn't want me here, I don't want to be where I'm not wanted. Idk what the future holds, but I'll keep on walking forward. Baby steps until apprehension is finished with me. I can't rush healing, unfortunately", "created_utc": "1594440613.0", "edited": "False", "id": "fxlqtd2", "is_submitter": "False", "link_id": "t3_hogn61", "parent_id": "t1_fxk09zf", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Tl;dr someone being a good father is not indicative of being a good partner.\n\nIam having a hard time at the moment with my person and something hit me recently. He has two really precocious, deeply intelligent and thinky children. I love them to the ends of the earth. Yeah, they didn't come out of me, it's that my love for their father naturally extends to them. They're good kids. I know my role is not to be a stepmom, since I'm only the girlfriend, and I'm not trying to be, my role, as I understand, is to be there for them, praise when praise is warranted, and support when they are needing it.\n\n\nI'm glad this is where I am with them. But, this year, it feels like the closer I bond with them, the further away he pulls. I cry almost every week, but that's another story.\n\n\nMy boyfriend tries his very best at being a single parent. I won't go into details, just that he's divorced. The kids adore him and I can see they are very secure with him. \n\n\nHe is a very good dad, but he's not a very good partner. That's something that blew my mind when I realized it today, sitting in my car at the parking lot near his house because I was so drained at all the emotional labor I was expending.\n\n\nI admire his tenacity, steadfastness, intelligence, nurture towards his children and everybody else. I see it and only now did I realize he has none left for me. He used to warn me that he's not an affectionate guy, but he will  try harder with me.\n\n\nHe's affectionate to the children, as he should be. Now that he's working from home, I notice he's supportive and nurturing when I hear him talk to his intern who was just starting out. Very fatherly.\n\nBut with me, he just doesn't pay attention. I've tried bringing it up in all manners of emotion, but it's as if I'm not important.\n\n\nI moved in after 2 years of dating. The children are here together for the Summer and now he wants me to move out.\n\n\nThere's other details, but, I'm not asking for advice, just sharing my own experience. I recognize that ymmv", "created_utc": "1594394334.0", "edited": "False", "id": "fxjduqq", "is_submitter": "False", "link_id": "t3_hogn61", "parent_id": "t1_fxi0omy", "score": "6", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "I tell my patients that when they make it out, to write a book about how they survived the pandemic. The first patient I had who was so young, 20s-30s, it was surprising because at that point, it was still being touted that people under 40 was ok. Seeing that patient really made me stop in my tracks and realize ANYONE can and will get it. \n\nYou're right, I do tell my patients to tell everyone about what they experience because they're in a unique position as a patient during a worldwide pandemic.", "created_utc": "1593803281.0", "edited": "False", "id": "fwtypu0", "is_submitter": "False", "link_id": "t3_hkh677", "parent_id": "t1_fwtuw3k", "score": "11", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "petrichorgasm", "body": "CNA who also works on Covid unit. I felt the burnout, I feel you so hard. If you get to do self-scheduling, schedule yourself for two days in a row only. That's what I ended up doing. Give yourself 3 days off in row. It helped me so much. Focus on that when the next schedule sign ups are announced.\n\n\nWe need to stay healthy as long as we can, for ourselves first. We're the hope, we have the training, this is it. Hang in there, limit social media, seek out that hilarious coworker to work with (it's me, I've been in this for 20+ years and I try to encourage my nurses) and take ALL your breaks. You can do this. Look out for each other. My bond with my nurses have strengthened so much because of working among Covid. You can do this.", "created_utc": "1593802858.0", "edited": "False", "id": "fwtxxaj", "is_submitter": "False", "link_id": "t3_hkh677", "parent_id": "t1_fwtruam", "score": "3", "subreddit": "worldnews", "subreddit_id": "t5_2qh13"}, {"author": "petrichorgasm", "body": "I'm dating the one software engineer who's not into coffee. I keep forgetting and makes mornings awkward. He knows why Java is called Java, though. He calls it the language that he uses at work and the island that gave the world me 😊", "created_utc": "1593536270.0", "edited": "False", "id": "fwhq69s", "is_submitter": "False", "link_id": "t3_himsju", "parent_id": "t1_fwh56jg", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Aww, danke schön, your comment makes me smile too. \n\n\nBeing in Germany taught me so much. It will sound so cheesy if I write them all down and tell the internet. \n\n\nMaybe having people I love being German had a lot to do with me learning so much, and feeling welcomed, but I don't mind, that reason is as good as any. It wasn't just his family who treated me well, the whole experience, the interactions I had, participating in the day to day, the times I had were positive. I can't really explain it. It made enough of a mark that I want to be there too.\n\nEdit: and omg, your user name. Die Erdbeere Kuchen made from die Erdbeeren grown in the next village....that alone can make me come back", "created_utc": "1592263961.0", "edited": "1592264179.0", "id": "fuyfzxh", "is_submitter": "False", "link_id": "t3_gygpg9", "parent_id": "t1_ftol0r1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "That right now my mind is mostly at peace after battling a lot of hardship.\n\nI'm learning a lot about myself right now and am in a mostly healthy place.\n\nThanks for the question. Gave me a lot to think about.", "created_utc": "1591654839.0", "edited": "False", "id": "ftez6tx", "is_submitter": "False", "link_id": "t3_gz7dyv", "parent_id": "t3_gz7dyv", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "It seems that people who move to Germany regard it as mostly a positive move. I was in Niedersachsen last year, got to hang out in Berlin. All the places I visited, I was impressed with. Didn't see any castles, but learned a lot anyway. \n\n\nWhen I came back, I decided to take German class, fell in love with the language, and have wanted to go back. I don't know when I can go, for obvious reasons, I guess we'll know more later this month.\n\n\nI have a lot of German influences here (usa), my boyfriend speaks English and German to his children, anyone in his family, but speaks English to me. I'm catching on quickly and have peppered German phrases into my daily life. I can't wait to learn more! \n\n\nI've talked to him about life there, how he grew up, what his views on life there vs. here are. He's pretty set right now, he has an excellent career in a field that he's passionate about. His parents are back in Germany, my meeting them last year was a success.\n\n\nWe probably won't get married, we've both been married before, so shelf that idea, but I do want to move to Germany. I've told him this, so it's not like he doesn't know. I found out I'm also an essential worker in Germany (nursing assistant, unit secretary) and have found one promising posting, but I still need to grasp the language. I would love to live there, doing whatever. It was very different and very refreshing. I feel I can be happy there and would be more appreciated.", "created_utc": "1591653936.0", "edited": "False", "id": "ftexgvg", "is_submitter": "False", "link_id": "t3_gygpg9", "parent_id": "t1_ftcb3bs", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Fresh bread always gets an upvote from me; fresh German bread gets an upvote and a goofy nostalgic smile.\n\nI can't wait until I get to go there again. Brötchen is life.\n\nFunny enough, this morning I was looking at pictures of the Black Forest!", "created_utc": "1587844080.0", "edited": "False", "id": "fokl3hd", "is_submitter": "False", "link_id": "t3_g7rti7", "parent_id": "t3_g7rti7", "score": "3", "subreddit": "Breadit", "subreddit_id": "t5_2s8h0"}, {"author": "petrichorgasm", "body": "As a healthcare worker in a major city, how is this flagpole talking?", "created_utc": "1585858095.0", "edited": "False", "id": "fm8xz0x", "is_submitter": "False", "link_id": "t3_fto2om", "parent_id": "t1_fm8ww0b", "score": "43", "subreddit": "Jokes", "subreddit_id": "t5_2qh72"}, {"author": "petrichorgasm", "body": "Dating a German-born German dude at the mo. I'm Indonesian-born, we both live in the United States. He took me to Germany last summer; unspokenly, I would also be meeting his parents and the rest of the fambam in his village.\n\nIt's not so much shock, as it is pleasantly surprising. His mother and father are so warm, kind, and affectionate! So were his cousins. I was greeted with hugs and cheek kisses by family.\n\n\nEveryone in the village greeted me warmly, and in perfect English, when I walk by with his daughter in the evenings.  \n\n\nI'm embarrassed to say that I thought they would be stereotypical cold and strict. The one thing my boyfriend does that's different is that he is silent af during mealtimes. His dad talks and talks and talks. I asked his parents about my bf when he was little, apparently he was a quiet kid, just like his grandfather. \n\n\nI was worried about being accosted with racism, as according to bf, I was the first Asian to come into the village. This wasn't a place down in the South, it was a tiny village in Niedersachsen. When we first started dating, I had no idea where it was since all my knowledge of Germany centered around Bavaria and the surrounding area. \n\n\nHowever, I did get my share of people doing a double take. We went to an ice cream cafe and there was a couple at the next table who kept craning their neck to look at me out of curiosity. I think it's more that I spoke American English than my looks. This part of Germany was where the Brits were stationed. Even his father has a very melodic British accent. Oh, and their version of German is so soft and warm!", "created_utc": "1585789905.0", "edited": "False", "id": "fm6aovb", "is_submitter": "False", "link_id": "t3_ft3fv7", "parent_id": "t3_ft3fv7", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Fuck, this is lovely.", "created_utc": "1585320559.0", "edited": "False", "id": "flnkljw", "is_submitter": "False", "link_id": "t3_fp9qeu", "parent_id": "t1_fllqkki", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "My boyfriend is the smartest person I know and have ever met. He's a software engineer. I found out last summer from his dad that my bf skipped two grades back home in Germany. I can see that. \n\nHe's sweet and kind, good to his kids, focused, all that. He makes me happy and I like to think I do the same for him. \n\nHe's working from home right now, as they do. I work in a hospital and he sent me lunch. I like that he tells me he's proud of me for being on the front lines. Usually I'm the one who heaps him with compliments. Really great guy. I'm the hyper to his quiet.", "created_utc": "1584572010.0", "edited": "False", "id": "fkvm3da", "is_submitter": "False", "link_id": "t3_fkewdz", "parent_id": "t3_fkewdz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Thank you, you're sweet. There's so much uncertainty everywhere right now, I'm happy being one that can make some difference. Means a lot to be thanked", "created_utc": "1584567677.0", "edited": "False", "id": "fkvenm5", "is_submitter": "False", "link_id": "t3_fikj64", "parent_id": "t1_fkjf8g5", "score": "1", "subreddit": "knitting", "subreddit_id": "t5_2qiu0"}, {"author": "petrichorgasm", "body": "The German cake Erdbeere Kuchen has my heart forever. Puzzling that the one I got at the mall in Germany was as good as the one I got in a village bakery.\n\nI like strawberries. That's it.", "created_utc": "1583121641.0", "edited": "False", "id": "fj8ta14", "is_submitter": "False", "link_id": "t3_fc4t7i", "parent_id": "t3_fc4t7i", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I'd be really popular in Seattle", "created_utc": "1582752541.0", "edited": "False", "id": "fiv2bas", "is_submitter": "False", "link_id": "t3_f9x48u", "parent_id": "t3_f9x48u", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "German. Es ist schwierig and my boyfriend would be soooo surprised if I suddenly became fluent.\n\nGoing back to Germany this August. Woo!", "created_utc": "1582752070.0", "edited": "False", "id": "fiv1ew6", "is_submitter": "False", "link_id": "t3_f9ubst", "parent_id": "t3_f9ubst", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Yup. Mine is only one experience, but I've read that others have had either similar ones or have had similar difficulties obtaining diagnosis and meds.", "created_utc": "1576676524.0", "edited": "False", "id": "fbafabb", "is_submitter": "False", "link_id": "t3_ec67n8", "parent_id": "t1_fbaevfg", "score": "5", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "My medicated is your normal...bingo!", "created_utc": "1576668241.0", "edited": "False", "id": "fba7b9t", "is_submitter": "False", "link_id": "t3_ec67n8", "parent_id": "t1_fb9p2ch", "score": "12", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "I would have snapped too. I wasn't diagnosed until my mid 30s and didn't realize how difficult it was to get. The first few months were a nightmare! The looks that pharmacists would give me, the driving from one pharmacy to another because more often than not, the pharmacy wouldn't have my adderall in stock, and of course, I can't call them because they are all legitimately afraid of being robbed.\n\nMan, I just want to live my life, get things done, and have a clean and organized living space like normal people. That's it. I didn't ask to have ADHD-PI. Then we have people like that who doesn't think it's that big of a deal.\n\nAfter months of that nonsense, I got wise and dealt with the condescension accordingly. It was on this forum where someone said something that changed my life, something along the lines of it's not my concern what everyone else is doing. At the end of the day, this medication is something that I need to take for my own well being. That's it. \n\n\nHelped me a lot. I got tired of being looked at like I'm a suburban fiend.", "created_utc": "1576668067.0", "edited": "False", "id": "fba76ni", "is_submitter": "False", "link_id": "t3_ec67n8", "parent_id": "t1_fb9l6dy", "score": "45", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "I have friends and coworkers with T1D and they too have it managed to the point that the people around them notices. In college, I was studying vocal performance and my classmate had a pump that none of us knew about until almost a year in. That classmate is now a voice teacher/opera singer. She's in her mid 30s.\n\n\nNow I work in a hospital and one of the nurses has a pump that I didn't know about until almost two years of working together and  she was checking it during one of our breaks. She's in her late 20s.\n\n\nRecently, I dated a guy who also has a pump and sensor connected to an app on his phone. If he's low or what have you, he brings up the app and takes care of it right then and there. He's almost 50 and is successful in his field.\n\n\nMy point is, all these people I know are still living their best life. Your kid will too. I'm so sorry about all this hardship. Your kid has great parents. You're doing it right. It may feel like you're not, but you are. I work with sick children and adults. I know what care and support looks like. You're doing it and that's how I know your child will make it through this to live and love for a long time in her new normal.", "created_utc": "1572623563.0", "edited": "False", "id": "f60qe64", "is_submitter": "False", "link_id": "t3_dpzhm1", "parent_id": "t3_dpzhm1", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "petrichorgasm", "body": "I live in the US, but my part of the US would probably have it somewhere because it sounds like something people here would do.\n\nE: no diary slam, but maybe I should start it!", "created_utc": "1570457331.0", "edited": "False", "id": "f2vtvew", "is_submitter": "False", "link_id": "t3_dedyzu", "parent_id": "t1_f2vr4mt", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "It just happened. We were really good friends before we were married. There were never really any hatred towards the other. I resented him for things and I'm sure he had his reasons, I just can't recall them and it doesn't matter.\n\n\nWhen we were breaking up, we were still supportive of each other. We both had to accept that both of us having ADHD is the downfall. I have my reasons for that and my side of the story, but that's what it boiled down to. Some couples can, we couldn't. The sex was part of the reason too, but like I said, that was a symptom.\n\n\nI had to let go of a lot of that resentment. I still love him, I will never stop loving him, we just can't be together. My boyfriend knows my ex and I hang out. Our sexlessness extend to our friendship. I have no interest in having sex with my ex, he's just a very good friend.", "created_utc": "1570457159.0", "edited": "False", "id": "f2vtee7", "is_submitter": "False", "link_id": "t3_ddeqtm", "parent_id": "t1_f2txips", "score": "3", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "I was going to throw away my diaries, but nevermind. Tagebuch slam sounds like a party, especially with grownups who fancied ourselves artists...oh the cringe.", "created_utc": "1570456220.0", "edited": "False", "id": "f2vqt5a", "is_submitter": "False", "link_id": "t3_dedyzu", "parent_id": "t1_f2uzr2c", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Diary writer here. I've been contemplating throwing away my diaries because the last time I went through them, nothing was really of importance. Who cares if today I didn't get to watch Power Rangers?", "created_utc": "1570455982.0", "edited": "False", "id": "f2vq5h9", "is_submitter": "False", "link_id": "t3_dedyzu", "parent_id": "t1_f2uw360", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I'm better, thank you for asking. It was hard and the most pain I have ever experienced. I didn't want to leave, but at that point, there was nothing else I could have done because it was a symptom of greater problems.\n\nWe're still very good friends. He's going through his thing, I'm going through my thing. I have a wonderful boyfriend who is understanding of my ADHD and I feel like I can control my life now.", "created_utc": "1570399851.0", "edited": "False", "id": "f2tsi7s", "is_submitter": "False", "link_id": "t3_ddeqtm", "parent_id": "t1_f2jvagw", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "I've felt this. I get it. Keep going. I've only recently gotten out of the hardest parts and it's true, it does get the hardest right before it gets better. So, if you feel you can't anymore, that's when it will be better. Let that discomfort course through you because once you get out of it, God. Damn. It feels so very good.", "created_utc": "1570399443.0", "edited": "False", "id": "f2trl38", "is_submitter": "False", "link_id": "t3_ddja8a", "parent_id": "t1_f2mimxi", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "I appreciate you for saying that. He and I have mutual friends and in our group, he is the perfect friend, never cruel, never cold like he was when I am having problems being overwhelmed. So, in trying to get over him, I feel gaslit all the time.\n\nSo, thank you. Your observation has helped me get one step further today.", "created_utc": "1570399283.0", "edited": "False", "id": "f2trcfp", "is_submitter": "False", "link_id": "t3_ddg2yh", "parent_id": "t1_f2slzil", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Oh gosh, I do this so often that now when I'm talking, I can trace my thoughts as I'm talking to go back to the main point instead of saying, \"Wait...how did I get here?\"\nand sounding like I'm not paying attn", "created_utc": "1570278141.0", "edited": "False", "id": "f2jva1v", "is_submitter": "False", "link_id": "t3_ddk08a", "parent_id": "t1_f2irsi9", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "When my meds are leaving my bloodstream (I'm on IR), I stutter and made-up, nonsensical words escape my face hole. You're not alone.\n\nI'm better now at staying quiet and ignoring my impulse to be heard no matter how important my input is because it's embarrassing when my brain works faster than my mouth. I don't make sense and tend to ramble.", "created_utc": "1570277993.0", "edited": "False", "id": "f2juykr", "is_submitter": "False", "link_id": "t3_ddk08a", "parent_id": "t3_ddk08a", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "\"On paper I'm articulate and intelligent, in person I'm a bumbling idiot.\"\n\nOh, hi, I see we share the same brain.\n\nI veer r/iamverysmart which isn't cute when one is not a precocious child. Writing things unmedicated for the free flow jumble and rewriting medicated works well.", "created_utc": "1570277770.0", "edited": "False", "id": "f2juge6", "is_submitter": "False", "link_id": "t3_ddk08a", "parent_id": "t1_f2jinma", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Good on the detox! I just want to second that LA Ritalin did nothing, absolutely nothing for me. Once you're fully detoxed, try again. It's worth finding the sweet spot of dosage and type.", "created_utc": "1570277518.0", "edited": "False", "id": "f2jti4v", "is_submitter": "False", "link_id": "t3_ddkh0u", "parent_id": "t3_ddkh0u", "score": "2", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Yup. Ended my marriage.", "created_utc": "1570277266.0", "edited": "False", "id": "f2jsva9", "is_submitter": "False", "link_id": "t3_ddeqtm", "parent_id": "t1_f2hi0pu", "score": "3", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "There was a study done but I'm sorry I'm too distracted to post it. Short answer, yes. \n\nCertainly is true from my experiences. Sometimes it feels like I'll never be satisfied. But I accept not everyone is me and I choose my partner every day over this.", "created_utc": "1570277241.0", "edited": "False", "id": "f2jst75", "is_submitter": "False", "link_id": "t3_ddeqtm", "parent_id": "t3_ddeqtm", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Thank you. These damn apps do nothing since I have to look at my phone...with it's myriad of distractions", "created_utc": "1570276269.0", "edited": "False", "id": "f2jqklc", "is_submitter": "False", "link_id": "t3_ddjw08", "parent_id": "t1_f2jcn94", "score": "5", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "\"No one is as excited as you are\" is my theme.\n\n\nI embrace it as much as I can, but there are days when like someone here says, \"I just want a boring, basic life.\" \n\n\nBecause sometimes that excitement leads to nowhere because, surprise, I get distracted", "created_utc": "1570275709.0", "edited": "False", "id": "f2jp56k", "is_submitter": "False", "link_id": "t3_ddey9j", "parent_id": "t3_ddey9j", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "OP, please follow this advice. Your post is powerful to those who were abused, gaslit, and controlled. We know abuse and what you're going through is it.", "created_utc": "1570097681.0", "edited": "False", "id": "f29heqy", "is_submitter": "False", "link_id": "t3_dcepi1", "parent_id": "t1_f28750i", "score": "5", "subreddit": "relationships", "subreddit_id": "t5_2qjvn"}, {"author": "petrichorgasm", "body": "Haha me too! Nice, I notice you didn't capitalize german since it's an adjective, I see your capitalization rule, boo! Yeah, my person is german and now that I'm learning it, he texts me in German sometimes and asks me simple questions verbally. I still answer in English right now.\n\nHis father taught English and French and my guy is very into linguistics, so, not only is he supportive of my learning, his parents are too.\n\nOk now you're *really* inspiring. DM me and be reddit friends?", "created_utc": "1569949669.0", "edited": "False", "id": "f24djie", "is_submitter": "False", "link_id": "t3_davq4x", "parent_id": "t1_f1zwt5v", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Having Spanish-speaking coworkers is the reason I can understand it at the level I do. I owe so much to my coworkers in the kitchen when I was a server. Most of them barely spoke English but they taught me a lot of Spanish in the 3 years I worked there.", "created_utc": "1569801209.0", "edited": "False", "id": "f1xnu7s", "is_submitter": "False", "link_id": "t3_davq4x", "parent_id": "t1_f1waktz", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "You're so inspiring! Currently, I'm in a first-year German language class after a little self-study and two weeks in Lower Saxony earlier this year. You learned enough in 1.5 years to go to a German university? Impressive!", "created_utc": "1569800354.0", "edited": "False", "id": "f1xlxrc", "is_submitter": "False", "link_id": "t3_davq4x", "parent_id": "t1_f1vmshw", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "Thanks for this. I'm currently learning German in a hybrid college class that meets once a week and it's very different than when I learned French in a daily class. I'm sure this teacher only wants us to succeed, but the online content portion has me feeling so dumb.\n\n\nI'm passionate about learning this and can spend a long time engrossed in learning. I can listen to  and discuss with my German-speaking, linguistically-inclined boyfriend about grammar, pronunciations, history of a word, etc., and then I go to the Canvas portion of my assignment, and something goes wrong. For example, I misunderstood the instructions and ended up with a 2.63/6 after two attempts, then a picture wouldn't load and I need it to answer a quiz. Then there are assignments that seems to have only partial instructions. It's only my first week and I'm already discouraged. I have a coworker/friend who is in the same class. She's fluent in 3 other languages, one of them Slavic, and lived in Germany for 4 years in the past. Smart person, but we're both frustrated at the inconsistency of the online content.\n\nBut, I suppose, formally learning or not, I'm still going to learn it anyway.", "created_utc": "1569799967.0", "edited": "False", "id": "f1xl677", "is_submitter": "False", "link_id": "t3_davq4x", "parent_id": "t3_davq4x", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "petrichorgasm", "body": "When I was married, eventually I stopped growing. Now that I'm not anymore, with my current partner, I feel so supported as I do my own growing. I feel free yet loved.\n\nYou have to do what's right for you. In your early 20s you're still trying to figure out what you are. Why don't you take some time to do that. Relationships will come.", "created_utc": "1569719381.0", "edited": "False", "id": "f1rrvoj", "is_submitter": "False", "link_id": "t3_dafoue", "parent_id": "t3_dafoue", "score": "2", "subreddit": "AskWomenOver30", "subreddit_id": "t5_2ya5k"}, {"author": "petrichorgasm", "body": "Love. Which is a lot better than anything. Knowing that I'm loved even though I've thrown him my crazy and he just takes it in stride makes me realize that I'm really not as bad as I was led to believe.\n\n\nOf course he has limits, but, he's seen the worst of me and I don't have anything left. He unearthed the good parts of me and he can have it all. I'll only make more good and be better.", "created_utc": "1569349177.0", "edited": "False", "id": "f1c3nu2", "is_submitter": "False", "link_id": "t3_d8qpr2", "parent_id": "t3_d8qpr2", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Naps. Too many things to do now.", "created_utc": "1569348108.0", "edited": "False", "id": "f1c20er", "is_submitter": "False", "link_id": "t3_d8qsxw", "parent_id": "t3_d8qsxw", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Oh yes, my biggest surprise was when I was buying something in Berlin without my Germans, I said danke to the cashier and she responded \"you're welcome.\" She must have heard me speak English. \n\n\nIrl I'm really talkative so it was an experience to sit back and listen to my boyfriend's extended family talk to each other in German. I feel lucky that his father taught English, which made the whole trip much easier for me. \n\nI can't wait to learn more!", "created_utc": "1569264612.0", "edited": "False", "id": "f18wz3d", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f17xurw", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I figured saying \"shit house\" wouldn't be very well received in any language.", "created_utc": "1569262841.0", "edited": "False", "id": "f18sscp", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f17zxkb", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Haha, it's cute in real life too", "created_utc": "1569262635.0", "edited": "False", "id": "f18sagx", "is_submitter": "False", "link_id": "t3_d83gyz", "parent_id": "t1_f17ukgr", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Lol, danke. I'll be sure to say it in all caps to convey the urgency.", "created_utc": "1569241214.0", "edited": "False", "id": "f17docv", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f17c6eu", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "De nada! Keep at it and don't give up. Your brain, ears, and mouth will eventually work together.\n\nListen, this is what I know, I've dabbled in Spanish, French, German, and Polish. Polish is HARD. French is HARD. \n\nIn Polish, you pronounce everything, if it's 4 consonants in a row, it's nothing like what it should sound like. For example, the word \"dżdżownica\" (earthworm). It's called sybillant sounds and it fucks with me because my tongue doesn't naturally want to move like that. It's frustrating and interesting at the same time.\n\n\nIn French, half the word usually isn't pronounced and good luck figuring out which part.\n\n\nIn German, there is a dark \"L\" that English speakers don't realize. German and French kind of share the \"R\", and you know how the R is. Then there's ß, among other things.\n\nHaving experienced that, Spanish is the most forgiving when it comes to pronunciation. I think that can be applied to South American Spanish too. My friend goes back and forth from the US to Colombia. His Spanish was Mexican Spanish and he's doing great.\n\nDon't give up. Dedicate 15m/day and celebrate your achievements. You can do this.", "created_utc": "1569240998.0", "edited": "False", "id": "f17d82d", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f17885o", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Old people still in love and trolling each other. Gosh!", "created_utc": "1569239183.0", "edited": "False", "id": "f179jdm", "is_submitter": "False", "link_id": "t3_d83gyz", "parent_id": "t3_d83gyz", "score": "77", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I grew up in SoCal too! The only reason I could understand a little is because my best friend growing up is Mexican. Then I worked in the food service industry for a few years. I was informally tutored by my coworkers in the kitchen because they saw that I was making an effort to communicate. \n\n\nDon't worry if you can't speak it, it's not a source of embarrassment, people don't just \"pick it up\". Learning by immersion is not as easy as it's made out to be. As long as you're trying, you're doing good.\n\n\nI visited Denmark over the summer and I was so surprised that everyone spoke English. I didn't know that was a thing. Good for you for learning Danish though!", "created_utc": "1569237619.0", "edited": "False", "id": "f1777yp", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f174mmn", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I mean, I can't judge your closeness with your mom; cultural differences are a thing.\n\nI think your mom would be delighted! I have an ex boyfriend who is Polish but was born in the US so his Polish is very American and he couldn't answer my grammar questions, but he holds his own when speaking with his mother.\n\nHey, if I, someone who learned English as a second language, can learn how to say outloud and can spell \"Dzień dobry, kochanie, ja cię kocham\" there's no reason you can't learn way more. \n\nGo for it, especially if you're doing it for your mom. It's sweet.", "created_utc": "1569236679.0", "edited": "False", "id": "f1763ok", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f1738jl", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Hey, Rome wasn't built in a day and same goes for language skills. Go old school and start with a phrase book if you don't want to stare at your phone. I've seen English-Spanish phrase books geared towards medicalese, maybe start with that? Be kind and patient to yourself. You are not a dumbfuck. Learning another language takes time, consistency, and practice. Start today with one phrase. I'm not saying it will be easy, but I am saying that it's not impossible.", "created_utc": "1569235742.0", "edited": "False", "id": "f17509n", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f173qij", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Danke schön!", "created_utc": "1569234847.0", "edited": "False", "id": "f1740r3", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f173f96", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Keep at it! It does take getting used to, but rest assured, you'll get there. Time is your friend. I started with Duolingo feeling absolutely lost, but it's been about five months and I'm finding that I can understand a little bit when my German boyfriend talks to his kids. You have an advantage if you are already in Germany and hearing it all the time. \n\nViel Glück!", "created_utc": "1569234811.0", "edited": "False", "id": "f173zdk", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t1_f1734l4", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "German. My boyfriend is German and maybe if I speak it I can make him laugh.\n\n\nKidding. I went over there with him this summer. The first day, I went off on my own to find a bathroom and realized I didn't know how to say \"where is the bathroom.\" \n\n\nIt was the first time in my life I felt very lost and vulnerable. I already speak two languages fluently and know some phrases in Spanish and French, but didn't think I'd ever feel like that. \n\n\nWish me luck, I start German 121 next week.", "created_utc": "1569234070.0", "edited": "False", "id": "f1736lt", "is_submitter": "False", "link_id": "t3_d843pb", "parent_id": "t3_d843pb", "score": "10", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Sitting on the 522 right now trying to get to Shoreline. It takes me  from Skyway and that's *with* the light rail and Via from my house. \n\nIt's okay. Just okay. I'm definitely gonna be happy when my car is fixed. It takes too long to get anywhere not downtown.\n\nE: without the Via, it would be closer to 1.5hrs", "created_utc": "1568340236.0", "edited": "False", "id": "f02xkt5", "is_submitter": "False", "link_id": "t3_d3gfum", "parent_id": "t3_d3gfum", "score": "7", "subreddit": "SeattleWA", "subreddit_id": "t5_2vbli"}, {"author": "petrichorgasm", "body": "Damn, that puts things in perspective", "created_utc": "1560940478.0", "edited": "False", "id": "erjoh5z", "is_submitter": "False", "link_id": "t3_c26s9s", "parent_id": "t1_erithn8", "score": "1", "subreddit": "ADHD", "subreddit_id": "t5_2qnwb"}, {"author": "petrichorgasm", "body": "Oh, yes! This is how I learned the word \"hypochondriac\" as I was collaging my biology book.", "created_utc": "1538051268.0", "edited": "False", "id": "e6q8qa8", "is_submitter": "False", "link_id": "t3_9j8lyd", "parent_id": "t1_e6podu5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Seconded for that sunscreen. It is not sticky AT ALL. It does have alcohol though, but I have normal skin and it doesn't dry me out. I put it on after moisturizer. ", "created_utc": "1535439580.0", "edited": "False", "id": "e4ynto4", "is_submitter": "False", "link_id": "t3_9asi6b", "parent_id": "t1_e4ykxxh", "score": "7", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "\"Goshdarnit hellfire and brimstone!\"", "created_utc": "1534542849.0", "edited": "False", "id": "e4dm8vh", "is_submitter": "False", "link_id": "t3_985ft6", "parent_id": "t3_985ft6", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "My boyfriend has this! He's embarrassed that he can't swim and I said that maybe he has different bone density than everyone else. Whoa! He also has never broken a bone.", "created_utc": "1532332380.0", "edited": "False", "id": "e2vhsqz", "is_submitter": "False", "link_id": "t3_9110we", "parent_id": "t3_9110we", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "petrichorgasm", "body": "Oh cool! That was my first thought when I saw this picture, I wondered if it was a draft horse. I saw a few at our annual fair and luckily, my equestrian friend was with me. Those horses are a sight to behold. ", "created_utc": "1532299702.0", "edited": "False", "id": "e2useue", "is_submitter": "False", "link_id": "t3_910a2k", "parent_id": "t1_e2upy8m", "score": "9", "subreddit": "OldSchoolCool", "subreddit_id": "t5_2tycb"}, {"author": "petrichorgasm", "body": "Any recommendations of serum? Does this work for all hair types? Asking for a friend.....'s capstone project.", "created_utc": "1529170678.0", "edited": "False", "id": "e0s411f", "is_submitter": "False", "link_id": "t3_8rgnoe", "parent_id": "t1_e0rju5o", "score": "6", "subreddit": "antiMLM", "subreddit_id": "t5_2swge"}, {"author": "petrichorgasm", "body": "Wow...and to think all I would have done is just talk to them and listen to their stories. \n\nYou'll be surprised at how many people are hurting for validation. Then again, it's probably because I work with a population that are forgotten by society and I'm in a bubble. ", "created_utc": "1528925365.0", "edited": "False", "id": "e0mirho", "is_submitter": "False", "link_id": "t3_8qqarv", "parent_id": "t3_8qqarv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I have ADHD and have been treated for it with meds and counseling for 2 years. Cleaning is a sore spot for me and my husband, so thanks for this idea!", "created_utc": "1527299755.0", "edited": "False", "id": "dzla9z6", "is_submitter": "False", "link_id": "t3_8ktbqe", "parent_id": "t1_dzbdstb", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Edit: Tl;dr I'm on the am I happy and free to do as I please group. You'll hit your stride and know what's right for you. One thing to consider, don't forget you're a human being and have valid needs. \n\n\n In my opinion (I'm not a doctor, not a nurse, just a non-clinical observer), with today's medical advancements, PCOS isn't that big of a deal anymore as far carrying on a successful pregnancy or having children. The anecdotes I've read aren't scientific, just an insight into how there are possibilities to consider. Plus, if I had a nickel each time I say, \"I have PCOS, I can't have kids\", my work is such that I get inundated with \"You can still have kids! Let me connect you with Dr. Bob Loblaw who is an expert at this!\" I'd retire.\n\nI have PCOS, married 10 years, no children, never wanted them since I was 13. I did have my \"baby what-ifs\" from 2013-2016. But now, I'm having a grand time being aunt to a teen and a tween, both boys. Adolescence is hard for anyone, so my husband and I are happy to be able to answer their tough questions honestly and backed with facts. The situation they're being raised in makes it difficult for them to be informed, so we make sure they know they have someone they can trust. Nothing like raising a child, but safety is something an aunt and uncle can provide.\n\n\n\n\n", "created_utc": "1515972596.0", "edited": "1515974182.0", "id": "dsos0ho", "is_submitter": "False", "link_id": "t3_7qc833", "parent_id": "t1_dso6xhd", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Don't think about it too much. This thread is a conglomeration of opinions and experiences of a certain demographic (myself and my husband included). \n\n\nWhat to take away from this thread is consider it more information for your decision; that is YOUR decision. If you want to have kids, have them. If you don't, don't. Communicate with your partner, if you have them, about your desires and how it matches up with theirs.\n\n\nRight now, gauging from your age, your loyalty is to yourself. Find out  what will make you at peace and happy. No sense planning a future around an even that you don't even know will happen. Yes, you want kids, but there are so many variables to that journey that you'll have to deal with. \n\n\nDon't over think it. \n\n", "created_utc": "1515970658.0", "edited": "False", "id": "dsoq7iu", "is_submitter": "False", "link_id": "t3_7qc833", "parent_id": "t1_dsomvgm", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "My husband and I are \"DISCOs\": Double Income, Small-Cat Owners. \n\nI've also heard \"DILDOs\" : Double Income, Large- Dog Owners. \n\nEdit: Cat Tax. This is is her \"dear god, what have I done\" look she gets whenever she jumps on top of the shower door. https://imgur.com/uXLkpdp", "created_utc": "1515968953.0", "edited": "1515969259.0", "id": "dsookkr", "is_submitter": "False", "link_id": "t3_7qc833", "parent_id": "t1_dsofvia", "score": "10", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "It wasn't an accident. I'm a unit secretary and this is how I write on all the unit boards I update. ", "created_utc": "1514087013.0", "edited": "False", "id": "drorm2z", "is_submitter": "False", "link_id": "t3_7lp47m", "parent_id": "t1_dro6oas", "score": "5", "subreddit": "PenmanshipPorn", "subreddit_id": "t5_2v19p"}, {"author": "petrichorgasm", "body": "Woohoo! Glad you like the writing! (I'm the person who wrote the numbers)", "created_utc": "1514086744.0", "edited": "False", "id": "drorfl2", "is_submitter": "False", "link_id": "t3_7lp47m", "parent_id": "t3_7lp47m", "score": "4", "subreddit": "PenmanshipPorn", "subreddit_id": "t5_2v19p"}, {"author": "petrichorgasm", "body": "Very good.", "created_utc": "1481101513.0", "edited": "False", "id": "daw46dx", "is_submitter": "False", "link_id": "t3_5gss5w", "parent_id": "t1_davxnkd", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Sorry, the anesthesia residents beat you to the ninja black scrubs. Can I interest you in some standard order hospital blue?", "created_utc": "1480266906.0", "edited": "False", "id": "dahqpx0", "is_submitter": "False", "link_id": "t3_5f2c8p", "parent_id": "t1_dah2vvv", "score": "5", "subreddit": "premed", "subreddit_id": "t5_2rlp9"}, {"author": "petrichorgasm", "body": "Or ask your unit secretary. We call linen and request scrubs for medical staff when they need them. \n\n\nJust please be friendly when you ask. People don't realize we do a lot for the unit and it's always nice to hear a thank you :).", "created_utc": "1480212907.0", "edited": "False", "id": "dah2mep", "is_submitter": "False", "link_id": "t3_5f2c8p", "parent_id": "t1_dagxzlz", "score": "16", "subreddit": "premed", "subreddit_id": "t5_2rlp9"}, {"author": "petrichorgasm", "body": "Who you want to befriend is a friendly unit secretary. We are of both spectrums, the nice ones are reeeeeeally nice and the mean ones are reeeeeeally mean. Anyway, the nice ones will help you with a pair. \n\nTl;dr (heh) Ask a hospital unit secretary (HUC) for scrubs if you need one.", "created_utc": "1480211584.0", "edited": "1480212169.0", "id": "dah1t1p", "is_submitter": "False", "link_id": "t3_5f2c8p", "parent_id": "t1_dagx7jp", "score": "4", "subreddit": "premed", "subreddit_id": "t5_2rlp9"}, {"author": "petrichorgasm", "body": "I went to highschool in the 90s. Never thought I'd see my Latin textbook mentioned in the wilds of Reddit.", "created_utc": "1480180888.0", "edited": "False", "id": "dagghnd", "is_submitter": "False", "link_id": "t3_5ezevo", "parent_id": "t1_dagbqto", "score": "1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "petrichorgasm", "body": "I would be interested in these cards :)", "created_utc": "1470965841.0", "edited": "False", "id": "d6dyvyu", "is_submitter": "False", "link_id": "t3_4x9o8v", "parent_id": "t1_d6dxy5m", "score": "2", "subreddit": "MadeMeSmile", "subreddit_id": "t5_2uqcm"}, {"author": "petrichorgasm", "body": "It wasn't always like this. 10-15years ago, people were friendly and I could talk to anyone and have a small conversation. Not anymore. Ballard still has that small town feel, at least the part where I am, but everywhere else, not easy to be friendly; I'm always second guessing myself to avoid being creepy. I just like talking to people sometimes and it's hard! I want to move outside the city, idc to Camano or whatever, to be near the water, but hubby loves the city, so there's that. Where did you end up moving, if I may ask?", "created_utc": "1470685463.0", "edited": "False", "id": "d69f9eu", "is_submitter": "False", "link_id": "t3_4wqnt3", "parent_id": "t1_d69cmds", "score": "6", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I'm doing my prereqs for my BSN right now. Thanks for this! I live in an lgbt+ friendly city and work in a hospital, but some of my crew (RNs, CNAs) past and present still are unfamiliar and sometimes pejorative towards lgbt + and it makes me cringe. I vowed that when I'm a nurse, I'll be one more advocate and safe space and what you did is exactly how I'll conduct myself. Thanks! ", "created_utc": "1468429519.0", "edited": "False", "id": "d5asq0c", "is_submitter": "False", "link_id": "t3_4slqv0", "parent_id": "t1_d5ar8q1", "score": "7", "subreddit": "actuallesbians", "subreddit_id": "t5_2rch0"}, {"author": "petrichorgasm", "body": "I have a microbiology class later this afternoon and we just finished the lecture on this. Thanks for the quick and dirty on abx resistance, specifically, horizontal gene transfer.\n\nAlso, this is a summer class and the midterm is today. I'll get off reddit now.", "created_utc": "1468424775.0", "edited": "False", "id": "d5ap3mm", "is_submitter": "False", "link_id": "t3_4smc42", "parent_id": "t1_d5anrwv", "score": "6", "subreddit": "mildlyinteresting", "subreddit_id": "t5_2ti4h"}, {"author": "petrichorgasm", "body": "Then we'll promise we'll do something sometime to make up for it. ", "created_utc": "1467584102.0", "edited": "False", "id": "d4y4kwq", "is_submitter": "False", "link_id": "t3_4r3430", "parent_id": "t1_d4y1txg", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "This. I buy all my fitness wear at these stores, sometimes at thrift stores you can find new with tags clothes. I like to think the person who bought it lost weight faster than they expected haha. But shoes I still feel like I have to $pend. ", "created_utc": "1467347040.0", "edited": "False", "id": "d4uycz5", "is_submitter": "False", "link_id": "t3_4qp9lu", "parent_id": "t1_d4uxpjr", "score": "6", "subreddit": "loseit", "subreddit_id": "t5_2rz8w"}, {"author": "petrichorgasm", "body": "I did the same this week! Good luck on your journey!", "created_utc": "1466878733.0", "edited": "False", "id": "d4nqyyq", "is_submitter": "False", "link_id": "t3_4poyfa", "parent_id": "t1_d4nq4x5", "score": "2", "subreddit": "actuallesbians", "subreddit_id": "t5_2rch0"}, {"author": "petrichorgasm", "body": "This. My story: first one, lexapro; worked very well, but my insurance didn't cover it, so I got put on celexa, which didn't work at all. So I went cold turkey for a few years. It was hard and I was fighting depression, anxiety, and suicidal thoughts every day.\n\nI changed jobs and my insurance improved. So I got a new doctor and ask to be put on lexapro. This time, it fucked with me. I was foggy, hazy, sad, crying, and lost all interest in EVERYTHING. I wanted to keep going because I knew that it takes at least three weeks and up to six months for it to work. But it was so bad I swore I'll never go on medications again. \n\nA couple of months later, the suicidal thoughts, the depression, and the anxiety got so bad I didn't know what to do. I wanted to go back to school and finish my degree and I know that I can't do that with the severe depression and anxiety. \n\nI tamped down the negative thoughts and worked up the courage to tell my doctor and asked to be put on something else. She is very supportive of mental health and is the most knowledgeable PCP regarding depression and the medications I've ever had. She also knew about my depression and always does a check on with me when I see her for something else.  First PCP I've had to do that.\n\nAnyway, I'm 29 days into my current medication, got my first refill and I feel great. No fog, no, despair, no overanxiety. If I had known I can feel this normal and good, I would've done it a hell of a lot sooner. \n\nThis is my own experience. Take from that what you will. I'm glad I made the hard decision to try one more medication. If I hadn't, I never would have discovered this other me. The me who isn't doomy and gloomy, the me who is relaxed, the me who can plan and construct a future not bound by fear and limits.\n\nCheers and hugs to you, u/sans_peur. I hope you find what works for you. Depression lies. It has an ability to make you believe you're someone you're not. You're more than this sadness you feel and you don't have to feel that.", "created_utc": "1466624248.0", "edited": "1466624428.0", "id": "d4jsxs0", "is_submitter": "False", "link_id": "t3_4p552c", "parent_id": "t1_d4ir23i", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "Right on! Day 28 on my new meds after being depressed for over half my life too! I thought pills would signify weakness too. But man, I feel the best I've ever felt! My brain feels right and fresh, getting up in the morning feels good, I'm not as anxious, and I don't have several suicidal thoughts a day anymore.\n\nI have an appointment later today for a follow up and my first ever refill. My doctor is very thorough and attentive too. Each visit, she'd ask about my anxiety until I felt comfortable enough for her to put me on medication. I just had enough, you know? The first one made me feel like death, the second one (the one I am now) has changed my life. Had I known I can feel this balanced and in control with antidepressants, I would've done it sooner.\n\nIf anyone reading this is thinking about getting help and getting medication, I implore you to do it. You don't have to feel that fog. You don't have to live feeling worthless. Please take care of yourself.", "created_utc": "1466512702.0", "edited": "False", "id": "d4hw2cc", "is_submitter": "False", "link_id": "t3_4p3uig", "parent_id": "t3_4p3uig", "score": "3", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "petrichorgasm", "body": "Hugs to you. Please know you don't have to feel like this. I was very, very depressed, anxious, and suicidal for years. I thought no one understood. I wanted to go to law school and didn't want a mental health record, so I decided to go it alone and hide it. \n\nAfter lurking on reddit and reading people's encouragement to other depressed people, I decided to get help. It was so difficult to make those phone calls, to open up, to ignore the inner voice telling me it won't work.\n\nI started with therapy, and it helped immensely, unfortunately, it got really expensive so I had to stop. Then I decided to open up to my doctor. The first medication had me crying all the time. The second medication my doctor put me on fared much better. I have an appointment tomorrow to follow up and get my first ever refill (edit: I have insurance through work and my refill will be about $15, so it's not very much, financially). \n\nI've been on this medication for 27 days and while I recognize that it doesn't fully work until up to 6 months, I already feel so much better. I don't have daily suicidal thoughts anymore, work is bearable, and best of all, I can focus.\n\nI realize everyone is different and I realize that in the US, mental health is not well understood. I really want to encourage you to make that first difficult phone call, seek help and most importantly, don't give up. My life has changed for the better. It wasn't without its difficulties, financial and otherwise, but I needed to make that initial phone call. I feel much better and I really want other depression sufferers to know it's possible to get out of this mental fog.\n\n(I ended up not wanting to go to law school anymore. Now that my brain is clearer, I realize I liked studying something else better. Law school, or any school on my depression/anxiety would've been such a bad idea)", "created_utc": "1466454145.0", "edited": "1466454387.0", "id": "d4h38gh", "is_submitter": "False", "link_id": "t3_4oymhw", "parent_id": "t1_d4gxl0k", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "petrichorgasm", "body": "I agree, 3 days is so soon. They and my siblings did call the shelter and I think that's how they found out. I don't know which shelter it was. ", "created_utc": "1466098390.0", "edited": "False", "id": "d4bupof", "is_submitter": "False", "link_id": "t3_4ocsio", "parent_id": "t1_d4btz6s", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "petrichorgasm", "body": "I moved back in late 90s, so I'm not familiar with the area anymore, my dad said the nearest pound was three hours away from where they live in Southern CA.", "created_utc": "1466098119.0", "edited": "False", "id": "d4buhly", "is_submitter": "False", "link_id": "t3_4ocsio", "parent_id": "t1_d4bsama", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "petrichorgasm", "body": "I don't think she is, but I think she will be now. She doesn't usually run away, she's my dad's shadow. Not sure how she escaped. ", "created_utc": "1466097683.0", "edited": "False", "id": "d4bu4ho", "is_submitter": "False", "link_id": "t3_4ocsio", "parent_id": "t1_d4bp1qe", "score": "1", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "petrichorgasm", "body": "I used to pick up my books from the central library since it's on my way home from work. Since finding out how close the Ballard library is, I pick up from here now. Yes, there are homeless people who hang at the park, but I haven't had issues. Some play their music way loud, but, usually turn them down by the time I come back out. \n\nWe're still part of a major city, and the library is downtown Ballard, so, I expect homeless people around and with that, I understand that some may be mentally ill. I don't mind the mentally ill, I work in a hospital, and have had my share of having to redirect them as long as they're not violent. If they don't bother me or people I love or they're not bothering my neighbours, I let them be. Homeless people aren't the most aesthetically pleasing, but I can't get rid of them and I love my library.", "created_utc": "1466097512.0", "edited": "False", "id": "d4btzdo", "is_submitter": "False", "link_id": "t3_4nwim1", "parent_id": "t1_d47ls8i", "score": "1", "subreddit": "Seattle", "subreddit_id": "t5_2qhad"}, {"author": "petrichorgasm", "body": "Another vote for DD Meats! I used to live in Lynnwood and Mountlake Terrace. We went there for our meats whenever we can. Friendly people, great steaks, a selection of different hot sauces, and a small section of exotic meats (can't remember what they were, just not pig/cow/chicken/lamb).", "created_utc": "1466096629.0", "edited": "False", "id": "d4bt8tp", "is_submitter": "False", "link_id": "t3_4nznhl", "parent_id": "t1_d48pzdr", "score": "1", "subreddit": "Seattle", "subreddit_id": "t5_2qhad"}, {"author": "petrichorgasm", "body": "I moved out of White Center last year after living there for 2 years. Hubby's family has lived in the area for about 60 years and still do, so we go there during the holidays and random dinner visits. Hubby grew up there in the early 90s and apparently, it used to be super sketch, but now it's a lot better than it used to be.\n\nThe area I lived in, a few blocks from downtown WC was a neighborhood which saw its glory days back in the 5Os, but all in all, I didn't have any problems. I rode the 120 and the C line interchangeably, but if I rode the C, I have to switch to the 120 in Westwood Village. The C line has wifi, the 120 does not. I drive a 1994 POS, so, no one really bothered to ransack it or anything.\n\nFood favorites: Pho 99 (sometimes we make the drive from Ballard to this pho place despite having many options. Pho 99 broth is ace!), Zippy's and Proletariat. were a go to. From the Eat 24 app, we usually went with Thai-U-Up, standard Thai, the other Thai one on that app was gross and the Chinese options were ok. One Chinese place was better than the other, but I can't remember which. By the Goodwill is a coffee stand called Bigfoot Java, open 24 hours. Many, many late night/early morning runs of BFJ were had (I work crazy hours plus was going to school). Had a total of two bad experiences there, but, really, the rest of the baristas were very sweet and kind.  \n\nFor fitness, I did have a membership in a now-defunct,super no-frills, cash-payment gym, but mostly, I ran and did the stairs at Lincoln Park and also made the drive to Alki.\n\nYou can make it work. It really wasn't that bad of a time. I walked to and from the bus stop post 7pm and wasn't hassled or mugged. \n\nIf you have any other questions, you can PM me. If I don't know the answer, someone else in the family probably does.", "created_utc": "1466095924.0", "edited": "False", "id": "d4bso2h", "is_submitter": "False", "link_id": "t3_4o3kqp", "parent_id": "t3_4o3kqp", "score": "1", "subreddit": "Seattle", "subreddit_id": "t5_2qhad"}, {"author": "petrichorgasm", "body": "Thank you for doing this. My parents lost their dog last week and they were beside themselves. Three days later, they received a phone call that someone a block over had her. Both my parents and I learned during that time that had the pound had her, the pound would've euthanized her in three days if no one claimed her. \n\nMy dad loves that little critter. They are empty nesters, so the dog is everything to them. ", "created_utc": "1466089087.0", "edited": "False", "id": "d4bn7o4", "is_submitter": "False", "link_id": "t3_4ocsio", "parent_id": "t1_d4bld2l", "score": "65", "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc"}, {"author": "petrichorgasm", "body": "...Julie?", "created_utc": "1465423670.0", "edited": "False", "id": "d41ibps", "is_submitter": "False", "link_id": "t3_4n5321", "parent_id": "t1_d41bh0y", "score": "3", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}]