[{"author": "PhantomWithin", "body": "Exactly, I don't expect the tree to come back immediately at all. I just have to decide if I'll at least do tiny practices to keep my streak or if I should let it die to hurt their daily user numbers lol\n\nLingodeer might actually end up being a great way for me to go through & practice the different Spanish variations, since Duolingo doesn't focus on a particular region. Might try it more thoroughly once I'm in my Spanish week", "created_utc": "1666926297.0", "edited": "False", "id": "iu2ryq8", "is_submitter": "False", "link_id": "t3_yf4kx7", "parent_id": "t1_iu2q25x", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Pretty much expect to unsubscribe then, I feel like it'll take them more than 1 day to give us the tree back, if they ever do\n\nHad no idea they were doing Latin American Spanish at all, good to know. Personally I plan on learning both, but it was still worth mentioning that the current complete course was specifically Spain Spanish in case it mattered to you. Maybe I'll give LingoDeer another try later on, a more fair chance. If you try it out, I hope it works well for you though!", "created_utc": "1666925000.0", "edited": "False", "id": "iu2p9z9", "is_submitter": "False", "link_id": "t3_yf4kx7", "parent_id": "t1_iu2kqkr", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "If you were translating from French to English, it's considered harder to translate from English to French. That's all \"hard exercise\" really means.  \nOr, if it's not your first time doing a particular lesson, it might have you type for the first time instead of using the word bank\n\nAs far as what the actual sentence is, I believe it just chooses a random entry from the lesson", "created_utc": "1666919856.0", "edited": "False", "id": "iu2e2wu", "is_submitter": "False", "link_id": "t3_yez12e", "parent_id": "t3_yez12e", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "For me, the path forces me to move too slowly, or move too quickly by skipping units after the first circle. Just doesn't work for me, kinda feels like they just want to waste ppl's time until they buy Super\n\n& yeah stories were great to do between topics or to have a more relaxed finish to a study session, but only because I got to choose when I did them", "created_utc": "1666917907.0", "edited": "False", "id": "iu29t7d", "is_submitter": "False", "link_id": "t3_yf4kx7", "parent_id": "t1_iu247qt", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I actually haven't found another site that focuses as much on teaching how to form sentences that felt as good as Duolingo. Busuu and LingQ are more reading focused, you might be able to analyze how sentences are formed from those? Those 2 + LingoDeer are all free to try, so might as well take a look yourself & see which fits you best\n\n& good to know about babble, I actually forgot it existed haha, so I probably won't be trying it then", "created_utc": "1666914619.0", "edited": "False", "id": "iu22n3y", "is_submitter": "False", "link_id": "t3_yf4kx7", "parent_id": "t1_iu21jkf", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "estar (estoy) is for *states of being*. \n\nser (soy) is for *qualities about someone or something;* who you are as a person\n\nSo, being busy (ocupado) isn't a quality that makes him the person that he is. It's a current state that he's in right now. That's why \"estoy\" is used\n\nTemporary/permanent is misleading, because dead (muerto) uses estar.  \nAlso, children grow into adults, but child (niño) uses ser\n\nMy comment [here](https://www.reddit.com/r/duolingo/comments/y80nbh/can_someone_explain_why_it_isnt_est%C3%A1_thanks/) gives more detailed examples if you need it", "created_utc": "1666914381.0", "edited": "False", "id": "iu224j8", "is_submitter": "False", "link_id": "t3_yf5emw", "parent_id": "t3_yf5emw", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Yeah I've seen the article, and that's when I started worrying about backup plans. That's why I looked at LingoDeer actually, but I personally didn't like it. Busuu and LingQ seem to fit my personal needs at my current levels, but I don't think they'd be good beginner options for whenever I go to study a completely new language. Busuu eventually does ask you to write short answers to questions & native speakers will correct you, but it doesn't directly teach you how to form sentences like Duolingo does", "created_utc": "1666912342.0", "edited": "False", "id": "iu1xq5q", "is_submitter": "False", "link_id": "t3_yf4kx7", "parent_id": "t1_iu1wua3", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Yeah if I wanted such a strictly guided course, I'd go take some proper classes. The tree let me choose my own pace and move through topics as I pleased\n\nI understand the path for people who do want to be told how exactly to move through the course, but it's just too restricted to be the only option\n\nHopefully there's enough backlash after the forced switch that they give us the option back, otherwise I'll have to come up with a new study method using other websites", "created_utc": "1666911129.0", "edited": "False", "id": "iu1v4gb", "is_submitter": "False", "link_id": "t3_yf4kx7", "parent_id": "t1_iu1toye", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Hm, I didn't mind the differences so much, since the PC version doesn't have the annoying lives system like the app does. & I also preferred not being forced to do an extra lesson for every single crown\n\nBut yeah I hope enough people complain about the path that they have no choice but to give us the option to use either layout, otherwise I actually plan to quit using Duolingo most likely lol", "created_utc": "1666909023.0", "edited": "False", "id": "iu1qj3r", "is_submitter": "False", "link_id": "t3_yf18kq", "parent_id": "t1_iu1pkfd", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I took a look at it very briefly. LingoDeer focuses solely on Spain's version of Spanish. I also don't think it has nearly as much content as Duolingo's Spanish course does. It's also more strict about correctly forming sentences; there's only 1 correct option instead of having multiple possibilities \n\nIf anything, you can always go try it and see if it works for you, though", "created_utc": "1666908712.0", "edited": "False", "id": "iu1pu2b", "is_submitter": "False", "link_id": "t3_yf4kx7", "parent_id": "t3_yf4kx7", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "TLDR:   \nFrom someone who's tried (and is still) studying 4-5 at once:   \n2 is best, 1 or 3 is also acceptable, 4+ takes too much planning & daily time dedication\n\nLonger answer:\n\nIf someone has never learned a language before, I'd say at least get a small foundation in just one language before adding another. The brain needs to get used to understanding different grammar structures first. But, I don't think people don't have to get super proficient in that first language before picking up another, as long as they have a developed idea about how to understand new grammar\n\nBeyond that, personally I think the most beneficial is learning 2 languages at once.  \n**PROS:**  \nIf you get stuck, bored, or frustrated, then study the other language for a bit.   \nUnderstanding a concept in 1 language makes it easier to understand it in the other language.   \nWhile you won't finish both as early as if you were studying just one, I think it's possible to learn both simultaneously more quickly than if you studied just 1 after the other.   \nAny confusion is easy to fix when there's only 2 possibilities.  \n**CONS:**  \nIt's still possible to get them confused.  \nTaking in more information is harder for anyone & requires more time dedicated to learning.  \nIt takes longer than just learning 1 language\n\n3 languages increases the time needed, increases the need for a good learning plan, and increases the possibility for confusion, but overall shouldn't be too much more difficult than 2 languages imo. I wouldn't recommend more than 2 for busy people without much language experience, though\n\n4+ languages, you need a huge amount of time to dedicate, you'll need a good plan with consistency, you're much more likely to get confused (especially if you don't have a good learning plan to help keep the languages separate), and you'll have to be a lot more patient to reach big milestones. But it's possible for very dedicated individuals\n\nLearning just 1 language at a time is also acceptable and plenty of people are very successful with it. It can just slow people down if they get stuck, frustrated, or bored with it and need a break. There's no language to confuse it with, though, so that's a benefit. This is also the best choice imo for busy people, since it doesn't need as much time dedicated to it at all\n\nAs for similar or different languages, there are also pros and cons. I think they balance out & should mostly come down to preference, though  \nLearning 2 languages that are similar to each other can help with understanding grammar topics; if you understand it in one, it's easier to understand in the other. The risk of confusion increases, though  \n& Learning 2 languages that are in different language families are harder to confuse and can help prevent boredom with learning the same grammar structures, similar words, or similar phonetics, but there's more new information that has to be digested\n\n& of course, learning languages similar to one you already speak will always be easier and go much faster, I think you can learn more languages at a time if some are similar to your own language. And very different languages from your own require more time to understand & so it'll be harder to study multiple of these at once\n\nAnd now my personal experience, I've had very limited experience with French, Dutch, Greek, and Japanese throughout my time in school. This covers that first point of needing some exposure to different grammar. I also never struggled with understanding English grammar in my English classes.   \nA few years after school, I started studying 4 languages all at once August 2021, finally studying seriously. I continued Dutch and French, while adding Spanish and Russian. All European, but a few different families. I've done well to stay consistent, but it's definitely a huge time dedication that's consumed most of my time lol. & I've done a bit of Ukrainian on the side, I'm only just now about to study it more seriously, making it 5 languages that I study currently. I'm in too deep to quit any of them now, but if I had to start over, I wish I would've only picked 2 or 3 languages lol", "created_utc": "1666904730.0", "edited": "False", "id": "iu1gci0", "is_submitter": "False", "link_id": "t3_yf1cjv", "parent_id": "t3_yf1cjv", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "It should be called \"Super\" everywhere, unless you haven't updated the app on the app store. Lingots have always stayed on PC for whatever reason\n\nThe current tree layout on the PC just doesn't have the final review lesson on each circle. For example, if there are 4 lessons, the mobile app adds an additional 5th lesson to review those 4 lessons before leveling up. If you make it gold on PC, the mobile app will also be gold rather than 1 lesson off. You won't miss anything by continuing to the 5th crown on PC, and doing the extra mobile lesson won't change anything on PC at all\n\nHowever, Nov 1st, everyone is getting the new path layout & you won't have this tree anymore. Both PC & mobile will have the exact same lesson amounts; even PC will have the extra review lesson. That'll make the versions more in sync", "created_utc": "1666902045.0", "edited": "False", "id": "iu19eb4", "is_submitter": "False", "link_id": "t3_yf18kq", "parent_id": "t3_yf18kq", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "The Spanish course specifically has experienced a ton of bugs with the tips lately", "created_utc": "1666894426.0", "edited": "False", "id": "iu0pq3f", "is_submitter": "False", "link_id": "t3_yewgi6", "parent_id": "t3_yewgi6", "score": "50", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "The forums are disabled & have been for months, they aren't bringing them back. For some reason, they still let us read the old discussions, probably because many questions did get answered there in the past", "created_utc": "1666894370.0", "edited": "False", "id": "iu0pkv1", "is_submitter": "False", "link_id": "t3_yewjwq", "parent_id": "t1_iu0b9le", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Well, and as the other comment said, of course there are still definitely people where it literally is as simple as just a preference. & I think that should be respected as long as they speak respectfully when they describe their preferences; that they also exclude cis men that don't meet certain genital preferences \n\nWhat they were trying to say I think, though, is that some people might not have a problem with the idea of a cis man who's genitals didn't form expectedly and   \nmaybe even somewhat resemble a vagina, but then do have a problem with the idea of a trans man. Or, especially if they have a problem with trans men that have had surgery\n\nEither way, though, I personally don't care enough to spend my energy trying to change their views when I can just avoid them, since I'm not trying to date or sleep with every single person on the planet lol", "created_utc": "1666893635.0", "edited": "False", "id": "iu0noro", "is_submitter": "False", "link_id": "t3_ye7ilz", "parent_id": "t1_itz256h", "score": "1", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "PhantomWithin", "body": "Haha, hope you do still have your progress!\n\n& yeah, valhalla's style of having separate mini stories throughout each region rather than 1 linear story hurt the game a lot I think. That's kinda what I was getting at with odyssey's story, it just felt more whole & overall more interesting than the way valhalla did it\n\nI'm looking forward to their next game though, I heard they're going back to the style of the original games like the ones with Ezio", "created_utc": "1666828290.0", "edited": "False", "id": "itxaiqo", "is_submitter": "False", "link_id": "t3_yebgp0", "parent_id": "t1_itx6vys", "score": "2", "subreddit": "assassinscreed", "subreddit_id": "t5_2s6v6"}, {"author": "PhantomWithin", "body": "It comes from internalized transphobia. They're fighting their own inner battle to still even see themselves as men, & then end up projecting this by being transphobic to others\n\nWhile I haven't gone into kink spaces or tried actively looking for partners, I used to have it in the back of my mind (I'm bi) that I could be with cis men, cis women, trans women, but not trans men. I think I avoided saying that to people because part of me knew it was wrong and didn't make any sense; clearly I'm ok with any kind of body, but excluded other trans men from my options, for what? It's taken a lot of mental health work and just continuing my transition to move past that mindset. I'm glad I finally got over it and have no problem with the idea of being with other trans men now\n\nI hope my comment can at least make it less confusing for you when people act like this. Some might simply have a preference, but honestly, I think a lot of them just don't want to be reminded that they themselves aren't cis. You don't need to be forgiving of them, and maybe you even shouldn't be, but they just have a lot of work to do on deconstructing their own internalized transphobia imo", "created_utc": "1666827136.0", "edited": "False", "id": "itx7yq8", "is_submitter": "False", "link_id": "t3_ye7ilz", "parent_id": "t3_ye7ilz", "score": "35", "subreddit": "ftm", "subreddit_id": "t5_2t9mw"}, {"author": "PhantomWithin", "body": "Personally I liked Odyssey most. Been a while since I last played it, but from what I remember, travelling the map was fun with the variety between ship and horse, the combat felt satisfying at the time, the storyline felt deeper & more interesting than valhalla, & I think I just preferred Greece as a setting lol\n\nThe only issue I really remember having with it is that the places of interest while exploring the map got really repetitive, but I still did them all anyway. & also there's a mechanic to fight for either sparta or athens in battles for rewards, which can be fun, but it never had a true impact on the outcome of anything\n\nI still finished and enjoyed valhalla, though, so I'm curious what issues you had with it?", "created_utc": "1666825554.0", "edited": "False", "id": "itx4hr6", "is_submitter": "False", "link_id": "t3_yebgp0", "parent_id": "t3_yebgp0", "score": "2", "subreddit": "assassinscreed", "subreddit_id": "t5_2s6v6"}, {"author": "PhantomWithin", "body": "I think different people might have different answers. You're definitely welcome as a questioning individual in my opinion, but if you also don't feel ready or want to make the leap to call yourself LGBTQ+, you don't have to\n\nEither way, I wish your luck in your journey of discovering yourself :)", "created_utc": "1666824274.0", "edited": "False", "id": "itx1o2p", "is_submitter": "False", "link_id": "t3_yeb8pq", "parent_id": "t3_yeb8pq", "score": "1", "subreddit": "lgbt", "subreddit_id": "t5_2qhh7"}, {"author": "PhantomWithin", "body": "Everyone will be forced to use the path November 1st, but it's true; stories are mixed in the path. You have to complete a story before you can move forward to another lesson, and you can't do any stories that you haven't reached yet in the path. You can review old stories that you've already moved past on the path, though", "created_utc": "1666820899.0", "edited": "False", "id": "itwtsbm", "is_submitter": "False", "link_id": "t3_ye55dq", "parent_id": "t3_ye55dq", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "The Spanish course does seem to be pretty buggy lately, yeah, but you also accidentally put \"fa***r***ther\" instead of just \"father\"", "created_utc": "1666820575.0", "edited": "False", "id": "itwszq2", "is_submitter": "False", "link_id": "t3_ye9sdj", "parent_id": "t3_ye9sdj", "score": "27", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Right now, you have the freedom to get more crowns in each of those circles as you please, in whichever order you'd like.   \nThe new update just re-arranged it so that you don't have a choice in what order you do them. You'll return to the same content every few circles or so (like if you were to go back now and make all of those level-1 circles go to level 2 before starting \"to be sg.\", it's similar to that)\n\nPersonally I prefer the freedom to move through the course my way, but I understand the benefits of the path for people that just want to move through lessons without planning it out or thinking too hard about the order. Just wish they'd give us the option to use the current layout, since the lessons are the same anyway, but Nov 1st we'll only have the path", "created_utc": "1666818697.0", "edited": "False", "id": "itwoc30", "is_submitter": "False", "link_id": "t3_ye7uly", "parent_id": "t3_ye7uly", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Any numbers you see there for dates are always very rough estimates. The course was just recently started, so they put a far-away date until they actually know more. Also, the French course for Turkish speakers has an estimated release year of 2099 lol", "created_utc": "1666817690.0", "edited": "False", "id": "itwlqyx", "is_submitter": "False", "link_id": "t3_ye8hd1", "parent_id": "t3_ye8hd1", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "But it's not even that, because \"tú hace\" is wrong in every tense. It should never be a possible answer", "created_utc": "1666806349.0", "edited": "False", "id": "itvrtp2", "is_submitter": "False", "link_id": "t3_ye260s", "parent_id": "t1_itvl81x", "score": "11", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Spanish's tips have just been really wrong lately, this isn't the first post I've seen about it", "created_utc": "1666803697.0", "edited": "False", "id": "itvky20", "is_submitter": "False", "link_id": "t3_ye260s", "parent_id": "t3_ye260s", "score": "50", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I might end up doing a mixture of [Busuu](https://www.busuu.com/), [LingQ](https://www.lingq.com/), and just immersion (books/shows/video games). It's helpful that I did use Duolingo's previous tree to get a huge head start first, I honestly am not sure how I'd go about learning a completely new language whenever I reach that point. Maybe [Lingodeer](https://www.lingodeer.com/) for the basis before moving to the other options?   \n[Internet Polyglot](https://www.internetpolyglot.com/) also seems to be good for just vocabulary cramming.   \nI haven't really tested [Memrise](https://app.memrise.com/) yet, but it seems popular; lots of lessons mostly made by the community from what I've seen so far\n\nI actually also might've been able to stick around with Duolingo if each individual circle could be tested out of, the same way I'm used to doing the roughly 5 lessons per circle for the first crown & then test to 5 crowns.   \nBut yeah, the new path either forces me to move too slowly by doing every lesson, or too quickly by testing out of entire units. I lost my freedom to learn my way with the new update", "created_utc": "1666750533.0", "edited": "False", "id": "itt1b8c", "is_submitter": "False", "link_id": "t3_ydj5li", "parent_id": "t3_ydj5li", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I've heard LanguaTalk has many tutors that offer 1 free trial session, that might be a good way to start exploring a bit. There's also alternative websites to Duolingo, like Busuu or LingQ, that are a lot less game-ish and restrictive. You could always just watch some shows or movies completely in the foreign language, or find some music, figure out which one you're more instinctively attracted to. I think we all have a small instinctual bias about which languages we love more haha, even if it can be hard to feel since we also simultaneously love so many\n\nAlthough, one important thing to consider, languages that you love more will be easier to learn on your own, and languages that you love a bit less might be best in a classroom where you're pushed to keep up a pace. So maybe considering a harder language for school might be the right step for you\n\nBut, as another comment says, having a major in a language might not actually give you an advantage if you can just learn it on your own. Knowing the language is the most important part, not so much that you've taken classes on it. If you have an opportunity to learn for cheap or free, though, and want to spend that on something you love just for the sake of loving it, don't really care about a degree's advantages in getting a job, absolutely major in a language then :)", "created_utc": "1666738342.0", "edited": "False", "id": "itsanso", "is_submitter": "False", "link_id": "t3_ydezbb", "parent_id": "t3_ydezbb", "score": "3", "subreddit": "polyglot", "subreddit_id": "t5_2reiv"}, {"author": "PhantomWithin", "body": "It honestly feels like they just want to waste peoples' time more and more with the update, make people watch more ads so they buy Super. On the phone app, you can't even practice old topics without worrying about lives (at least lives aren't a problem on the website)\n\nI've just decided not to be dependent on Duolingo & start looking for backup plans like LingQ, Busuu, or simply immersion with books/video games/shows. If they change their minds & add the tree back, maybe I'll use Duolingo seriously again, otherwise I'm not going to waste my time learning so much slower than I would elsewhere", "created_utc": "1666733994.0", "edited": "False", "id": "its0r14", "is_submitter": "False", "link_id": "t3_ydg069", "parent_id": "t3_ydg069", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Yep, if you don't know the gender, use \"gato\" :)\n\nStill really strange that both wouldn't be accepted imo, especially in the context of \"our cat...\" but that's just Duo I guess", "created_utc": "1666721369.0", "edited": "False", "id": "itr3vgx", "is_submitter": "False", "link_id": "t3_yd8fpr", "parent_id": "t1_itqxdjn", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Thanks for the correction! Edited my comment :)\n\nStill learning Spanish, accidentally just trusted the tip. In that case, this tip is even weirder then", "created_utc": "1666721118.0", "edited": "False", "id": "itr37ms", "is_submitter": "False", "link_id": "t3_yda7ap", "parent_id": "t1_itqyi25", "score": "10", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Wow this tip is poorly explained\n\n\"ellos/ellas/ustedes salen\" = they/you leave/go out (statement)\n\n~~salan~~ salgan = leave/get out (command) when speaking to a group of people you'd call \"ustedes\"", "created_utc": "1666718333.0", "edited": "1666721070.0", "id": "itqvxk7", "is_submitter": "False", "link_id": "t3_yda7ap", "parent_id": "t3_yda7ap", "score": "43", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Is \"katze\" the most common word for a cat in general, & \"kater\" only when it's known that it's a male cat? That's the only reason I can think of that Duo would have \"gato\" here. Spanish uses \"gato\" for a cat in general, and \"gata\" only when it's known to be a female cat\n\nEither way, if it's \"our cat,\" I think it'd be a little weird not to know if it's a female or male. Report the answer using the little flag icon & hope Duolingo adds it to the list of correct responses, otherwise it's just another flaw of Duolingo", "created_utc": "1666718142.0", "edited": "False", "id": "itqvfv2", "is_submitter": "False", "link_id": "t3_yd8fpr", "parent_id": "t1_itqkedx", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "\"otra vez\" is closer to simply \"again\"\n\n\"una vez más\" seems to be more emphasized, closer to \"once again\" or \"once more\"\n\nIt's also completely possible Duolingo decided to mark you wrong for \"ves\" rather than \"vez,\" but sometimes it can be really picky so it probably just doesn't accept \"una vez más\" at all here", "created_utc": "1666661517.0", "edited": "False", "id": "ito1zo9", "is_submitter": "False", "link_id": "t3_ycs7h1", "parent_id": "t3_ycs7h1", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Где он кошка? = Where is he cat?\n\n\"His\" and \"he\" are different words in English, just like его and он are different words", "created_utc": "1666660350.0", "edited": "False", "id": "itnz9bp", "is_submitter": "False", "link_id": "t3_ycrxls", "parent_id": "t3_ycrxls", "score": "12", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Duolingo should honestly almost get you there, the Dutch course I found to be really good. But I wouldn't rely on it as your only source of study. While doing the course, you should consume as much Dutch content as you can and pick up whatever extra things you can along the way. At any point, you can also take CEFR tests in Dutch to see what you're missing & research those things independently", "created_utc": "1666550851.0", "edited": "False", "id": "ithnno4", "is_submitter": "False", "link_id": "t3_ybf54x", "parent_id": "t3_ybf54x", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I've heard people saying that if there's a quick autocorrection right before you submit it, Duolingo might only be able to read what it was before that correction. That's the only thing I can think of, otherwise it's just an unfortunate bug", "created_utc": "1666481739.0", "edited": "False", "id": "ite70eb", "is_submitter": "False", "link_id": "t3_yb1qd6", "parent_id": "t3_yb1qd6", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Both \"usted\" and \"tú\" mean \"you\"  \nTú is for friends, family, and children  \nUsted is for strangers, bosses, teachers; for people you show respect to\n\nIn English, most of our conjugations only have 2 forms (eat/eats, do/does, am/is/are).  \nIn Spanish, there are a lot more forms.\n\n\"Tú\" always uses \"estás\"\n\n\"Usted\" always uses \"está\"\n\nSo, \"¿Estás usted ocupado?\" sounds about as weird as \"Am you busy?\" or \"Is you busy?\"\n\nAnd \"¿Tú está ocupado?\" is actually quite literally, \"You is busy?\"\n\nAs for ocupado & ocupada, it's gender. A guy is ocupado, but a girl is ocupada", "created_utc": "1666467424.0", "edited": "False", "id": "itdaayw", "is_submitter": "False", "link_id": "t3_yavk1k", "parent_id": "t3_yavk1k", "score": "6", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "This just seems like a problem with the app unfortunately\n\nThe website doesn't have the lives at all on normal lessons, only when you're taking a test to skip ahead. & there's no practice to regain hearts, they're all just there per test attempt. Using an adblocker also means you don't get ads, even ads for super, on the website\n\nBut yeah, this is exactly why I'll never use the app unless I'm on a free trial for super or something", "created_utc": "1666457882.0", "edited": "False", "id": "itcn8rk", "is_submitter": "False", "link_id": "t3_yarvqn", "parent_id": "t3_yarvqn", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "You can skip ahead to the start of any unit by taking a test, but you can't test out on individual circles anymore", "created_utc": "1666455316.0", "edited": "False", "id": "itch3mo", "is_submitter": "False", "link_id": "t3_yarhez", "parent_id": "t3_yarhez", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "There might be a setting to sign up for Beta versions of the app, but you can also change it if you join/create a classroom", "created_utc": "1666401643.0", "edited": "False", "id": "ita2qxt", "is_submitter": "False", "link_id": "t3_ya0x4q", "parent_id": "t1_it9m4mu", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I've heard you can make a classroom & then maybe the classroom has a setting to change it back for all your students & yourself, but it's not really worth doing since they're forcing everyone to use this new layout starting Nov 1 anyway unfortunately", "created_utc": "1666386927.0", "edited": "False", "id": "it973a9", "is_submitter": "False", "link_id": "t3_ya4fsl", "parent_id": "t3_ya4fsl", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Not stupid, but learning, and that's why you're on Duo practicing anyways :) to learn it", "created_utc": "1666379748.0", "edited": "False", "id": "it8piaa", "is_submitter": "False", "link_id": "t3_ya1f7m", "parent_id": "t1_it8ov1k", "score": "11", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "\"My father wears size 16\"\n\nusa - uses/wears  \ntalla - size", "created_utc": "1666379021.0", "edited": "False", "id": "it8npyb", "is_submitter": "False", "link_id": "t3_ya1f7m", "parent_id": "t3_ya1f7m", "score": "21", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "The stories are scattered throughout your path if you're learning a language that has stories. They removed the ability to access them separately unfortunately", "created_utc": "1666378798.0", "edited": "False", "id": "it8n6g3", "is_submitter": "False", "link_id": "t3_ya0x4q", "parent_id": "t1_it8mks9", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "They updated the layout. You already have the new version, it's currently optional. Everyone will be forced to use it on Nov 1st", "created_utc": "1666378161.0", "edited": "False", "id": "it8llbc", "is_submitter": "False", "link_id": "t3_ya0x4q", "parent_id": "t3_ya0x4q", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I'd focus more on the one that's the most interesting to you. Your brain is naturally going to learn a lot faster\n\nAlso, if you have the time for it, learning 2 languages at once can be a great benefit. You can always switch between them if you get frustrated or \"stuck\" on one, and come back with a refreshed mind later. Just make sure to mostly focus on 1 language within a single day and don't try to study both in the same day. Eventually you might even be able to use one to study the other too\n\nI just wouldn't recommend doing more than 2 or 3 at once though, especially if you don't have a ton of free time to plan it out super well", "created_utc": "1666377062.0", "edited": "False", "id": "it8iuo5", "is_submitter": "False", "link_id": "t3_y9zmz3", "parent_id": "t3_y9zmz3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "PhantomWithin", "body": "You can also join the discussion in my longer post about the path [here](https://www.reddit.com/r/duolingo/comments/y91nya/duolingo_has_lost_sight_of_the_most_important/)", "created_utc": "1666376066.0", "edited": "False", "id": "it8gd5a", "is_submitter": "False", "link_id": "t3_ya0j76", "parent_id": "t3_ya0j76", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "It's possible to opt-in early right now, but [they told us in this blog post](https://blog.duolingo.com/new-duolingo-home-screen-design/) that everyone gets the new update on November 1st. Plenty of people are complaining about it", "created_utc": "1666374130.0", "edited": "False", "id": "it8bgrd", "is_submitter": "False", "link_id": "t3_y9yrbk", "parent_id": "t3_y9yrbk", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "An update actually, I had some time and checked through comparing the Dutch course on my account with the path to my main account with the tree. They absolutely do introduce about 2 new concepts per unit, the second one appears about halfway through the unit. So I'll be slowed down anyway.\n\nAlso, there's still an even older version of the tree on the Microsoft Store, so clearly there are no issues with keeping the current tree for over a year.", "created_utc": "1666370168.0", "edited": "1666375384.0", "id": "it81jt3", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it5dfed", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Why does the look of it have to matter? If all the characters & sounds were removed, it'd still be a great source of grammar & starting vocabulary if you analyze everything well lol. Especially the website that doesn't have all of the game-ish elements anyway \n\nEven if you think it's not for advanced learners, you can read through various posts, comments here, check elsewhere online for years-long users, and see that there are still people using Duolingo that ARE more advanced than just the path", "created_utc": "1666356243.0", "edited": "False", "id": "it74qmp", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it70s61", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "To clarify, I mean advanced at learning, not advanced in the language; people who need harder content & can move faster", "created_utc": "1666353868.0", "edited": "False", "id": "it70d3d", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it6zlrb", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Making a classroom activated it for me, you can just delete the classroom after if you want", "created_utc": "1666352388.0", "edited": "False", "id": "it6xv06", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it6bswb", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "No, they released a blog stating that it releases for everybody November 1st. Everyone just has a couple weeks, not months\n\nEdit for whoever downvoted, it's literally the first thing written [here on Duolingo's official blog:](https://blog.duolingo.com/new-duolingo-home-screen-design/)  \n\"The new Duolingo home screen experience will be launching November 1, 2022 for all learners. If you have questions about this change, read on for answers! This post was updated on September 29, 2022.\"", "created_utc": "1666352332.0", "edited": "1666370265.0", "id": "it6xru8", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it6o668", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Well there's not much to say, I think you make valid points haha. \n\nWhile I did look over the new path, admittedly I didn't spend the time to complete multiple entire units to be able to verify if only 1 new concept gets introduced per unit like you say. If that's true, then you're probably right that I can get used to just testing out of the units. \n\nYou're right that I don't work in software engineering at all and have no experience with it, so I know very little. I do know it'd eventually be unstable and have to be removed, but is that happening so soon that they can't leave it for at least a few more months, for the people that still really hate the update?", "created_utc": "1666317885.0", "edited": "False", "id": "it5iab8", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it5dfed", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "It's being forced on November 1st unfortunately, wish they'd at least leave the tree as an option for already-started courses", "created_utc": "1666308834.0", "edited": "False", "id": "it4xvs2", "is_submitter": "False", "link_id": "t3_y9d030", "parent_id": "t1_it4wjzm", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Yeah, not sure if they just usually enter them manually with any capitalization corrections etc, and because of that it never triggers an email, or if almost all reports are just simply ignored (probably this one tbh). I was surprised to get any email back at all about my answer being added to the Russian course", "created_utc": "1666308597.0", "edited": "False", "id": "it4xcpo", "is_submitter": "False", "link_id": "t3_y93err", "parent_id": "t1_it4wa5j", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I understand why it's the default answer, but other natural options should definitely be accepted. There's always that flag to report \"my answer should've been accepted,\" but unfortunately, 90% of the time, nothing comes of that. I've only had success getting an email back about my report being accepted a few times in the Russian course, all other courses seem to have ignored my reports", "created_utc": "1666307885.0", "edited": "False", "id": "it4vsy4", "is_submitter": "False", "link_id": "t3_y93err", "parent_id": "t3_y93err", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Yeah, clearly they're capable of letting both stay within the code simultaneously, at least until the tree becomes buggy and they can't keep it (I don't expect them to maintain it at all)\n\nAlso though, the fact that it switches might be considered an unsightly bug & that could be the reason they push so hard to just remove the old layout, even though switching doesn't seem to hurt progress at all", "created_utc": "1666307178.0", "edited": "False", "id": "it4ua9a", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it4t1o0", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I've learned a lot using my method but ok lol\n\nTaking tests to 5 crowns still costs gems/super, if I didn't wanna learn anything I'd just stop at 1 crown each 🤷‍♂️", "created_utc": "1666304565.0", "edited": "False", "id": "it4oj4g", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it4novp", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Each new unit actually contains material from more than 1 circle on the old tree. If each unit truly was equal to 1 old-tree circle, then it would be no problem for me to test forward that way. My statement about accidentally skipping content is that I don't want to do the lessons for \"crown 1\" of \"old tree circle A\", then skip the unit, just to end up missing the entirety of \"old tree circle B\". Duolingo themselves stated that they've lightly mixed the content up so that the same content gets revisited, rather than doing the entirety of 1 old-tree circle's content back-to-back.\n\nI specifically suggested in my post a \"phase out\" to the old tree, which would allow people to finish their courses on the tree, but any newly-started courses would require the path. Eventually, they'd just have to get rid of the old tree and I understand that, but simply leaving it available with no maintenance wouldn't cost them anything extra. They could simply remove it once a feature is added that truly makes the old tree buggy and unusable. This suggestion both addresses the fact they can't maintain 2 styles, and also allows for people to adapt to change.\n\nEither way, I've accepted I probably won't make a difference in their decision, but chose to write anyway. Either I'll get used to the path, or I'll quit and move on learning elsewhere. And regardless, I appreciate your feedback too", "created_utc": "1666304370.0", "edited": "False", "id": "it4o388", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it4j0ko", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Didn't know that about the CEO, good to know. But it's also not surprising, considering we're already being shown they don't listen & pretty much all CEO's tend to feel that way anyway. \n\nIt's unfortunate it probably won't change anything, I accepted that before even writing, but at least I tried. Just seems so simple to at least leave the tree as an option for in-progress courses, even if they force the new path for newly started courses", "created_utc": "1666300503.0", "edited": "False", "id": "it4eul6", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it4csq7", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Not sure about 99%, but I agree that the path is better for the majority (and why I said it should be the default). I just don't find it necessary to get rid of an old design that does work better for a large number of people, even if they're smaller by comparison to the rest. I did also praise the amount of research put into the new tree, I just understand a lot of old users have their own methods perfected with the tree and don't want to lose their tool\n\nEither way though, I appreciate your feedback :)", "created_utc": "1666295365.0", "edited": "False", "id": "it41kpc", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it3p9wd", "score": "6", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "On the website at least, you don't need hearts for practicing old lessons, I tested the path with a free non-super account. Maybe they just mean hearts are still an existing system on the app (used for new lessons, restored with practices). I've also seen people say joining a classroom gives you unlimited hearts (and making a classroom is completely free)", "created_utc": "1666285197.0", "edited": "False", "id": "it3bcky", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it39qi7", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "You can practice each individual circle on the path anytime as much as you want for 5 exp per practice. On the website (unsure about mobile), the \"workout\" icon is still there to practice random content from the course", "created_utc": "1666281770.0", "edited": "False", "id": "it32ebz", "is_submitter": "True", "link_id": "t3_y91nya", "parent_id": "t1_it31fu9", "score": "14", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "At the level you're at, I've heard it's really hard to forget it even if you don't use it much. Sure, it can get rusty, but it should come back to you very quickly if you ever need it\n\nMy personal recommendation, though, is to consume the same content you normally would, but consider changing it to French. For example, I play video games and a ton of them come with a full French translation with audio and everything. Or, maybe even consider doing your Google searches in French haha\n\nBut overall I don't think it's good to force any kind of maintenance, that'd just ruin the language for you. It should feel like a fun option to switch to from time to time while doing whatever you normally would", "created_utc": "1666219838.0", "edited": "False", "id": "iszzbz0", "is_submitter": "False", "link_id": "t3_y87cv3", "parent_id": "t3_y87cv3", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "PhantomWithin", "body": "Yeah lots of people are saying this happens to them right now. They'll probably completely delete the old tree on November 1st when they force everyone to use the new path, so the bug should be gone by then", "created_utc": "1666218823.0", "edited": "False", "id": "iszx0nw", "is_submitter": "False", "link_id": "t3_y8fycv", "parent_id": "t3_y8fycv", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "At least on the website, you can get the new path by joining or starting a classroom (no one else has to be in it). I imagine doing that would change it on your phone too, but not 100% sure. Make sure to completely close & restart the app too, just in case it hasn't loaded yet", "created_utc": "1666218712.0", "edited": "False", "id": "iszwrhd", "is_submitter": "False", "link_id": "t3_y8getx", "parent_id": "t3_y8getx", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Thanks! I was almost sure \"es muerta\" is just weird and doesn't ***really*** mean anything, but good to have that confirmed :)\n\n& I actually find explaining other languages easier than explaining English haha, just from analyzing and simplifying the grammar of other languages for my own understanding. But English, well I can explain things, but sometimes it ends up an overcomplicated mess because a native language is mostly just instinct haha", "created_utc": "1666212890.0", "edited": "False", "id": "isziehx", "is_submitter": "False", "link_id": "t3_y80nbh", "parent_id": "t1_iszfmwd", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Hm, I usually just go to a game category, filter by \"nederlands\" and just choose someone. I find there's always GTAV RP streams in Dutch haha\n\nAlso, this channel was an interesting find: https://www.twitch.tv/various\\_livestreamer  \nIt's always playing 24/7 and just plays some old Dutch TV shows constantly, always there if you have a hard time finding someone to watch at any specific time", "created_utc": "1666211495.0", "edited": "False", "id": "iszepxk", "is_submitter": "False", "link_id": "t3_y8da4i", "parent_id": "t3_y8da4i", "score": "10", "subreddit": "dutch", "subreddit_id": "t5_2rtjy"}, {"author": "PhantomWithin", "body": "It's one of the possible icons for lessons (just like the book icon underneath it). For some reason, it's somehow placed an icon on top of a lesson when it shouldn't be there. It's just a visual bug, it doesn't mean or do anything", "created_utc": "1666210885.0", "edited": "False", "id": "iszd3jx", "is_submitter": "False", "link_id": "t3_y8d3vj", "parent_id": "t3_y8d3vj", "score": "6", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I don't think you need to restart. You can always go back to earlier lessons and click the \"practice\" option to review. If you have Super or can afford the gem cost, you can also try getting each unit to legendary (purple). That'd be a good way to review the content in a harder way. Otherwise, whatever you don't retain from the course, you can always catch up on after Duolingo once you start immersing in the language", "created_utc": "1666207046.0", "edited": "False", "id": "isz2vmx", "is_submitter": "False", "link_id": "t3_y8arbq", "parent_id": "t3_y8arbq", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Temporary/permanent isn't the main thing to consider!\n\nSer is about ***qualities*** that ***describe*** something. \"Dead\" isn't part of your personality or things that make you who you are\n\nEstar is about ***states of being***. \"Dead\" is a ***state of being*** that someone becomes, but it doesn't describe who they are. That's why estar is used for dead or alive", "created_utc": "1666195823.0", "edited": "False", "id": "isy9x5z", "is_submitter": "False", "link_id": "t3_y80nbh", "parent_id": "t1_isy7bnv", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Unfortunately, it technically is the closest word to a true plural \"you.\" We have other phrases like \"you guys,\" but that's also a bit casual and shouldn't really be seen in a course, in my opinion\n\nAlso, the course you're doing is aimed at native English speakers. I've personally never had a problem writing the same \"you\" for any of the various plural, singular, formal, or informal \" yous\" of other languages. I hope it gets easier for you, but unfortunately standard English just doesn't make a distinction at all and other forms are very unlikely to show up in any course", "created_utc": "1666191092.0", "edited": "False", "id": "isxy4jf", "is_submitter": "False", "link_id": "t3_y8374q", "parent_id": "t1_isxud34", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "\"Un problema\" is masculine because it has roots outside of Spanish (Greek, I think?). You just have to remember that some Spanish words have unexpected genders, it's not always related to the ending\n\nTemporary/permanent isn't the main thing to think about between ser/estar. It's whether it's a quality about the person or not. \"Dead\" is a ***state of being*** that someone has become, it's not something that describes their character or who they are as a person, so that's why \"estar\" is used\n\n\"Es muerta\" I think just sounds unnatural, but if it could actually be said, it would describe the person as being death itself, or they have some sort of usually deathly ***quality*** to them; it means \"dead\" is just part of who they are as a person\n\nI hope that clears it up for you :)", "created_utc": "1666190096.0", "edited": "False", "id": "isxvq0y", "is_submitter": "False", "link_id": "t3_y80nbh", "parent_id": "t1_isxucmi", "score": "13", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Looks like others got back to you before me haha, but \"estar\" is always used for location because it's considered a ***state*** rather than a ***quality.*** \n\n\"el baño es grande\" because being big is a quality,   \n\"el baño está aquí\" because its location is a state of being & not a quality", "created_utc": "1666188830.0", "edited": "False", "id": "isxsr4w", "is_submitter": "False", "link_id": "t3_y80nbh", "parent_id": "t1_isxi8j3", "score": "5", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "\"Y'all\" is only used in the US, and even then, not all of us say it. I personally don't like how it sounds. It's not technically standard English and it feels more like slang to me. That's why the courses don't use it. Maybe it should be accepted as a possible answer, but I don't think it should be added in the questions by default at all. As a native speaker, I'm never confused about \"you\" meaning either singular or plural, it's meant both for a very long time in English's history :)", "created_utc": "1666188664.0", "edited": "False", "id": "isxsdfg", "is_submitter": "False", "link_id": "t3_y8374q", "parent_id": "t3_y8374q", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "\"es\" (ser)  is always about **qualities** that describe someone/something; man, woman, boy, girl, large, small, an always cheerful person, where you're from, etc\n\n\"está\" (estar) is about what **state** someone or something is in. A happy mood, where they're located right now, dead or alive, etc\n\n***EDIT:***  \nAdded some examples/explanations that had to be cleared up in replies\n\n\"el baño es grande\" because being big is a ***quality***,  \n\"el baño está aquí\" because its location is a ***state of being*** & ***not a quality***\n\n\"Dead\" is a state of being that someone becomes, but it doesn't describe who they are as a person. That's why estar is used for dead or alive. \"Dead\" isn't part of your personality or things that make you who you are, so don't use \"ser\" for dead  \n\"Es muerta\" is just unnatural, but if it could actually be said, it would mean something like \"dead is who she is\"; it means \"dead\" is just part of who she is as a person. It just doesn't really mean much sense, even if people can understand what you're trying to say\n\nTemporary/permanent is ***NOT*** the main thing to consider!  \nWhile ***MOST*** \"estar\" things can change, some can't (being dead).  \nAnd while ***MOST*** \"ser\" things are permanent, some can change (a boy becomes a man).  \nThe difference is what ***DESCRIBES QUALITIES*** and what is a ***STATE OF BEING***", "created_utc": "1666182258.0", "edited": "1666217875.0", "id": "isxezaw", "is_submitter": "False", "link_id": "t3_y80nbh", "parent_id": "t3_y80nbh", "score": "358", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "For me it's just on the subreddit's main page, just within the pannel on the right under \"create post\"\n\nCheck here: https://cdn.discordapp.com/attachments/1032050924018999306/1032051039899234384/unknown.png", "created_utc": "1666130463.0", "edited": "False", "id": "isuz646", "is_submitter": "False", "link_id": "t3_y7gdzc", "parent_id": "t1_isuuwu7", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Right, it's only relevant for people expecting to live in Spain or communicate a lot with Spaniards specifically, so it makes sense for a teacher to ignore it if you're closer to Latin America than Spain :)", "created_utc": "1666128582.0", "edited": "False", "id": "isuulxn", "is_submitter": "False", "link_id": "t3_y66rd5", "parent_id": "t1_isutfzt", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I'm on the website, not sure about mobile. On the right side there's a section labeled \"user flair preview\" and you can add it there :)\n\nThis subreddit specifically has flag icons, when you're editing your flair just type : and a letter to start searching. For example, the American flag is :en: for English", "created_utc": "1666128051.0", "edited": "False", "id": "isut9ok", "is_submitter": "False", "link_id": "t3_y7gdzc", "parent_id": "t1_isusp5a", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I never said it should teach the entirety of a language or a specific region 🤔 I'm actually looking to get to the end of the course specifically so I can then dedicate more time to studying the different variations is Spain, Mexico, and the rest of Latin America\n\nI simply pointed out vos(otros) wasn't included as proof that the course *doesn't* focus on a specific region, and in my original comment, I even said it's a *great foundation* for us to later expand on. I really am quite happy with the course as it is actually\n\nTo answer your question, personally I study Spanish because it unlocks my ability to connect to a huge number of people across the globe that English alone can't reach, I can gain a deeper understanding of their various cultures, I can experience some of my favorite content (ie video games) in a whole new way by switching the language, and it gives me the opportunity to be helpful in any situation where someone might speak Spanish but not English. I definitely plan on getting very familiar with both Spain & Mexico's varieties of Spanish if not other countries too, and I never expected to do that with just Duolingo\n\nKinda seems like you didn't fully understand my original comment haha", "created_utc": "1666126925.0", "edited": "False", "id": "isuqer8", "is_submitter": "False", "link_id": "t3_y66rd5", "parent_id": "t1_isufs5c", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Usually for multiple hours haha, I like to make a lot of progress at once (I take 1-2 days off per week and just do a simple practice to keep streaks). But I'm just very dedicated and lucky to have a lot of spare time, I wouldn't expect most people to do that much. Even just an hour a day would be more than most need imo :)", "created_utc": "1666121800.0", "edited": "False", "id": "isucvpx", "is_submitter": "False", "link_id": "t3_y7gdzc", "parent_id": "t3_y7gdzc", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "They teach you more than one word for the same thing so that you're prepared for more than one region's version of Spanish. I still think they should accept either word, though, it's unfortunate they don't. But maybe it's like that on purpose to make you learn the new word, not sure", "created_utc": "1666113318.0", "edited": "False", "id": "istr31w", "is_submitter": "False", "link_id": "t3_y7csdf", "parent_id": "t3_y7csdf", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Not sure if it'll have as much energy as you're expecting, but here's a Spotify playlist you can at least take a look at :) I listen to it while studying French, it's about 6hrs with about 100 songs\n\nhttps://open.spotify.com/playlist/6lqc2taSamCDTQ6raQkyZr", "created_utc": "1666110579.0", "edited": "False", "id": "istk39m", "is_submitter": "False", "link_id": "t3_y7bcga", "parent_id": "t3_y7bcga", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Probably a bug, or maybe the default answer somehow has an accidental Latin-alphabet vowel rather than a Cyrillic one", "created_utc": "1666095525.0", "edited": "False", "id": "isslic3", "is_submitter": "False", "link_id": "t3_y74eq3", "parent_id": "t3_y74eq3", "score": "10", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Each vocabulary word will be easier to remember the more you see it. You learn how to conjugate \"plays\" in the 3rd person singular. You learn how to place \"never\" in a sentence. \"Plays the piano\" is definitely something that might be said, so there you go, a whole phrase. You learn when to or not to use articles for both \"cat\" and \"piano,\" you learn which articles are used in a sentence like this in German. And it's just 1 more piece of exposure to German that will inevitably improve your skills. Silly sentences help you pay attention and make sure you understand everything instead of just putting in the most likely \"normal\" sentence\n\nIf you're just memorizing sentences, you're missing the point of learning a language. You should be learning vocabulary and understanding grammar so you can eventually understand any sentence or even come up with your own sentences", "created_utc": "1666095151.0", "edited": "False", "id": "isskufl", "is_submitter": "False", "link_id": "t3_y6xe56", "parent_id": "t3_y6xe56", "score": "7", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Hm, I guess I did take about 3-4 months of a biblical Greek class in high school and could read it fine, but definitely still less quickly than English. And that was for roughly 40 minutes of practice every day, 5 days a week, in a very personalized environment (3 students, one teacher). Everything we translated or studied, we read out loud for each other too, and I think having to read it out loud to the teacher & class helped me a lot with the speed of learning to read the letters\n\nMaybe it's possible to read as quickly as you want in such a short amount of time, but \"3 months\" also feels a bit vague to me; it'll take longer depending on your method or how much time you put in per day/week. I just don't think forcing yourself to go without audio etc is very helpful if your brain is telling you to seek it\n\nAnd I'm just still not sure it actually means reading as proficiently as you expect, or just being able to read well enough. Even with cyrillic after 14 months of study, I only read as quickly as English if I recognize all the words. New large words, I still slow down a lot on those and sound them out like a child would haha", "created_utc": "1666094006.0", "edited": "False", "id": "issivn4", "is_submitter": "False", "link_id": "t3_y6jxtv", "parent_id": "t1_iss6j96", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "PhantomWithin", "body": "Hm, I just wonder if that expects you to already have some proficiency in the language first? I don't really know much at all about it, though, so it's all speculation. Unless it says something about being able to read a language with a foreign alphabet, within 3 weeks without, any prior knowledge of the language, it probably expects some level of proficiency first imo", "created_utc": "1666043178.0", "edited": "False", "id": "isq6xzh", "is_submitter": "False", "link_id": "t3_y6jxtv", "parent_id": "t1_ispws13", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "PhantomWithin", "body": "Yes, you'll learn similar languages much faster, understand them much more, and therefore it'll be a lot harder to forget them. This has definitely been my experience with Dutch, being quite similar to English in a lot of ways. I don't feel like it takes much effort to get back into Dutch content after I've spent a few weeks working on my other languages. On the other hand, it's a lot easier for me to forget words in Russian or Ukrainian, since they're really different from English\n\nIf you don't want to have to put in so much manual effort and planning, I wouldn't recommend studying more than 2 languages at once. Studying 2 can be really great to prevent boredom or frustration with one language, because you can just go study the other for a bit, but more than 3 requires a huge amount of planning and time. I personally study 5 at once, and I definitely wouldn't have been successful if I hadn't been putting in purposeful effort most days of the week for multiple hours each day haha\n\nBut, maybe you can start some new languages after a few years. It becomes a lot harder to forget a language the more you've studied it, especially once you hit B2 level. So once you study a language for some years, you shouldn't have to maintain it very often and will have more time for new ones :)", "created_utc": "1666039116.0", "edited": "False", "id": "ispww5c", "is_submitter": "False", "link_id": "t3_y6iysn", "parent_id": "t3_y6iysn", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "PhantomWithin", "body": "I don't actually think there's anything wrong with wanting to listen. I think reading along with audiobooks is a great way to get your brain used to reading, I don't think that hinders progress at all, but might actually be very helpful for progress\n\nAnd from what you heard, are you sure they meant it only takes a few months to read quickly without even pronouncing in your head? Maybe they just meant you'd be able to read without confusing any letters or similar words after a few months?", "created_utc": "1666037660.0", "edited": "False", "id": "ispt5ia", "is_submitter": "False", "link_id": "t3_y6jxtv", "parent_id": "t3_y6jxtv", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "PhantomWithin", "body": "And it's good they accept it as a possible answer, but people only use it if they learned it somewhere else. The course itself never actually teaches it", "created_utc": "1666034273.0", "edited": "False", "id": "ispkha9", "is_submitter": "False", "link_id": "t3_y66rd5", "parent_id": "t1_ispi8xz", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "If you're already on the new path, I'm not sure if there's an option to scroll ahead to checkpoints and take a test to skip forward, but you can try that. Otherwise, you can always remove the German course from your account in the website settings and then re-add it, letting you take the placement test", "created_utc": "1666026506.0", "edited": "False", "id": "isp0ucz", "is_submitter": "False", "link_id": "t3_y6ggy7", "parent_id": "t3_y6ggy7", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "It has the purple ring around it, so it's probably just a visual bug. Try restarting the app, logging in on the website, or checking later to see if it fixes", "created_utc": "1666026156.0", "edited": "False", "id": "isozzrh", "is_submitter": "False", "link_id": "t3_y6gapy", "parent_id": "t3_y6gapy", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "No problem! :) GL with your studies!", "created_utc": "1666026061.0", "edited": "False", "id": "isozrmz", "is_submitter": "False", "link_id": "t3_y6fbf9", "parent_id": "t1_isoy0ft", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Yeah, on the website there's a list on the left,   \n\"Learn\"  \n\"Stories\"  \n\"Schools\"  \n...\n\nAt the bottom of that list, there should be a \"word\" section. It only has words you've been introduced to in that course so far. But, there are often duplicate words, and it seems that sometimes a few words were never properly included and won't show up, so it's not perfect, but it'll have almost all of them", "created_utc": "1666025977.0", "edited": "False", "id": "isozk5s", "is_submitter": "False", "link_id": "t3_y6g7i4", "parent_id": "t3_y6g7i4", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Так literally means \"so,\" even if there are a lot of other uses for \"так\" that \"so\" in English doesn't have\n\nВсё - Everything  \nне - not  \nтак - so  \nхорошо - good\n\n\"Everything is not good\" = \"Всё нехорошо\"", "created_utc": "1666023889.0", "edited": "1666024163.0", "id": "isoul2k", "is_submitter": "False", "link_id": "t3_y6fbf9", "parent_id": "t3_y6fbf9", "score": "18", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Got it, I'm not familiar with Italian so :) in that case they should report it & hope Duo adds it as a possible correct option", "created_utc": "1666012596.0", "edited": "False", "id": "iso5eny", "is_submitter": "False", "link_id": "t3_y66ipi", "parent_id": "t1_iso070g", "score": "3", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I'm roughly 60% done with the course, haven't completed it yet. But I think the point is to teach something in between the various different versions of Spanish so that the learner can generally understand most varieties. It gives us a great foundation to expand into any specific region's variety once we start studying beyond Duolingo\n\nOne interesting thing, they never introduce \"vos\" (a common substitute for \"tú\" in South American countries). They also never introduce \"vosotros\" (\"ustedes\" for friends used in Spain), so it seems pretty clear to me that they don't want to settle on just one region or another", "created_utc": "1666002450.0", "edited": "False", "id": "isnotn0", "is_submitter": "False", "link_id": "t3_y66rd5", "parent_id": "t3_y66rd5", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Duo doesn't insist it across every language, it depends on the language. My guess is just that it'd sound weird without the pronoun in this language, while of course the Spanish course always let's you leave them out", "created_utc": "1665999828.0", "edited": "False", "id": "isnlozm", "is_submitter": "False", "link_id": "t3_y66ipi", "parent_id": "t3_y66ipi", "score": "1", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Well, \"mir ist warm\" is correct for \"I feel warm.\" But yeah, either way you just need to get used to how German expresses some things differently :) as is true with any language", "created_utc": "1665999286.0", "edited": "False", "id": "isnl2h7", "is_submitter": "False", "link_id": "t3_y5l8s6", "parent_id": "t1_ismq5ae", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "The correction is still formal. Without \"está\" it's incorrect, just like the other comment says  \nCómo - How  \nestá - are  \nusted - you  \nseñor - mister  \nAlbert - Albert\n\nInformal: \"¿Cómo está***s*** (tú)?\" with an S", "created_utc": "1665957214.0", "edited": "False", "id": "islk03g", "is_submitter": "False", "link_id": "t3_y5sp9v", "parent_id": "t3_y5sp9v", "score": "6", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "That's normal, Duolingo is just a resource for vocabulary and grammar.   \nIt's up to you to try thinking of your own sentences outside of Duolingo, practice writing your own sentences, and most importantly, try speaking with Spanish speakers. Fluency comes with making yourself speak until you stop making mistakes, not from studying with only one resource", "created_utc": "1665954676.0", "edited": "False", "id": "isldxkx", "is_submitter": "False", "link_id": "t3_y5rpwa", "parent_id": "t3_y5rpwa", "score": "17", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "I believe the Stylish Chrome extension might have something like that if you use the website. Install Stylish and then look for \"Duolingo difficulty improver\"\n\nAlso, you can just choose to type everything instead of use the word bank at all. This feature is within Duolingo's website itself (look below the word bank)", "created_utc": "1665954453.0", "edited": "1665955838.0", "id": "islde72", "is_submitter": "False", "link_id": "t3_y5ri0s", "parent_id": "t3_y5ri0s", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "But wouldn't forcing her to remove it be stealing her freedom too? Shouldn't Zari have the choice about whether she wants to wear it or not?\n\nThat's more what the protests are about, giving women the equal freedom to choose that men already have. Forcing someone not to wear it is the same as forcing them to wear it. Wearing the hijab is still something many Muslims outside of iran choose to wear for their religion, which is completely separate from iran's oppressive regime that uses Islam as a cover for their oppression", "created_utc": "1665945922.0", "edited": "False", "id": "iskr2or", "is_submitter": "False", "link_id": "t3_y5o027", "parent_id": "t3_y5o027", "score": "33", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Yes, \"mich\" is considered reflexive in \"ich liebe mich\"\n\nIt's reflexive because it's \"ich...mich.\" Both are you, it \"reflects\" the subject.  \nSo, if you were to say \"ich liebe dich,\" it's not reflexive anymore, because the object is different from the subject\n\nSome verbs change meaning if you leave out the reflexive pronoun:  \n\"Ich fühle mich glücklich\" talks about what emotion you feel.  \n\"Ich fühle glücklich\" would sound weird, a bit like you're touching \"happy\" with your hand, but not that you feel happy\n\nHopefully that all makes sense and clears it up for you :)", "created_utc": "1665939667.0", "edited": "False", "id": "iskaghj", "is_submitter": "False", "link_id": "t3_y5l8s6", "parent_id": "t1_isk8yrc", "score": "2", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Reflexive verbs require a reflexive pronoun. And a reflexive pronoun is the piece that isn't the verb.  \nThink about \"I wash\" (what do I wash?) versus \"I wash myself.\"  \n\"Myself\" is the reflexive pronoun and \"to wash oneself\" is the reflexive verb\n\n\"Ich fühle mich besser\" (I feel better)  \nIf I were to put just \"Ich fühle besser\" it would mean that I feel some***thing*** (like an object) with better clarity or detail.  \nBut, the reflexive pronoun \"mich\" (myself) is required when talking about my own emotions or about whether I feel sick or healthy", "created_utc": "1665938873.0", "edited": "False", "id": "isk8h7j", "is_submitter": "False", "link_id": "t3_y5l8s6", "parent_id": "t3_y5l8s6", "score": "4", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}, {"author": "PhantomWithin", "body": "Short answer: No.  \nNo one program or website will ever be enough for fluency, that takes a lot of practice actually speaking in the language\n\nLonger answer:  \nDuolingo is a great source for vocabulary & grammar, but that's it. You'll still lack vocabulary and real-time practice. While using Duolingo, you should listen to the language as much as possible (music, audiobooks, videos, live streams, anything). You'll also benefit a lot if you use other websites/programs to learn at the same time.  \nI personally really like playing video games in the target language, starting out with reading-heavy games so that I can take my time translating new words, and moving on to choice-heavy games once I understand a lot to test my comprehension level\n\nAlso, any courses with less than 4 units (based on the old tree layout) might not give you the best grasp on the language and you'll definitely be lacking with just Duo.   \n6+ units are really great courses in my experience\n\nMy course experience (since starting in August 2021):  \nDutch 6/6 units to legendary, Russian 4/4 units to legendary, Ukrainian 3/3 units to legendary, Latin 2/2 units to gold,   \n6/10 units in French to gold, almost 6/10 units to gold in Spanish.  \nI can understand a lot of Dutch, and it's taken me months after finishing the Russian course to start understanding Russian to roughly the same level.   \nI felt like I barely knew any Ukrainian or Latin after finishing the courses.   \nI can understand a decent amount of spoken French, some spoken Spanish, and a lot of written French & Spanish.   \nI still write/think slower in all the languages than I'd like to, Dutch being my best & Russian catching up\n\n(edits were for clarification & typos)", "created_utc": "1665928466.0", "edited": "1665937905.0", "id": "isjjhn9", "is_submitter": "False", "link_id": "t3_y5gmjp", "parent_id": "t3_y5gmjp", "score": "11", "subreddit": "duolingo", "subreddit_id": "t5_2t6ze"}]