[{"author": "pinkusocks", "body": "I kind of get it, yeah, it is likely that everything will come back to a post-capitalist society eventually just because everything everywhere workd on cycles kind of. But you pretty much contradicted yourself saying we should just let it happen and now you say we can intervene, of course we can, and I think that's mostly what I thought about when writing the bit about tiny communes (mostly eco-sociallists in nature) that are all around the globe, wish they could maybe start spreading and organizing to help or inform outsiders to get a more homogeneous thought in terms of sociopolitics (left leaning) and that could maybe help implement more and more things till we figure maybe the state isn't necessary as a whole, etc. but as I said, it's a bit difficult given the people that have all the power would do anything to stop us since the beginning and would not agree themselves to get their status and money and everything to a level where they're seen as the same or less than what they were before. <-course that could get done if eventually we have a likeminded individual in a high political place but as I said, I personally think it would not happen that way or it would just take too long, same with just waiting for our society to shift towards a communist society, we go back to what we used to be, yes, but it usually takes around the same time than it did for it to completely shift to full on capitalism.", "created_utc": "1665407071.0", "edited": "False", "id": "irr8of3", "is_submitter": "False", "link_id": "t3_x2y83m", "parent_id": "t1_irpr7si", "score": "1", "subreddit": "anarchocommunism", "subreddit_id": "t5_2s22l"}, {"author": "pinkusocks", "body": "I would personally say yes to the specificity if their apparent economic system, unsure of how it would be politically and humanistically since they don't really talk about mutual aid nor the posibility that there's someone of power above them in any sense but I think this is one of the definitions for communism \"we don't use money\" and \"we take things as we need them\" is pretty much about as anticapitalistic as it gets transaction-wise.", "created_utc": "1665328860.0", "edited": "False", "id": "irn5tvb", "is_submitter": "False", "link_id": "t3_xqzz2o", "parent_id": "t3_xqzz2o", "score": "2", "subreddit": "anarchocommunism", "subreddit_id": "t5_2s22l"}, {"author": "pinkusocks", "body": "people just love forcing themselves to pay, it would be difficult to agree on no wage without changing our current system (politically speaking) gobernments would be like yeah no, thanks, we have more resources than others if we keep waged labor, lol", "created_utc": "1665328253.0", "edited": "False", "id": "irn4flf", "is_submitter": "False", "link_id": "t3_x0c6qe", "parent_id": "t1_imbnloa", "score": "1", "subreddit": "anarchocommunism", "subreddit_id": "t5_2s22l"}, {"author": "pinkusocks", "body": "aaaaand I think people may have gotten a bit mad at you cause you're either mixing concepts, using basic theory and/or using someone else's personal defition for things (I read a comment where you said something about Egels) and some people agree on the definitions of most labels to an extent just like the other post in this subreddit that said something about Marx being an anarchist whereas no, that's just not true cause of the bare definition of how his ideology conflicted with anarchism.", "created_utc": "1665328143.0", "edited": "False", "id": "irn46al", "is_submitter": "False", "link_id": "t3_x2y83m", "parent_id": "t1_irn3sj7", "score": "1", "subreddit": "anarchocommunism", "subreddit_id": "t5_2s22l"}, {"author": "pinkusocks", "body": "also, this is kind of the reason we have small communes that help eachother and subsist mostly without interacting with the outside system, we must prove in a small portion of the population if this can be made, that's why it's not a thing that \"just happens\", I view them a bit as tiny experiments:)", "created_utc": "1665327976.0", "edited": "False", "id": "irn3sj7", "is_submitter": "False", "link_id": "t3_x2y83m", "parent_id": "t1_irn3jp3", "score": "1", "subreddit": "anarchocommunism", "subreddit_id": "t5_2s22l"}, {"author": "pinkusocks", "body": "I think I get what you're trying to say but used the wrong terms and honestly this isn't a realistic idea nor what most people think when they sel identify as communists/nor how anarchists would view it even.  \nI may get this wrong but if you mean we should be able to just eventually delve into a communist society (trough intentional changes to contrarrest what we dislike about the system) but not planning it exactly nor wording it as \"a revolution to contrarrest capitalism with communism!\" then that's just not realistic, in a uthopic world where we have nno set definitions or labels for these political ideologies/systems, and/or we have yet to be fully exposed into a capitalistic society maybe it would, we would all (for the most part) just agree that we need to have a balanced and ethic society in terms of socioeconomical hierarchy and resources.  \nIf you actually mean we now could be able to do this, just go into a communistic society without being concious of how and why we're doing this (other than the basis of disliking hierachies and the difference in opportunities for the proletariat and lower classes against those above us), then no, we have already labeled these things and we're all much too aware of how they work, and because of the intrinsic meanings of how our countries are run (which just so happen to be the reasons we dislike the system) we just can't. Hierarchies exist, and have existed since the dawn of times for the most part, all the way from monarchies, to feudalism, to the proletariat after the industrial revolution and even now with presidents and senators, etc. Despite having divided the burgouise into a wider group of people we still have borders and laws than rely under their power, and don't forget they also have the power over military resourses and personell, which takes us to: the only choice and way to change our system is to unionize, organize and after finding a common goal and approach, overtrown the local regime (or start an international revolution, depending on the ideology).  \n**TL;DR** our own history and current system is why we need to go trough unions and have a name and set of common ideals to carry a communist society and we can't do what you propose.", "created_utc": "1665327871.0", "edited": "False", "id": "irn3jp3", "is_submitter": "False", "link_id": "t3_x2y83m", "parent_id": "t3_x2y83m", "score": "1", "subreddit": "anarchocommunism", "subreddit_id": "t5_2s22l"}, {"author": "pinkusocks", "body": "You don't neccessarily have to use all fo the specifications and possible objects of intention when doing a spell or ritual although it would be more intense or specific if you did on most people's perspective of how energies work. I personally would use a crescent moon if anything, and ideally maybe a time of the year where the sun is actually coming up (as in the other half of the year, opposite to samhain).  \nAs a quick tip to learn magickal properties easily: take the most literal way of seeing anythign and use it as a methapor, for example, a full moon is complete round so it would be useful for getting things finished, done, wealth and health since it represent something that doesn't lack or need anything.", "created_utc": "1664840850.0", "edited": "False", "id": "iqy9gn1", "is_submitter": "False", "link_id": "t3_xscx2f", "parent_id": "t3_xscx2f", "score": "2", "subreddit": "SASSWitches", "subreddit_id": "t5_1prxu9"}, {"author": "pinkusocks", "body": "this is a bit late but although the ashes coming from a certain incense/herbs (that carry an intention) would be great, the colour magick of having salt that is lack is in itself great for using as an alternative to common white salt.", "created_utc": "1664840108.0", "edited": "False", "id": "iqy7w88", "is_submitter": "False", "link_id": "t3_wz9y9o", "parent_id": "t1_im1kaxp", "score": "1", "subreddit": "witchcraft", "subreddit_id": "t5_2s0ge"}, {"author": "pinkusocks", "body": "Try to keep your logical thinking above all, this is not to say you can't have daily spells or small situalsitic things, what I mean is to not make yourself think everything has to have either a magickal solution or a witchy origin: having bad luck for a few days, you must have been cursed! have to go somewhere, you MUST do a cleansing and a protection spell and a good luck one and etc.  \nKeep yourself grounded and do things as you see fit but don't overdo them, remember not only it may end up doing nothing, it drains your energy too. Take care and good luck in your path <3", "created_utc": "1664839140.0", "edited": "False", "id": "iqy5t90", "is_submitter": "False", "link_id": "t3_xo4nr6", "parent_id": "t3_xo4nr6", "score": "2", "subreddit": "WitchesVsPatriarchy", "subreddit_id": "t5_p3r73"}, {"author": "pinkusocks", "body": "Gonna answer myself to explain why I did, I've always loved watching musicals and seeing people perform in the streets, just recently I got to start practicing for a small version of Avenue Q and sitting with everybody singing the maing song felt like I type of joy I had never experienced before. It made me realize why there's so many hardcore musical theatre kids, lol", "created_utc": "1664837813.0", "edited": "False", "id": "iqy2y0r", "is_submitter": "True", "link_id": "t3_xuy2ky", "parent_id": "t3_xuy2ky", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "pinkusocks", "body": "esto es muy viejo pero si el nene es autista, la música al palo probablemente lo altere más y la familia ande más densa para \"calmarlo\" además de que hay un componente genético en el TEA y capaz que otro/s de la familia se pongan más nerviosos con la música", "created_utc": "1661768633.0", "edited": "False", "id": "im8maqi", "is_submitter": "False", "link_id": "t3_eyu6hx", "parent_id": "t1_fgjatu2", "score": "1", "subreddit": "argentina", "subreddit_id": "t5_2qlht"}, {"author": "pinkusocks", "body": "HAD FORGOTTEN ABOUT THAT, but yea.", "created_utc": "1660417505.0", "edited": "False", "id": "ik5ufed", "is_submitter": "True", "link_id": "t3_u6o49b", "parent_id": "t1_ijeau2m", "score": "1", "subreddit": "community", "subreddit_id": "t5_2qu49"}, {"author": "pinkusocks", "body": "also, I tend to interact with mentally ill and ND people, and my dad has a lot of ASD-adjacent traits so I end up thinking if my way of being is really different since I don't know many other people who are NT and had my experiences (no one in my family is diagnosed) so", "created_utc": "1660417374.0", "edited": "False", "id": "ik5u485", "is_submitter": "False", "link_id": "t3_vooswi", "parent_id": "t1_ik5tvdp", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "pinkusocks", "body": "I have some things that do  fit into stereotypes quite well but I'm still afraid i might be somehow faking how I feel and process things, i know it doesn't make sense but i often doubt that it's ASD and not so much how I interact and perceive the world per se (I know I'm hypersensitive, I know I struggle with socialization, etc) I just have intrusive thoughts about \"what if it's not this? what if I'm exaggerating?\" I know how I feel and act isn't actually the norm so I get those thoughts out of my head in little time but they keep coming back.\nFor now I'm selfdiagnosed but I'll get my ADOS results this week so I might update this comment if I remember it, lol", "created_utc": "1660417272.0", "edited": "False", "id": "ik5tvdp", "is_submitter": "False", "link_id": "t3_vooswi", "parent_id": "t3_vooswi", "score": "1", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "pinkusocks", "body": "I didn't understand what you meant at first but YES, this would be so useful! I hope I someday find something like this, and if I do, I'll make sure to share it in the subreddit", "created_utc": "1660133158.0", "edited": "False", "id": "ijpi4ii", "is_submitter": "False", "link_id": "t3_wk664r", "parent_id": "t3_wk664r", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "pinkusocks", "body": "obviously what I'm saying refers more to rewarding small milestones rather than big ones, if someone wants to celebrate getting to B2/C1 or passing an exam like toefl, jplt, whatever, I find it reasonable as those are important things to get done just oncen", "created_utc": "1660132339.0", "edited": "False", "id": "ijpgoax", "is_submitter": "False", "link_id": "t3_wk2x43", "parent_id": "t1_ijpgel6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "pinkusocks", "body": "kinda going on a tangent here but, that's exactly what happens when autistic people go through ABA therapy, often people say it's a reformed/newer version and that there's no punishments, only rewards. But a lot of people have spoken out about how it makes you feel like you'd deserve a reward whenever you do x thing right, and when you are done studying the language you may end up with that feeling too (if I'm not misinterpreting it). Ex: you reward yourself each time you can do something, present yourself, order something, etc. when you're out there in the world interacting with someone in your TL you may feel like you're not doing things right or that you're lacking something cause people don't reward you for giving the right answer irl.", "created_utc": "1660132186.0", "edited": "False", "id": "ijpgel6", "is_submitter": "False", "link_id": "t3_wk2x43", "parent_id": "t1_ijmbk8u", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "pinkusocks", "body": "I would really love to be able to speak them but I also have anxiety so it's really hard for me to maintain a conversation with a stranger, unless it's somehow scripted or I don't feel pressure (ex. I could kind of talk to a homeless man who approached me and started talking about his family, etc. but I can't talk much to doctors or I struggle making appointments) so if a foreigner asked for direction I might feel anxious and not be able to speak much 💀\nOn the other hand, yes, I would very much be glad to understand the languages I'm learning to consume their media, and in the case I may travel someday understand what's surrounding me.", "created_utc": "1660131437.0", "edited": "False", "id": "ijpf4ez", "is_submitter": "False", "link_id": "t3_wksyqt", "parent_id": "t3_wksyqt", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "pinkusocks", "body": "Es un capo explicandose y como trabaja también aparentemente, había visto una masterclass de él y me pareció que posta sabe del tema, solamente le tocaron guionistas y directores pelotudos", "created_utc": "1659048176.0", "edited": "False", "id": "ii1wz3i", "is_submitter": "False", "link_id": "t3_h9uibj", "parent_id": "t1_fuzxztf", "score": "1", "subreddit": "argentina", "subreddit_id": "t5_2qlht"}, {"author": "pinkusocks", "body": "This is quite old, lol. But after a while of not understanding sarcasm I started asking and googling how it worked and I for a while was a sarcastic a hole all the time, I still dont pick up on other people's sarcasm until they have a really notable \"tone\"", "created_utc": "1656793385.0", "edited": "False", "id": "iem8cyv", "is_submitter": "False", "link_id": "t3_hsg5sq", "parent_id": "t1_fyd299w", "score": "2", "subreddit": "daria", "subreddit_id": "t5_2sgsq"}, {"author": "pinkusocks", "body": "on this genre, there's also Jawbreaker  Heathers and The babysitter which are all more comedy/crime or horror but still really good within that style of murdering teens. The last one has a sequel and they're really a parody of this type of films to an extent.", "created_utc": "1656587736.0", "edited": "False", "id": "ieaz66q", "is_submitter": "False", "link_id": "t3_d8omqc", "parent_id": "t1_hrvh82j", "score": "1", "subreddit": "RedLetterMedia", "subreddit_id": "t5_2tuot"}, {"author": "pinkusocks", "body": "I have a few things filled with movies(around 5 folders) in my parents' house but I have around 10 movies with me only:(I miss my DVDs and wish I had more here djdnjxmd nice collection", "created_utc": "1656339881.0", "edited": "False", "id": "idxl0q1", "is_submitter": "False", "link_id": "t3_r9mg08", "parent_id": "t3_r9mg08", "score": "1", "subreddit": "AutisticPride", "subreddit_id": "t5_12pesv"}, {"author": "pinkusocks", "body": "Mine are something along witchcraft, cinematography, Bowie, Jim Henson, 80s, autism itself and time travel. A lot of this can be connected or delved into sub interests? Because of Bowie's popularity during the 80s I got into toys from that era, and movies like Labyrinth mix cinematography, the 80s, Henson, Bowie AND witchcraft.\nThere's things like that that mix all of it and it makes me so excited to talk about because it blows my mind how interconnected all seemingly different interests can be.", "created_utc": "1656339063.0", "edited": "False", "id": "idxj5p7", "is_submitter": "False", "link_id": "t3_vi5915", "parent_id": "t3_vi5915", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "pinkusocks", "body": "I agree with how he'll have to live with climate change and I understand that it's not the best scenario. I think the \"chances are slim to none\" is either an exaggeration or you misunderstood ny original comment, I have been already researching about 4 or 5 existing ecovillages close to where I live and even if I dont end up moving I know I'll start up a sort of mutual aid alliance with friends in the same mindset to try and avoid as much of what I mentioned as is in my power", "created_utc": "1656336818.0", "edited": "False", "id": "idxeaox", "is_submitter": "False", "link_id": "t3_vkzxua", "parent_id": "t1_idx6rdc", "score": "1", "subreddit": "Anarchism", "subreddit_id": "t5_2qh5j"}, {"author": "pinkusocks", "body": "NTA. Maybe he's uncomfortable with how his clothes feel? have you tried big sizes, cotton clothing, etc.? I'm autistic and my bf apparently isn't autistic, but he has some sensory sensitivity, and he always says he can feel how the clothes is touching his body at all times and how he'd only be better naked but he can rationalize and knows he can't just strip naked but it keeps him constantly on a bad mood lowkey. Maybe your son is feeling bad about the texture of the sizes of the clothing, some use bigger clothes and some use just the right size so they feel a bit of compression.\nGood luck and I hope this is a good solution, if he starts having meltdowns about not being able to get the overalls off it may be worth trying the things I mentioned  /gen", "created_utc": "1656335386.0", "edited": "False", "id": "idxbf2a", "is_submitter": "False", "link_id": "t3_vgwcl4", "parent_id": "t3_vgwcl4", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "pinkusocks", "body": "Likes:\n•Watching and analizing movies and series.\n•Mint chocolate chip ice cream.\n•Witchcraft.\n\nDislikes:\n•Sticky things.\n•Having to choose.\n•People who lie.", "created_utc": "1656333465.0", "edited": "False", "id": "idx7ug1", "is_submitter": "False", "link_id": "t3_v75fca", "parent_id": "t3_v75fca", "score": "1", "subreddit": "aspergirls", "subreddit_id": "t5_31zba"}, {"author": "pinkusocks", "body": "I actually really liked the show, there were a few people who identified with  (can't remember their names) but I disliked the format of \"the like x and and y, and dislike THUNDERSTORMS AND THE TEXTURE OF x\" they're mixing preferences and sensory sensitivities. Also the woman from the Australian version who \"helped\"them seemed a bit ableist with how she said they were meant to interact  which made no sense because she was teaching them to socially communicate as a NT when they'll be dating other autistic people.\nSome parents where infantilizing them too, it made me mad how they dismissed them or thought they were oh such funny childs.", "created_utc": "1656333194.0", "edited": "False", "id": "idx7d8x", "is_submitter": "False", "link_id": "t3_v6x08p", "parent_id": "t3_v6x08p", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "pinkusocks", "body": "NTA. you clearly asked her politely if she wanted to leave, if you made her go home with you she'd have been mad too. There was no way of that situation with her attitude.", "created_utc": "1656332294.0", "edited": "False", "id": "idx5up5", "is_submitter": "False", "link_id": "t3_vljn2x", "parent_id": "t3_vljn2x", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "pinkusocks", "body": "- Barely taking to anyone (including my parents) until high school,  unless it was about a special interest/hyperfixation. \n-My first grade teacher telling my parents I would be looking outside and not at her.\n- Not sharing my stuff, mainly toys.\n- Not even using my toys much, I remember I wanted to be a collector and I'd leave them in shelves. \n- Memorizing my favorite movies. \n- Always doing that thing in swings where you twist it? and start spinning. \n- going to random kids at parks and telling them to be my friend out of nowhere.", "created_utc": "1656331436.0", "edited": "False", "id": "idx4gov", "is_submitter": "False", "link_id": "t3_vhee4r", "parent_id": "t3_vhee4r", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "pinkusocks", "body": "I have someone in my friend group who told me not explicitly to stop being autistic but that I had been \"given everything I wanted as a child\" and that  was why I avoided some foods. Just realized she's most likely just ableist cause one of my friend's in that group has an autistic bf and she shushed him and told him to stop talking so loud in a bad manner when he clearly can't control his voice volume.", "created_utc": "1656328354.0", "edited": "False", "id": "idwzw1y", "is_submitter": "False", "link_id": "t3_sfk5am", "parent_id": "t3_sfk5am", "score": "2", "subreddit": "autism", "subreddit_id": "t5_2qhs6"}, {"author": "pinkusocks", "body": "they have discovered our true form! now we can't come back to our jello bodies after a day out, damn /s", "created_utc": "1656326819.0", "edited": "False", "id": "idwxv0b", "is_submitter": "False", "link_id": "t3_vbqddu", "parent_id": "t3_vbqddu", "score": "1", "subreddit": "aretheNTsokay", "subreddit_id": "t5_2ykjpi"}, {"author": "pinkusocks", "body": "I think antinatalist, as long as it's a personal choice, are okay. I had my first and only child a few months ago and I'm really happy, I also want him to be raised as a free and respectful being, HOPEFULLY want to live in a commune with mutual aid so we eventually don't need to actively interact with a capitalistic system most of the time but I understand why people chose not to have children.", "created_utc": "1656257929.0", "edited": "False", "id": "idtekr4", "is_submitter": "False", "link_id": "t3_vkzxua", "parent_id": "t3_vkzxua", "score": "60", "subreddit": "Anarchism", "subreddit_id": "t5_2qh5j"}, {"author": "pinkusocks", "body": "I had a child last january and I'm on my way of getting my diagnosis, I've been researching over 5 years and my psychologist agrees that I have the traits but nothing formal yet. I won't mind if my child grows up to be disabled in any way shape or form, I'm learning my country's sign language so I'm also mentally prepared if eventually a doctor tells us he's deaf or hoh.\nI only felt a bit afraid of having a child with opposite necessities, is he's hiposensitive and needs noise and lights to function then I'd have to find a way of accommodating him without putting mine and my partner's hypersensitivity at risk (a parent who's going through burnout or shutdown wouldn't be really good)", "created_utc": "1654625490.0", "edited": "False", "id": "ibijlkk", "is_submitter": "False", "link_id": "t3_v6ot6t", "parent_id": "t3_v6ot6t", "score": "2", "subreddit": "aspergers", "subreddit_id": "t5_2rm6u"}, {"author": "pinkusocks", "body": "I say I'm autistic but clarify that I'm working on my diagnosis with a psychologist still, it's been 5 years or more of research so I'm pretty sure that I'm autistic but yeah. Still have to clarify in case, or because NT people can judge a lot", "created_utc": "1654621177.0", "edited": "False", "id": "ibi9e4y", "is_submitter": "False", "link_id": "t3_v3y117", "parent_id": "t3_v3y117", "score": "1", "subreddit": "AskAutism", "subreddit_id": "t5_3lm6p"}, {"author": "pinkusocks", "body": "a lot of final destination scenes, I realized most of my phobias came from there after a while (mechanical staircases, elevators, etc)", "created_utc": "1654619764.0", "edited": "False", "id": "ibi617b", "is_submitter": "False", "link_id": "t3_v6qlx5", "parent_id": "t3_v6qlx5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "pinkusocks", "body": "I love Back to the future, don't get me wrong but it makes no sense. I know it's just a movie (trilogy) but at the beginning they explain time travel as in it affects the current timeline and that's why the main characters could see how it affected them (vanishing from a photo) and then in the next movie they say that a new event creates a separate timeline and ? that would make the most sense inse he goes back in time and if the events had changed, he wouldn't be there.\nThey could be seen as visually 2 different ways of interacting with time, one is like a line that goes back (that's why he doesn't instantly disappear from existence but rather time flows at the same time in two different points, at least) and the other is a series of branches of different events that can't avoid each other from happening. Marty should have stayed alive if he was from a different timeline 🤷🏻‍♂️", "created_utc": "1654619206.0", "edited": "False", "id": "ibi4prj", "is_submitter": "False", "link_id": "t3_v6vtg8", "parent_id": "t3_v6vtg8", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "pinkusocks", "body": "[TW:abuse, r4pe, ptsd]\nI was abused at a young age by one of my cousins, he kept saying how ugly and weird I was but raped me more than once when I was around 6 to 10 yo (I'm unsure of when exactly it was). I had been bullied in school too for being ugly and I think I didn't react much to what happened because it felt like the only validation I could get at that point.\nA few years passed and I felt like I couldn't talk to anyone about it because it seemed like it was partially my fault to not stop it or speak up at the time, and I didn't think it was affecting me cause I only remembered it happened every once in a while. Around age 18 I started getting flashbacks (visual and emotional) and would start crying when I was with my partner, I needed up telling my psychologist and parents when I turned 19, i kept seeing him in family gatherings until last year.\nI still have flashbacks every now and then and really don't feel like I can fully trust people because of that, had nightmarea of other people abusing me, and i get intrusive thoughts of people hurting my son now as I'm afraid of him going through the same thing I did.", "created_utc": "1654616931.0", "edited": "False", "id": "ibhzeti", "is_submitter": "False", "link_id": "t3_v6ozs3", "parent_id": "t3_v6ozs3", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "pinkusocks", "body": "I was trying to germinate some seeds and left them cause i had to go back to my parents house for a bit cause my partner's family got covid BUT my pepper seeds are actually okay still! so I'm excited about that and I've been collecting clothes and talking to people to try to organize for sewing/mending clothes for people who may not have access to it during the winter here. Was hoping I'd get to a point where I could also go out to share food with homeless people but unfortunately I wouldn't be able to do it unless people donate smth cause I'm not in the best position economically either :(\nAlso being seeing a lot about ecovillages and made me want to join/start one  haha", "created_utc": "1654612739.0", "edited": "False", "id": "ibhpx23", "is_submitter": "False", "link_id": "t3_v5a7b0", "parent_id": "t3_v5a7b0", "score": "4", "subreddit": "solarpunk", "subreddit_id": "t5_34bsb"}, {"author": "pinkusocks", "body": "I'm really loving \"Sincerely your autistic child\" and \"But you don't look autistic at all!\", really connected with both books/ authors.", "created_utc": "1654612419.0", "edited": "False", "id": "ibhp7p0", "is_submitter": "False", "link_id": "t3_o47b4a", "parent_id": "t3_o47b4a", "score": "1", "subreddit": "aspergirls", "subreddit_id": "t5_31zba"}, {"author": "pinkusocks", "body": "RIGHT, when I saw that episode I remembered I used to think that too, lmao", "created_utc": "1650574490.0", "edited": "False", "id": "i5nzks2", "is_submitter": "True", "link_id": "t3_u6o49b", "parent_id": "t1_i5ilal0", "score": "2", "subreddit": "community", "subreddit_id": "t5_2qu49"}, {"author": "pinkusocks", "body": "I think this is just diagnosis parameters getting better,but also autism is a type of neurodivergency (so not a \"mental health problem\") and it's been demonstrated that it's really likely genetic; there's also an increase in adults getting diagnosed because their children are getting theirs and they realize they've been ignoring how they acted because they thought everyone was like that", "created_utc": "1650515699.0", "edited": "False", "id": "i5ku8bm", "is_submitter": "False", "link_id": "t3_t5tfqz", "parent_id": "t3_t5tfqz", "score": "1", "subreddit": "conspiracy", "subreddit_id": "t5_2qh4r"}, {"author": "pinkusocks", "body": "I really liked \"you me her\" despite how many mistakes the characters make within the relationship, I think it's a bit realistic from people who aren't usually in open/poly relationships to do the things they did in the show and I despise some of it but it makes them more than just \"perfect representation\"", "created_utc": "1650515353.0", "edited": "False", "id": "i5ktmvo", "is_submitter": "False", "link_id": "t3_u879tv", "parent_id": "t3_u879tv", "score": "3", "subreddit": "polyamory", "subreddit_id": "t5_2qu5n"}, {"author": "pinkusocks", "body": "going out with someone with a certain intention (sexual or romantic) and not talking about it beforehand, I know sometimes things don't go as planned but overall not saying how you feel about a certain person on purpose is considered cheating for me", "created_utc": "1650515086.0", "edited": "False", "id": "i5kt60d", "is_submitter": "False", "link_id": "t3_u81ye3", "parent_id": "t3_u81ye3", "score": "3", "subreddit": "polyamory", "subreddit_id": "t5_2qu5n"}, {"author": "pinkusocks", "body": "Having different clothes for different situations, I get \"formal places\" where you can't dress like you're going to a night out, but also sometimes I want to go to the mall in big boots, full makeup and my nicest clothes or went to school in pajamas cause I was comfortable like that and didn't know how much was too much and I was feeling specifically anxious about standing out?\nEDIT: also I almost didn't wear nice clothes to my graduation cause I thought no one would dress THAT nice and everyone was in suits and dresses", "created_utc": "1650411965.0", "edited": "False", "id": "i5ewdjk", "is_submitter": "False", "link_id": "t3_t9gyoo", "parent_id": "t3_t9gyoo", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "pinkusocks", "body": "btw, sorry if you like his character and don't see this as a possibility but this is literally just a theory 🐇🌸", "created_utc": "1650410959.0", "edited": "False", "id": "i5eu18f", "is_submitter": "True", "link_id": "t3_u6o49b", "parent_id": "t1_i5a5tk7", "score": "2", "subreddit": "community", "subreddit_id": "t5_2qu49"}, {"author": "pinkusocks", "body": "it's actually a bit more like (a likeable character), is (like an underrepresented minority) because of (this evidence which apparently other commenters have noted) and regardless of (some stuff) cause not everyone is the same? not even canon ND characters are exactly the same 🤨", "created_utc": "1650410915.0", "edited": "False", "id": "i5etxli", "is_submitter": "True", "link_id": "t3_u6o49b", "parent_id": "t1_i5a5tk7", "score": "6", "subreddit": "community", "subreddit_id": "t5_2qu49"}, {"author": "pinkusocks", "body": "I AGREE. And I had forgotten Dan was autistic himself and how there's so many of his characters that people see as autistic coded (like Rick) 😂", "created_utc": "1650410664.0", "edited": "False", "id": "i5etcnh", "is_submitter": "True", "link_id": "t3_u6o49b", "parent_id": "t1_i5b7ajb", "score": "7", "subreddit": "community", "subreddit_id": "t5_2qu49"}, {"author": "pinkusocks", "body": "I forgot about the pillow thing, and I agree about the experiment thing, I probably would have an attack after waiting for an hour or Smith, I'm a bit strong willed but not near as much", "created_utc": "1650410575.0", "edited": "False", "id": "i5et59k", "is_submitter": "True", "link_id": "t3_u6o49b", "parent_id": "t1_i5cnopa", "score": "1", "subreddit": "community", "subreddit_id": "t5_2qu49"}, {"author": "pinkusocks", "body": "mine too! they really are in a lot of episodes the ones who seem to get the group together, and their friendship alone is really fun, the scenes they have together are my favourites overall", "created_utc": "1650322842.0", "edited": "False", "id": "i59ps7e", "is_submitter": "True", "link_id": "t3_u6o49b", "parent_id": "t1_i59o1gm", "score": "8", "subreddit": "community", "subreddit_id": "t5_2qu49"}, {"author": "pinkusocks", "body": "I was unsure about having children for a while, I'm trans and I thought that I could never stand going through a pregnancy, but I'm now having a child in January and I'm really happy about it. Am I worried about the responsibilities? yes, but I'm also excited to be going through all of this with my partner(s) and I know my family and friends are there to support me too.\nAnd about marriage, since I'm poly idk what to do, I would like to have a symbolic ceremony with both my partners and to be legally married to the father of my child would be the most convenient thing (because of hospital stuff, etc) 😂 they're also both infp! so we were all worried when we foun out about the baby, lol", "created_utc": "1640218993.0", "edited": "False", "id": "hpmi3ed", "is_submitter": "False", "link_id": "t3_rmecre", "parent_id": "t3_rmecre", "score": "2", "subreddit": "infp", "subreddit_id": "t5_2qn2o"}, {"author": "pinkusocks", "body": "this is quite old but I'm planning on doing the same as soon as I have the money to do so! hope these plans are already on the make, at least, and you're having a happy life 🐸", "created_utc": "1639363256.0", "edited": "False", "id": "hobwrxk", "is_submitter": "False", "link_id": "t3_dm7se7", "parent_id": "t1_f4z4kj9", "score": "1", "subreddit": "polyamory", "subreddit_id": "t5_2qu5n"}, {"author": "pinkusocks", "body": "NTA! as someone who was vegan for a while, people refusing to accept your lifestyle anf going out of their way to get mad at you for doing something to accommodate that is dumb af 💀 it's also food, a salad or smth as simple as you mentioned would have been good enough and most people would either do that or tell you it's okay to bring food for yourself since they have no time/energy or whatever to cook something else", "created_utc": "1639335391.0", "edited": "False", "id": "hoa35k0", "is_submitter": "False", "link_id": "t3_renxx4", "parent_id": "t3_renxx4", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}]