[{"author": "Playful_Custard_537", "body": "From where I'm from men shaving legs are pretty normal and accepted.\n\nBtw it is not hygienic to share personal hygiene items like razors. If you can try to find another solution without asking for other's personal items. Personally, this part of the situation would be the weird one, not shaving legs", "created_utc": "1666870665.0", "edited": "False", "id": "itz5xkr", "is_submitter": "False", "link_id": "t3_yeg5re", "parent_id": "t3_yeg5re", "score": "1", "subreddit": "AskFeminists", "subreddit_id": "t5_2sode"}, {"author": "Playful_Custard_537", "body": "Mi sono laureato nel 2019 in triennale. C'era il covid e le misure restrittive erano abbastanza serrate. Ho discusso la tesi nella stanza di una residenza universitaria e poi bon, si poteva fare niente per il resto, in quel periodo di zone rosse mi vedevo quando potevo con la ragazza girando a caso per la città ma per il resto era tutto non fattibile. Fatta la triennale mi son sentito abbastanza provato mentalmente, vuoi per il covid, il relativo isolamento sociale, la relazione incasinata. Non proprio il periodo migliore per laurearsi nel complesso", "created_utc": "1666799180.0", "edited": "False", "id": "itv9ddi", "is_submitter": "False", "link_id": "t3_ydu7bz", "parent_id": "t3_ydu7bz", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Bianchi, maschi ed etero a essere precisi. Iniziando dagli anziani e scendendo gradualmente di età", "created_utc": "1665906268.0", "edited": "False", "id": "isio7jp", "is_submitter": "False", "link_id": "t3_y4rys4", "parent_id": "t1_isinx3h", "score": "-3", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Quando capitano ste cose mi auguro sempre una velocizzazione del declino demografico e che il piano Kalergi sia vero e possibilmente in corso. Siamo un Paese di viscidi", "created_utc": "1665861687.0", "edited": "False", "id": "isg9603", "is_submitter": "False", "link_id": "t3_y4rys4", "parent_id": "t3_y4rys4", "score": "-18", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "To use words like \"to obtain\" and \"females\" would be really weird in my native language, literally a wrong use of the language. A mistake a foreigner could do probably. Why someone in English use these words? Isn't weird or just wrong also in English?", "created_utc": "1665815811.0", "edited": "False", "id": "ise05oy", "is_submitter": "False", "link_id": "t3_y459i7", "parent_id": "t3_y459i7", "score": "5", "subreddit": "NotHowGirlsWork", "subreddit_id": "t5_adf18"}, {"author": "Playful_Custard_537", "body": "Or these men do not wash themselves or women are reptiles of some kind lmao", "created_utc": "1665731275.0", "edited": "False", "id": "is9edge", "is_submitter": "False", "link_id": "t3_y3jz6u", "parent_id": "t3_y3jz6u", "score": "6", "subreddit": "NotHowGirlsWork", "subreddit_id": "t5_adf18"}, {"author": "Playful_Custard_537", "body": "Strage Nicholas Cage you have in that photo", "created_utc": "1665582538.0", "edited": "False", "id": "is0r4bi", "is_submitter": "False", "link_id": "t3_y1xnt5", "parent_id": "t3_y1xnt5", "score": "34", "subreddit": "ww2", "subreddit_id": "t5_2s8su"}, {"author": "Playful_Custard_537", "body": "Yeah, strategically speaking the North African front was at least relevant for Italy even if we handled it badly but our participation in the Soviet campaign was just unnecessary and we lost so many people for nothing. Germans were good having Finns, Romanians and Hungarians along collaborators in occupied territories. But Mussolini insisted and we sent an army without equipment and proper training, so yes, cannon fodder for political reasons", "created_utc": "1665488114.0", "edited": "False", "id": "irvllof", "is_submitter": "False", "link_id": "t3_xxt7ce", "parent_id": "t1_irt05ye", "score": "1", "subreddit": "ww2", "subreddit_id": "t5_2s8su"}, {"author": "Playful_Custard_537", "body": "This was one of the major events that caused Italians to abandon definitely Mussolini's regime. After the poorly planned campaigns in Yugoslavia, Greece and North Africa the campaign of Russia was the final drop. The few soldiers that returned started saying what a hell the campaign was and many of them became partisans a few months later after the armistice", "created_utc": "1665212941.0", "edited": "False", "id": "irhrtic", "is_submitter": "False", "link_id": "t3_xxt7ce", "parent_id": "t3_xxt7ce", "score": "3", "subreddit": "ww2", "subreddit_id": "t5_2s8su"}, {"author": "Playful_Custard_537", "body": "We did not fight in the city itself but along with Hungarian and Romanian troops we were part of the frontline in the steppes", "created_utc": "1665212697.0", "edited": "False", "id": "irhrjo3", "is_submitter": "False", "link_id": "t3_xxt7ce", "parent_id": "t1_irfn45a", "score": "1", "subreddit": "ww2", "subreddit_id": "t5_2s8su"}, {"author": "Playful_Custard_537", "body": "I really do not understand people in their late '20s going after people smaller in age than them, like under 24-ish- It's just creepy in my opinion", "created_utc": "1665041732.0", "edited": "False", "id": "ir96w5j", "is_submitter": "False", "link_id": "t3_xwknf0", "parent_id": "t3_xwknf0", "score": "2", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "Playful_Custard_537", "body": "Beh se uno ci tiene alla propria salute mentale deve avere un approccio critico alle notizie e deve filtrare ciò che è rilevante per la nostra vita individuale da ciò che non lo è. E' triste sapere di una catastrofe in un posto sperduto del mondo ma starci male a caso non cambierà nulla e ti rovini l'umore; rifai sta cosa per dieci altre sciagure ogni giorno e sei a posto e depresso. Se invece sei spinto ad agire e non ti limiti a lamentarti è un altro discorso.\n\nPoi di base chi dà le notizie ci vive di sta cosa e per viverci deve vendere e per vendere deve presentare certe notizie piuttosto di altre e presentarle in un certo modo al fine di guadagnare. Se uno è consapevole della dinamica sa anche che certe notizie sono costruite in un certo modo per suscitare certe emozioni e sa giudicare criticamente chi ti sta dando la notizia, se è affidabile o no.\n\nQuindi non credo ci sia nulla di male nell'approcciarsi in modo critico ed equilibrato al consumo di notizie. Poi se chi dà le notizie si orientasse su quelle positive che spingono ad agire o che ti migliorano la giornata non sarebbe male. Ci sarebbe meno gente isterica in giro che somma a stili di vita magari non proprio sani il consumo eccessivo di notizie negative che aggravano lo stato mentale dei suddetti", "created_utc": "1665040631.0", "edited": "False", "id": "ir95mhv", "is_submitter": "False", "link_id": "t3_xwiu70", "parent_id": "t3_xwiu70", "score": "4", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "It's my first time using barefoot shoes. Maybe I have to use them less frequently and continue in tandem wirh normal shoes?", "created_utc": "1664463090.0", "edited": "False", "id": "iqdgecc", "is_submitter": "True", "link_id": "t3_xr5tv0", "parent_id": "t1_iqdfkj6", "score": "1", "subreddit": "BarefootRunning", "subreddit_id": "t5_2rp0r"}, {"author": "Playful_Custard_537", "body": "What a dumb question. Isn't the answer obvious?", "created_utc": "1664280219.0", "edited": "False", "id": "iq3e145", "is_submitter": "False", "link_id": "t3_xoyty3", "parent_id": "t3_xoyty3", "score": "1", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "Playful_Custard_537", "body": "Cedo il posto senza problemi e a volte mi viene ceduto. Normale cortesia, dopotutto se vai al supermarket della fila la devi mettere in conto a prescindere e se la gente è di fretta, a meno di situazioni specifiche e giustificate, è solo scimunita e non sa incastrare gli impegni decentemente", "created_utc": "1663841574.0", "edited": "False", "id": "ipg7dha", "is_submitter": "False", "link_id": "t3_xkh722", "parent_id": "t3_xkh722", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Isn't the fur necessary for temperature regulation? If this is the case, then shaving the cat it's not really a good idea but in really specific circumstances", "created_utc": "1663778276.0", "edited": "False", "id": "ipcn2kg", "is_submitter": "False", "link_id": "t3_xk7wsn", "parent_id": "t3_xk7wsn", "score": "10", "subreddit": "cats", "subreddit_id": "t5_2qhta"}, {"author": "Playful_Custard_537", "body": "Sono praticamente sordo da un orecchio. Anche volendo non passerei i controlli medici di base. E se mi ammettono vuol dire che la guerra è persa e sto per morire male di lì a breve. Poi anche per la condizione di salute della mia famiglia preferirei evitare di andare a crepare inutilmente e preferirei continuare a fare da caretaker per persone che altrimenti non avrebbero nessuno. Quindi lo Stato può farsi i fatti suoi e lasciarmi in pace a lavorare e pagare le tasse", "created_utc": "1663760043.0", "edited": "False", "id": "ipbg8oq", "is_submitter": "False", "link_id": "t3_xk05y9", "parent_id": "t3_xk05y9", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "To sacrifice your health and diet I would say that it's nor really the best course of action. It's a matter of both physical health and mental health. Eat well, drink enough and sleep weel. These things must not be sacrificed, if possible", "created_utc": "1663754407.0", "edited": "False", "id": "ipb7yia", "is_submitter": "False", "link_id": "t3_xjxwf3", "parent_id": "t3_xjxwf3", "score": "2", "subreddit": "financialindependence", "subreddit_id": "t5_2t34z"}, {"author": "Playful_Custard_537", "body": "I was in your same spot some months ago with my girlfriend. It was a draining relationship, I had to do all the emotional work and give all my material and emotional support to her but received nothing back but toxicity. Then I decided to end the relationship, I regretted it but I felt that I was worthy of a better relationship", "created_utc": "1663744373.0", "edited": "False", "id": "ipavse1", "is_submitter": "False", "link_id": "t3_xjpd6s", "parent_id": "t3_xjpd6s", "score": "2", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "Playful_Custard_537", "body": "An opportunity to get rid of patriarchy. Women would have the opportunity of raising new generations educated differently, hopefully", "created_utc": "1663653364.0", "edited": "False", "id": "ip5ur18", "is_submitter": "False", "link_id": "t3_xid2me", "parent_id": "t3_xid2me", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Well, your point is pretty understandable. I just suppose he's dumb at this point lol", "created_utc": "1663583347.0", "edited": "False", "id": "ip1p37p", "is_submitter": "False", "link_id": "t3_xhns4m", "parent_id": "t3_xhns4m", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "Playful_Custard_537", "body": "Nah I don't buy it, he's an exemplar of \"the nice guy\", he makes compliments (really problematic ones) and if you do not meet his standards, he will transform into the pure opposite of what he was right before and will probably be mean and insulting", "created_utc": "1663524583.0", "edited": "False", "id": "ioygigw", "is_submitter": "False", "link_id": "t3_xhka21", "parent_id": "t3_xhka21", "score": "14", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "Playful_Custard_537", "body": "As a male I think we should go extinct lol, we have a too much large number of idiots in our ranks", "created_utc": "1663486232.0", "edited": "False", "id": "iowd9q5", "is_submitter": "False", "link_id": "t3_xh6lgw", "parent_id": "t3_xh6lgw", "score": "1", "subreddit": "TwoXChromosomes", "subreddit_id": "t5_2r2jt"}, {"author": "Playful_Custard_537", "body": "Seeing this scene left a sense of disappointment in me. It was supposed to be a major event of the entire serie and you (the show runner) spoiler it in this... silly way. Don't know what to say honestly\n\nedit: loved the episode in general\n\nedit 2: personally, I was disappointed because I suppose that this scene made a non-necessary spoiler for those who do not know the books; but if I'm mistaken, I have no problem in changing my mind", "created_utc": "1663361229.0", "edited": "1663361844.0", "id": "iopq9eo", "is_submitter": "False", "link_id": "t3_xfz9to", "parent_id": "t3_xfz9to", "score": "-1", "subreddit": "lotr", "subreddit_id": "t5_2rfb9"}, {"author": "Playful_Custard_537", "body": "Ohh my bad, it was a mistake on my part. I meant katabtu, not kataba. I will edit it, thank you for correcting me :)\n\nEheh, you have to press Maiusc + J and you will obtain a \"bar\" that create this effect:\n\nـــــــــ كـــــ ــــكـــــ ــــــك\n\nEdit: on smartphone I never tried to use it so I'm not sure", "created_utc": "1663359419.0", "edited": "False", "id": "ioplrao", "is_submitter": "False", "link_id": "t3_xfy810", "parent_id": "t1_iopg5ci", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "For the past tense (madi) you have the root to which you add suffixes.\n\nFor the present tense (mudari) you have the root to which you add both prefixes and suffixes.\n\nIn order to make the future you take the mudari and you add another prefix to the mudari prefix, that is, the letter sin.\n\nSo:\n\nI wrote (katabtu) كـــــتــــــبـــت\n\nI write (a-ktubu) أكـــــتـــــب\n\nI will write (sa-a-ktubu) ســـأكـــتـــب\n\nIf you search over the internet or look in a grammar book, you'll find more complete explanations.\n\nYour verb is 3ayyana in the madi and yu3ayyinu in the mudari.\n\nHe appointed > 3ayyana\n\nHe appoints > yu3ayyinu\n\nHe will appoint > sayu3ayyinu", "created_utc": "1663351923.0", "edited": "1663359448.0", "id": "iop2upi", "is_submitter": "False", "link_id": "t3_xfy810", "parent_id": "t3_xfy810", "score": "0", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Io ormai faccio lo scrutatore da anni e non ti invidio. Avrei ansia a farlo io dopo anni come scrutatore a stretto contatto con il presidente di seggio. Non oso immaginare farlo come prima esperienza va'. E' come avere 18 anni e finire in trincea nella WW1 da ufficiale, per farla drammatica. Nel complesso dovrebbe andare tutto bene comunque; saranno presenti altri cristiani con esperienza e potrai consultarti con loro senza problemi\n\nIl consiglio principale è: calma, prudenza, evitare come la morte la fretta; prenditi tutto il tempo che ti serve per capire le corrette procedure e la trafila burocratica che dovrai supervisionare. Prendi a schiaffi chiunque ti dia noie per i tempi lunghi, se sono lì sanno per cosa si sono \"arruolati\" quindi hanno poco da lamentarsi, qualunque cosa capiti è responsabilità legale tua. Avere le chiappe sulla linea per gli errori altrui potrebbe risultare giusto un attimo frustrante dopotutto", "created_utc": "1663351129.0", "edited": "False", "id": "iop0u89", "is_submitter": "False", "link_id": "t3_xfxc80", "parent_id": "t3_xfxc80", "score": "15", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Piemontese here. Prima volta che sento dire sta cosa di noi. Di solito mi viene detto della cadenza nel parlare ma questa cosa della la r non lo sapevo", "created_utc": "1663343604.0", "edited": "False", "id": "iooh9ll", "is_submitter": "False", "link_id": "t3_xfmh3a", "parent_id": "t1_ioo76f7", "score": "4", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Stando agli analisti di Limes e ad altri come Dario Fabbri e colleghi perché:\n\n* abbiamo perso la WW2, di conseguenza non possiamo decidere la nostra politica estera con piena libertà (esempio: Conte 1 e chiacchierate con la Cina che ci son costate una bella tirata d'orecchi); in teoria, stando a un'analisi fatta da Caracciolo recentemente, nel Mediterraneo avremmo non poca libertà di azione grazie al relativo disinteresse americano per l'area, quindi le opportunità le avremmo, nei limiti degli interessi americani comunque;\n* siamo un Paese con una mentalità economicista la cui opinione pubblica rifugge qualsivoglia ragionamento basato su criteri geostrategici e non su idealismo, europeismo e diritti umani; inoltre siamo un Paese di vecchi e in quanto tale siamo conservativi, ragioniamo in termini esclusivamente economici e non vogliamo mettere a repentaglio il nostro benessere\n* fare seriamente i propri interessi nazionali ti porta a investire risorse materiali e umane e a pagare un prezzo per questo impegno nel proiettarsi fuori dai confini nazionali; vedasi la Turchia che è letteralmente ovunque dal Mediterraneo al Medio Oriente che si ritrova un'inflazione tremenda e in genere un'economia abbastanza scassata\n* edit: dimenticavo un pezzo, da sta situazione secondo Limes e colleghi se ne esce risolvendo la crisi demografica e modificando la pedagogia nazionale in modo tale da avere una popolazione giovane e consapevole realmente di come gira il mondo, non deviata da ideologie che più che aiutare ingombrano", "created_utc": "1663314520.0", "edited": "1663314717.0", "id": "ion08v8", "is_submitter": "False", "link_id": "t3_xex2k6", "parent_id": "t3_xex2k6", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Mio padre è complottista, catalogo completo. E si sommano un egocentrismo e una volgarità di altissimo livello. Lui è l'unico ad avere ragione e a sapere tutto, gli altri sono dei poveri ignoranti e dei sempliciotti che hanno la fortuna di stare a sentire le sue verità che lui nella sua generosità disvela.\n\nE' da due anni che ho limitato di rapporti perché è impossibile averci a che fare. Quando ha saputo che mi ero vaccinato ha fatto delle sceneggiate assurde per dire. Ho provato e riprovato a dirgli esplicitamente che voglio con lui un rapporto normale e che non me ne potrebbe fregare di meno dei complotti; ho provato anche a sviare gli argomenti in modo meno diretto ma niente da fare. E' martellante. Ha allontanato diversi amici e famigliari ma sfortunatamente trova centinaia di pazzi con cui si dicono quanto sono furbi e intelligenti.\n\nE quindi boh, non so che fare. Nell'atteggiarsi così non fa altro che tenere lontane persone care e non è che sia nel fiore degli anni insomma. Si sta bruciando un sacco di tempo che potrebbe spendere con i propri cari per stare dietro a dei mulini a vento e farsi contar balle da gente più furba di lui. Poi già di suo non ha un carattere amabile, se sommi pure il complottismo è una disgrazia e basta, non si salva niente", "created_utc": "1663100635.0", "edited": "False", "id": "ioayfhq", "is_submitter": "False", "link_id": "t3_xcc79b", "parent_id": "t3_xcc79b", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Mount & Blade II: Bannerlord moddato sul periodo delle Crociate o magari sul Signore degli Anelli.\n\nMod sulle Crociate: mi unisco a Salah ud-Din e faccio il jihad contro i Franchi, poi una volta sconfitti divento un commerciante e metto su famiglia\n\nMod su LOTR: combatto per Gondor contro Mordor e Harad e poi continuo la carriera nell'esercito anche nella Quarta Era", "created_utc": "1662887251.0", "edited": "False", "id": "inys8zh", "is_submitter": "False", "link_id": "t3_xbb8qd", "parent_id": "t3_xbb8qd", "score": "4", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Assimil Arabic With Ease; you can find it for free over the internet with the audios", "created_utc": "1662802117.0", "edited": "False", "id": "inu4n6g", "is_submitter": "False", "link_id": "t3_xakrrd", "parent_id": "t3_xakrrd", "score": "3", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "Really hope the actress is not given trouble by these idiots. The character is just perfect in every sense, she made an awesome job", "created_utc": "1662653323.0", "edited": "False", "id": "inls4cw", "is_submitter": "False", "link_id": "t3_x8qjds", "parent_id": "t3_x8qjds", "score": "1", "subreddit": "NotHowGirlsWork", "subreddit_id": "t5_adf18"}, {"author": "Playful_Custard_537", "body": "After Doulinguo you have different paths depending on your objective: MSA or dialects? Communicative competence or grammatical knowledge of the language?\n\nDeductive manuals not so heavy on grammar that will improve hugely your grasp of the language and the vocab:\n\n* Assimil Arabic With Ease (B1) + Assimil Arabe (C1)\n* Linguaphone Arabic (B1)\n* FSI course in Modern Written Arabic (3 books)\n\nTraditional grammars with texts, explanations and drills like the Deheuvel's one", "created_utc": "1662563529.0", "edited": "False", "id": "ingk400", "is_submitter": "False", "link_id": "t3_x7yzgt", "parent_id": "t3_x7yzgt", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Yeah astrology is bullshit but this guy is an idiot lmao", "created_utc": "1662372181.0", "edited": "False", "id": "in60pc7", "is_submitter": "False", "link_id": "t3_x5uox6", "parent_id": "t3_x5uox6", "score": "0", "subreddit": "Tinder", "subreddit_id": "t5_2w7mz"}, {"author": "Playful_Custard_537", "body": "Iraq is happier that Turkey and Jordan and slightly less happier for a 0.1 than Morocco. But Lebanon is 3.0 at the same time. At least for Oriental and Southern Mediterran I would have at least some doubts about these numbers", "created_utc": "1662371896.0", "edited": "False", "id": "in60d4i", "is_submitter": "False", "link_id": "t3_x69an6", "parent_id": "t3_x69an6", "score": "1", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "Playful_Custard_537", "body": "I'm an old Tolkien's fan and I'm enjoying the show accepting differences and new things with the lore", "created_utc": "1662365110.0", "edited": "False", "id": "in5sdge", "is_submitter": "False", "link_id": "t3_x5to9w", "parent_id": "t3_x5to9w", "score": "-1", "subreddit": "lotrmemes", "subreddit_id": "t5_2v0i1"}, {"author": "Playful_Custard_537", "body": "Bè, le precedenti esperienze mi hanno fatto capire che sono parecchio per il contatto fisico, offro continuamente incoraggiamenti, complimenti e dico cose romantiche e aiuto volentieri in qualsivoglia tipo di incombenza pratica a qualunque ora. Ma chiedimi appuntamenti e doni e sono fregato, non ho idea manco di come devo scendere dal letto a quel punto. Su quelle due cose ci provo ma faccio ca'. Magari sul tempo di qualità ci riesco ancora ancora ma doni nope", "created_utc": "1662319649.0", "edited": "False", "id": "in3cbou", "is_submitter": "False", "link_id": "t3_x5mse5", "parent_id": "t3_x5mse5", "score": "12", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Catholicism is the true faith obviously. Not like those Protestants where every farmer can pick the hobly scripture and create a new sect from nothing without any real knowledge creating confusion and divisions among Christians. We need a hierarchical clergy and we need a Pope able to guide us on the right path!    \nDeath to those ignorant and dangerous Protestants!    \n/s", "created_utc": "1662278702.0", "edited": "False", "id": "in13ynm", "is_submitter": "False", "link_id": "t3_x563sk", "parent_id": "t3_x563sk", "score": "0", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Playful_Custard_537", "body": "For improving pronunciation, I suggest looking for the Shadowing method developed by Prof. Arguelles; he has some videos on YT about this topic. It has helped hugely with my Arabic", "created_utc": "1662211555.0", "edited": "False", "id": "imx9iry", "is_submitter": "False", "link_id": "t3_x4sved", "parent_id": "t3_x4sved", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "At first I was interested because it seemed a similar method to the Glossika one, then I saw the reviews of some of the books of this series and yay, not really good as far as I can say. A lot of languages and the reviews are bad for every book of the series", "created_utc": "1662208758.0", "edited": "False", "id": "imx45rt", "is_submitter": "False", "link_id": "t3_x4rr64", "parent_id": "t3_x4rr64", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Maybe some Iranian people can offer some insight but as far as I have studied on the topic, before the Islamic revolution you had a monarch that implemented a so called White revolution, just as violent and oppressive as the Islamic one. So, to have girls in bikinis and Western customs I don't think it is so important if at the end you still lack democracy and freedom of speech or human rights. Correct me and please offer me your opinion on this matter, I would really appreciate it", "created_utc": "1661954464.0", "edited": "False", "id": "imiu36u", "is_submitter": "False", "link_id": "t3_x28hkq", "parent_id": "t3_x28hkq", "score": "1", "subreddit": "iran", "subreddit_id": "t5_2qhzq"}, {"author": "Playful_Custard_537", "body": "It's so bizzare that this tip is considered a Pro Tip. Let me explain, it's a golden tip, but at the same time it's just common sense and intellectual honesty. It's strange that so many people are afraid to \"admit\" that they do not know something. I think that not knowing stuff it's just our \"default\" condition. We are limited, fallible and often irrational. To say \"I don't know\" should be the rule not the exception in a sense", "created_utc": "1661939008.0", "edited": "False", "id": "imi2ds4", "is_submitter": "False", "link_id": "t3_x1x1x7", "parent_id": "t3_x1x1x7", "score": "1", "subreddit": "LifeProTips", "subreddit_id": "t5_2s5oq"}, {"author": "Playful_Custard_537", "body": "American, let me guess lol", "created_utc": "1661680690.0", "edited": "False", "id": "im402hl", "is_submitter": "False", "link_id": "t3_wzjo4m", "parent_id": "t3_wzjo4m", "score": "2", "subreddit": "hebrew", "subreddit_id": "t5_2rk3f"}, {"author": "Playful_Custard_537", "body": "Created yesterday a new account, would like some feedback, hopefully the fact that it's in Italian won't be a problem, but let me now if you want a translation:\n\nhttps://tinder.com/@andrefra2", "created_utc": "1661680191.0", "edited": "False", "id": "im3zhda", "is_submitter": "False", "link_id": "t3_wwlrco", "parent_id": "t3_wwlrco", "score": "1", "subreddit": "Tinder", "subreddit_id": "t5_2w7mz"}, {"author": "Playful_Custard_537", "body": "You may want to familiarise yourself with the International Phonetic Alphabet (IPA) and with the branch of linguistics called phonology. I don't think that your problem is to be linked to the dimension of your tongue", "created_utc": "1661605698.0", "edited": "False", "id": "ilzxw3d", "is_submitter": "False", "link_id": "t3_wz1w5d", "parent_id": "t3_wz1w5d", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "A person I know has the same tattoo but it's on the line of \"Love, sincerity and grain wheat\" lmao. A Chinese friend of ours told this to us and since then that tattoo is a tabu now", "created_utc": "1661514472.0", "edited": "False", "id": "iluwc2v", "is_submitter": "False", "link_id": "t3_wy0y2q", "parent_id": "t3_wy0y2q", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Yes, I can confirm the flirting thing. I used both the courses for Arabic and Hebrew and in them you had to pressure a woman into accepting a date even after she said no ten times. A bit awkward", "created_utc": "1661438021.0", "edited": "False", "id": "ilql3gn", "is_submitter": "False", "link_id": "t3_wx6g41", "parent_id": "t1_ilqiqjt", "score": "124", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "I'm going to assume that you are speaking of MSA. Assimil Arabic With Ease or Linguaphone Arabic would be a good choice for your level. They offer a communicative approach to Arabic so you won't be bored with endless explanations of grammar, just the minimum and you'll develop an intuitive sense for the language. After these two resources you could focus on grammar with specific manuals like the Deheuvels one. You can easily find all these resources for free over the internet with their accompanying audios", "created_utc": "1661430004.0", "edited": "False", "id": "ilq2uk7", "is_submitter": "False", "link_id": "t3_wwx1ry", "parent_id": "t3_wwx1ry", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "It is not sad. It is just diglossia. You can ask where is the bathroom in a dialect but you'll use MSA for news, education and politics. You just have to know what you want to achieve with the language and choose your resources accordingly. The book al-Kitab series it's good as it is but it can be preferable the usage of other resources according to your particular needs", "created_utc": "1661429425.0", "edited": "False", "id": "ilq1qen", "is_submitter": "False", "link_id": "t3_wx6g41", "parent_id": "t3_wx6g41", "score": "47", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Before making these claims one should verify in the proper sources these connections. You go to the books, to the indexes, to the letters of Tolkien and so on. In that form they are only vague suggestions and without any factual source. If there is a connection that's really cool and would just be a testimony of the greatness of the cultural horizons of Tolkien", "created_utc": "1661370209.0", "edited": "False", "id": "ilmxdsm", "is_submitter": "False", "link_id": "t3_ww7g3a", "parent_id": "t3_ww7g3a", "score": "1", "subreddit": "lotrmemes", "subreddit_id": "t5_2v0i1"}, {"author": "Playful_Custard_537", "body": "Nice to know! I'm not an Israeli nor knowledgeable about contemporary Israeli history so I have a lot to learn. It makes sense that the symbol of the Haganah became the symbol of the Tzahal", "created_utc": "1661358504.0", "edited": "False", "id": "ilm294v", "is_submitter": "False", "link_id": "t3_wwi9j9", "parent_id": "t1_illtaaj", "score": "3", "subreddit": "hebrew", "subreddit_id": "t5_2rk3f"}, {"author": "Playful_Custard_537", "body": "\"Cameriere! Vorrei il miglior piano Kalergi che avete, per favore\"", "created_utc": "1661353184.0", "edited": "False", "id": "illoghl", "is_submitter": "False", "link_id": "t3_wwdzrf", "parent_id": "t3_wwdzrf", "score": "8", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Not the sharpest knife in the drawer. To say the least", "created_utc": "1661351324.0", "edited": "False", "id": "illju4j", "is_submitter": "False", "link_id": "t3_wwihwc", "parent_id": "t3_wwihwc", "score": "4", "subreddit": "NotHowGirlsWork", "subreddit_id": "t5_adf18"}, {"author": "Playful_Custard_537", "body": "Oh that's cool! I just saw yesterday a video on the armed militia of the Haganah and it's the same symbol as far as I know", "created_utc": "1661347575.0", "edited": "False", "id": "illav3y", "is_submitter": "False", "link_id": "t3_wwi9j9", "parent_id": "t3_wwi9j9", "score": "2", "subreddit": "hebrew", "subreddit_id": "t5_2rk3f"}, {"author": "Playful_Custard_537", "body": "Italian:\n\nWord for word: \"Mentre emergo dalle ceneri, rinasco\"\n\nMore poetic one: \"Emergendo dalle ceneri ritorno a vivere\"", "created_utc": "1661335669.0", "edited": "False", "id": "ilkpnq7", "is_submitter": "False", "link_id": "t3_ww5ejm", "parent_id": "t3_ww5ejm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "3afwan! Happy to help a fellow learner of this amazing language. I'm just sorry for the fact that from smartphone the formatting of the text it's really weird and the bullet points list it's a bit confusing because of that. From the web version it's as it should be", "created_utc": "1661193628.0", "edited": "False", "id": "ilcsycw", "is_submitter": "False", "link_id": "t3_wuw5tp", "parent_id": "t1_ilcqxb7", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": ">I think the most similar language I know, to Arabic it's Portuguese based on a website\n\nI think that you should take this \"similarity\" with a grain of salt, let's say. In phonology, morphology and syntax they are just different planets. They share a bit of vocabulary as far as I know. But maybe I'm missing something particular.\n\nAnyway as you probably know there are two different types of language knowledge: explicit/declarative knowledge (you know stuff about the L2) and implicit/procedural knowledge (you are able to communicate in the L2). Depending by your objective you'll chose different manuals and approaches in order to reach your objective in the more efficient way. So you should know where do you want to go: **do you want to know stuff about Arabic or do you want to communicate in Arabic?**\n\nSecondly, you should be aware of the sociolinguisical feature proper to Arabic called Diglossia. A community of speakers uses two or more variants of a single language in different contexts. In the case of Arabic you have Modern Standard Arabic (MSA) used for books, bureaucracy, news broadcasts and the like, and the different dialects specific to every Arab country spoken on the streets, in the family, and in every informal context . So, second question: **do you want to know MSA or a dialect?**\n\nIf you are not in an hurry to speak Arabic I would suggest developing a foundation in MSA then studying a dialect. The relation between MSA and the dialects it's like Latin and Romance languages in a way. From Latin you can easily go to every Romance language and with MSA you can study in a faster and easier way any dialect. You can develop a good base in MSA with the Assimil books and the Deheuvels grammar.\n\nPersonally I'm more familiar with manuals and resources for MSA so I'll list mainly MSA stuff I used/I directly know, all for free over the internet and all of them coming with mp3s:\n\n1. Pimsleur\n   1. MSA x3 levels\n   2. Egyptian x1 level\n   3. Syrian x3 levels\n   4. Full-audio course; I like and dislike it. In a general way it's just too slow. 30m for some sentences it's not a good trade for me but it's perfect if you want to take it easy with a new and difficult language and you are a bit clueless about what do to\n2. Assimil Arabic With Ease (A1-B1)\n   1. Communicative approach\n3. Assimil Perfectionnement Arabe (B2-C1)\n   1. Communicative approach\n4. Linguaphone Arabic (A1-B1)\n   1. Communicative approach\n   2. As level similar to Assimil Arabic With Ease\n   3. There is also Linguaphone Egyptian Arabic\n5. Foreign Service Institute course in Modern Written Arabic III vol.\n   1. The first volume it's a pattern-drill type, the other two are just reading and listening to texts from simpler to very complex ones in a gradual fashion\n   2. A must for developing reading fluency. If you build a foundation with just the Assimil books then you finish this course you'll be a pretty much an autonomous reader in a small period of time able to read newspapers and books without too much trouble\n   3. There are FSI courses for Saudi and Syrian Arabic if I recall correctly\n6. Deheuvels Arabic Grammar \n   1. An easy start with the grammar of MSA; it does not help much with vocab but it helps in understanding and acquiring all of the grammatical structures of MSA\n   2. Traditional grammar: texts + grammar explanations + exercises\n7. Standard Arabic An Elementary-Intermediate Course by Schultz, Krahl and Reushel\n   1. A comprehensive (no joke, it's an heavy book) presentation of MSA grammar\n   2. Like the Deheuvels one but this is more detailed with more texts, explanations and exercies\n8. Standard Arabic An Advanced Course by Dickins and Watson\n   1. The follower to the previous one\n   2. Aimed at developing thoroughly the four basic skills of reading, writing, speaking and listening", "created_utc": "1661189861.0", "edited": "False", "id": "ilcj5ke", "is_submitter": "False", "link_id": "t3_wuw5tp", "parent_id": "t3_wuw5tp", "score": "8", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "A beautiful exemplar of \"nice guy\" in it's natural environment", "created_utc": "1660656888.0", "edited": "False", "id": "ikimqkx", "is_submitter": "False", "link_id": "t3_wp0ury", "parent_id": "t3_wp0ury", "score": "1", "subreddit": "Tinder", "subreddit_id": "t5_2w7mz"}, {"author": "Playful_Custard_537", "body": "I would say that for a country so fragile like Egypt to take a stance for a faction against another would be a risk if the reward it is not certain and positive. Egypt has enough problems internally speaking, and getting into an international mess of so much magnitude would be a bold move to say the least", "created_utc": "1660402074.0", "edited": "False", "id": "ik4tn3i", "is_submitter": "False", "link_id": "t3_wnak8c", "parent_id": "t3_wnak8c", "score": "3", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "You have no other choice but to go from the degree of development of a developing economy to a developed one. A demographic boom is structural to developing economies, no way around it if not forward. Or you can burn yourself with laws on births like China and shoot yourself on the foot", "created_utc": "1660384938.0", "edited": "False", "id": "ik40nam", "is_submitter": "False", "link_id": "t3_wna552", "parent_id": "t1_ik3yj6q", "score": "9", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "I would like to read more about the topic! Do you have any suggestions about what to read in this regard?", "created_utc": "1660324437.0", "edited": "False", "id": "ik0p0vj", "is_submitter": "True", "link_id": "t3_wmp8dj", "parent_id": "t1_ik0npwz", "score": "1", "subreddit": "saudiarabia", "subreddit_id": "t5_2roj4"}, {"author": "Playful_Custard_537", "body": "Arabic and cursive Hebrew are just magnificents", "created_utc": "1660314402.0", "edited": "False", "id": "ijzynpj", "is_submitter": "False", "link_id": "t3_wm3vm7", "parent_id": "t3_wm3vm7", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": ">How do you keep track of hours?\n\nPersonally I don't. I just try to develop an habit for doing x at time y and I go with that. I have a list of resources, things I want to do and I just do one after the other in the span of weeks/months and that's it. For the rest of the time I just immerse in L2 content and I'm good with that. Too lazy to track hours, just a way to stress myself with other stuff lol", "created_utc": "1660242095.0", "edited": "False", "id": "ijw0x5y", "is_submitter": "False", "link_id": "t3_wluxon", "parent_id": "t3_wluxon", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Excuse me? The meme it's about Achemenid Persia and you are referring to slavery during Islamic times in Iran. And the passage talks about slaves during the reign of Arab and Turkish dinasties", "created_utc": "1660204696.0", "edited": "False", "id": "ijtxwcc", "is_submitter": "False", "link_id": "t3_wl3oid", "parent_id": "t1_ijqyz33", "score": "9", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Playful_Custard_537", "body": "As a free alternative to LingQ you can use [languagecrush.com](https://languagecrush.com) where you can find a reading tool (like LingQ), you can write essays, chat and find teachers. This would let you use the paid version of Clozemaster I suppose", "created_utc": "1660126231.0", "edited": "False", "id": "ijp7g6y", "is_submitter": "False", "link_id": "t3_wksfcc", "parent_id": "t3_wksfcc", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Personally I don't like these clear-cut methods; neither the full traditional one made only by grammar and structural exercises nor the no-grammar-approach. Yeah, you can immerse and learn (slowly) or you could kill yourself with tables, paradigms and rules, but you could also use more traditional method of acquiring the L2 paired with immersion and gain the best of both worlds. So I do not really get the point of excluding other approaches, you just slow yourself\n\nI find that the Skill Acquisition Theory and the weak interface hypothesis are the most intellectually honest approaches to this type of debate", "created_utc": "1660119416.0", "edited": "False", "id": "ijoz0mq", "is_submitter": "False", "link_id": "t3_wkfu92", "parent_id": "t3_wkfu92", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Edit: premessa: stica dei politici e dei partiti, è una strada inutile piena di opportunismo e falsi problemi o comunque la prospettiva è sui problemi di breve periodo \n\nUno dei problemi che nessuno sembra considerare è il benedetto declino demografico che in quanto Paese economicamente sviluppato ci affligge. Tutte le economie sviluppate ne sono intaccate per una serie di ragioni sociologiche. La soluzione al problema è assorbire gente che arriva dai Paesi in via di sviluppo, farla rimanere, integrarla o eventualmente assimilarla, farla lavorare e garantire entrate fiscali allo stato attraverso le tasse.    \n  \nUna piccola parte della questione può essere affrontata favorendo appunto il processo di integrazione di quei quattro immigrati in croce che arrivano in Italia. Una piccola parte di un processo di integrazione di successo è l'acquisizione dell'italiano. Diventare insegnanti di italiano per stranieri e sapere lingue come l'arabo (specificamente dialetti marocchino ed egiziano) oppure lingue africane subsahariane non sarebbe male", "created_utc": "1660067906.0", "edited": "False", "id": "ijlydvf", "is_submitter": "False", "link_id": "t3_wk2rgs", "parent_id": "t3_wk2rgs", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Well, usually it means an harder life for the working class and less welfare state as far as I can understand", "created_utc": "1660047998.0", "edited": "False", "id": "ijkkqlp", "is_submitter": "False", "link_id": "t3_wjxyow", "parent_id": "t1_ijkf4hd", "score": "8", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "Oddio è una domanda difficile perché nonostante tutti gli stranieri che ho avuto modo di conoscere non ho ancora colto perfettamente cosa voglia dire essere italiano, mi rendo conto di differenze comportamentali e di abitudini però oltre quello non saprei andare.     \n\nTecnicamente parlando, l'identità nazionale è un costrutto culturale che viene creato, modificato e in certi casi rimosso continuamente. Dire che si è fieri per la storia, la cultura e la letteratura e via dicendo si tratta di ripetere solo ciò che è parte della pedagogia nazionale che le istituzioni creano per dare un senso di unità e un'identità comune a milioni di persone. E questa pedagogia nazionale si riflette anche su come ci vedono gli stranieri per forza di cose. Abbiamo parecchie istituzioni che esercitano questa forma di soft power culturale mel mondo. Quindi dire ste cose come cultura e simili sarebbe abbastanza futile a meno di non accettare \"le regole del gioco\" e che si tratta solo di una \"finzione\" in un certo senso", "created_utc": "1659982495.0", "edited": "False", "id": "ijh0rkm", "is_submitter": "False", "link_id": "t3_wjd5b9", "parent_id": "t3_wjd5b9", "score": "6", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Personally I would love to use French instead of English as a lingua franca. The wet dream is to use Classical Arabic/Modern Standard Arabic as lingua franca btw, \\*al-khilafat al-umawiyya intensifies\\*", "created_utc": "1659948117.0", "edited": "False", "id": "ijf2keq", "is_submitter": "False", "link_id": "t3_win0v3", "parent_id": "t3_win0v3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "If by مشي you mean an ism vocalized mashy, well, don't worry. It's just a masdar of 1st form for the verb مشى يمشي\nYou have to search for the conjugation of verbs ending in ya, waw or alif and you'll find every explanation you need", "created_utc": "1659896570.0", "edited": "False", "id": "ijc9mrh", "is_submitter": "False", "link_id": "t3_wim3gm", "parent_id": "t3_wim3gm", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Well if you have to translate MSA, AR>EN, then this is the dictionary to go with, as far as I know it can be considered the best dictionary of its category. \n\nIf it's Classical Arabic, still AR>EN, I would suggest Kazimirski (it's in French) and Lane (+ Supplement) and I wouldn't use modern translators or dictionaries created for MSA", "created_utc": "1659882720.0", "edited": "False", "id": "ijbc8ad", "is_submitter": "False", "link_id": "t3_wiercv", "parent_id": "t1_ijb0ujf", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "I translated a lot in university both Classical and Modern Standard Arabic. I would suggest using traditional dictionaries specific for the type of Arabic you want to translate (Fusha, MSA, dialects etc.). Apart from them, for MSA, you can use in combination with the dictionaries, but with caution Google Translate, al-Maany, and Reverso Context", "created_utc": "1659876760.0", "edited": "False", "id": "ijb02s9", "is_submitter": "False", "link_id": "t3_wiercv", "parent_id": "t3_wiercv", "score": "4", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Don't worry, learning the alphabet is really easy, it's just a cursive script like our Latin script in cursive.\nYou can learn it in a week with apps like WriteIt! and the like. It's just muscle memory", "created_utc": "1659859237.0", "edited": "False", "id": "ijacx2k", "is_submitter": "False", "link_id": "t3_wi6us0", "parent_id": "t1_ij9zoce", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "My L1 is Italian. I already know English and I'm currently studying Arabic while in my spare time I also study Hebrew and Farsi.    \nIn order I would really like to study French (I had a decent level, B1, years ago then I got rusty), Turkish, and German. Realistically speaking probably I'll just re-study French and leave the other two for my dreams. Apart from that I have no projects for any other language", "created_utc": "1659859110.0", "edited": "False", "id": "ijacrb2", "is_submitter": "False", "link_id": "t3_wi6us0", "parent_id": "t3_wi6us0", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Ma certo, volentieri! L'area che seguo è quella compresa tra Egitto-Iran e Turchia-Yemen. Non troverai moltissimo sul Maghreb.\n\n[Nena News](https://nena-news.it/) (testata indipendente italiana specializzata sulla regione)\n\n[Jadaliyya](https://www.jadaliyya.com/AboutUs) (blog indipendente)\n\n[al-Monitor](https://www.al-monitor.com/) (testata indipendente americana specializzata sulla regione)\n\n[al-Arabiyya](https://english.alarabiya.net/) (testata semi-indipendente saudita rivale di al-Jazeera)\n\n[al-Ahram](https://english.ahram.org.eg/) (testata semi-indipendente egiziana)\n\n[Fars News Agency](https://www.farsnews.ir/en/) (testata governativa iraniana)\n\n&#x200B;\n\nPer recuperare papers scientifici e report di vario genere autorevoli e affidabili:\n\n[Mediterranean Politics](https://www.tandfonline.com/loi/fmed20)\n\n[Merip](https://merip.org/)\n\n[MEI](https://www.mei.edu/education/middle-east-journal)\n\nEdit: in verità avrei potuto metterne ancora parecchie perché volendo le si può cercare per Paese e per orientamento politico. Aggiungerei solo la israeliana Haaretz giusto per par condicio e se uno vuole le notizie frizzanti al-Masdar, siriana governativa", "created_utc": "1659294110.0", "edited": "1659294655.0", "id": "iieyfnd", "is_submitter": "False", "link_id": "t3_wclkxm", "parent_id": "t1_iies6mx", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Mi interesso principalmente di Medio Oriente per cui seguo testate e blog specifici. Per il circo delle vicende interne seguo Breaking Italy e Otto e Mezzo della Gruber. Poi per questioni sia interne che estere c'è Limes", "created_utc": "1659290136.0", "edited": "False", "id": "iieoxgp", "is_submitter": "False", "link_id": "t3_wclkxm", "parent_id": "t3_wclkxm", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Diglossia and balancing MSA and dialects in my study. It would be just perfect to study just one variety and be ready to go reading, listening and speaking and so on in every context without worrying about sociolinguistic norms", "created_utc": "1659083033.0", "edited": "False", "id": "ii3plaf", "is_submitter": "False", "link_id": "t3_wad8i4", "parent_id": "t3_wad8i4", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Look for the AJATT approach and principles on immersion", "created_utc": "1659007062.0", "edited": "False", "id": "ihz68ay", "is_submitter": "False", "link_id": "t3_wa66vy", "parent_id": "t3_wa66vy", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "* Foreign Service Institute course in Modern Written Arabic in three volumes\n   * Useful for developing reading competence. \n   * It has audio\n   * You can easily find it on internet for free\n* Assimil Arabic\n   * It helps with listening and you can attain a basic understanding of grammar\n   * Probably you can find it also for free if you know where to look\n* Glossika Arabic\n   * Really useful for improving pronunciation and acquiring sentence patterns\n* Deheuvels grammar of Arabic in two volumes\n   * An easy approach to grammar. You'll find texts, grammar explanations and drill exercises. It's really good as a first book for learning in a more explicit way the grammar. I think that doing this after Assimil would be useful\n   * It has audio\n   * Can find it easily for free on internet\n* Standard Arabic: An Elementary-Intermediate Course by Eckhard Schultz\n   * This is a huge book of Arabic grammar similar to the Deheuvels' one but bigger and fuller of grammar notions, longer texts and more exercises. If you want to study more grammar and practice it more after Assimil and Deheuvels you can use this book\n   * It has audio but you have to search for it on internet\n   * Can find it easily for free on internet", "created_utc": "1658996203.0", "edited": "False", "id": "ihyrw9u", "is_submitter": "False", "link_id": "t3_wa2uye", "parent_id": "t3_wa2uye", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Hi! I didn't know Languagecrush. I'm trying it and as far as I can see it is really similar to LingQ. I'm curious about your view on products like LingQ and ReadLang. Why should one prefer Languagecrush over other servicies?", "created_utc": "1658776658.0", "edited": "False", "id": "ihm708e", "is_submitter": "False", "link_id": "t3_w7qk3u", "parent_id": "t3_w7qk3u", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "1) A French teacher\n\nمعلمٌ فرنسيٌّ\n\n2) A teacher of French\n\nمعلمُ (اللغة) الفرنسيّةِ\n\n3) The French teacher\n\nالمعلمُ الفرنسيُّ\n\n4) The teacher is French\n\nالمعلمُ فرنسيّ", "created_utc": "1658772537.0", "edited": "False", "id": "ihlw98y", "is_submitter": "False", "link_id": "t3_w7qoy3", "parent_id": "t3_w7qoy3", "score": "5", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "To know both the regular forms and the weak ones it would be the perfection. Personally I'm lazy and I limited myself to the regular ones and for the Ist form I just learn the masdard when I encounter them in context. If you are able to learn also the weak ones you'll have a huge advantage in forming new words or understanding those in contexts", "created_utc": "1658687297.0", "edited": "False", "id": "ihh7z8x", "is_submitter": "False", "link_id": "t3_w6iaox", "parent_id": "t1_ihgth20", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Exposure by reading and listening.\n\nPersonally I gained a lot of vocabulary from scratch by using the Foreign Service Institute Modern Written Arabic Course in three volumes. Also other courses like Assimil helped a lot with vocabulary and sentence patterns. I just read the same materials over some days and I acquire the vocabulary without needing apps like Anki or the like. The following chapters of many course books also re-use the same vocab adding new one so you can review constantly what you learned before.\n\nAlso just watching TV is useful because you'll gain an implicit understanding about the sounds, the speed of speech and the rhythm, and while you gain vocabulary and expressions by reading you'll start understanding more of what you hear and you'll start reviewing what you know.\n\nYou could also use Anki but be careful, it is a mean, not an end. Personally I use it just for reviewing stuff I learned before. I used it for learning new things and ended up overusing it without actually reading and listening the actual language.\n\nEdit: \n\nSpecific to Arabic: it's a mechanical language, if you learn by heart the 10 forms for verbs, participles, masdars you'll be able to create grammatically correct words. For example from one word you'll be able to guess the form and the grammatical role and if you are able to extract the the root you'll be able to create dozens of new words. This really helps with the pace of learning", "created_utc": "1658652730.0", "edited": "1658653022.0", "id": "ihfeir2", "is_submitter": "False", "link_id": "t3_w6iaox", "parent_id": "t3_w6iaox", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "* Course books\n   * Assimil; Foreign Service Institute course of Modern Written Arabic and other grammar books (Deheuvels mainly)\n* Glossika\n* Immersion (YT, Arabic cartoons, shahid.net)\n\nCourse books and Glossika take me max 2h per day. I use a bit of Anki but just 10m max because in the past I ended using it wrong and my Arabic study was centred around Anki, not useful. For the rest of the day I try to be immersed in Arabic as much as I can and I just watch/listen what I like in my L1 but I do it in Arabic. It is working as far as I can tell because I can practice in some way all of the skill and learn a lot of vocabulary daily. And I don't kill myself using Anki for learning stuff", "created_utc": "1658579810.0", "edited": "False", "id": "ihbdr01", "is_submitter": "False", "link_id": "t3_w62ht2", "parent_id": "t3_w62ht2", "score": "5", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Ok, I understand better the matter now \n\nThank you for your time, you really helped me!", "created_utc": "1658576042.0", "edited": "False", "id": "ihb7q2n", "is_submitter": "True", "link_id": "t3_w5akfw", "parent_id": "t1_ihawqn5", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Thank for your answer.\n\nI have a question: I'm supposed to use it only with non-rational nouns (the grass) or can it be used in some contexts for rational nouns (humans, animals etc.)?", "created_utc": "1658557433.0", "edited": "False", "id": "ihajviy", "is_submitter": "True", "link_id": "t3_w5akfw", "parent_id": "t1_ih90za0", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "When choosing a language to study **for leisure** you should take into account linguistic families and to a degree the amount of resources existent for that language.\n\nFrench, Spanish and Italian are Romance languages and share a lot of linguistic elements from grammar to vocabulary. If you are a Romance language speaker you'll have a considerable advantage in studying a Romance language. If you are a Chinese guy, well, nope. You'll find a ton of differences and new grammatical concepts you'll have to understand firstly on a conceptual level\n\nIf you are a speaker of a Germanic language you'll find easier to study German probably. But if your L1 is English you can encounter some difficulties because of the \"weird\" evolution of English. \n\nAnd finally if you want an easy life with your language and you are not interested in facing difficulties related to lack of resources, well, you should also take this into account and study languages with a lot of resources", "created_utc": "1658245724.0", "edited": "False", "id": "igsi1yj", "is_submitter": "False", "link_id": "t3_w2vfuz", "parent_id": "t3_w2vfuz", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": ">languages are on demand\n\nWell, it depends. \n\nLanguages alone are a bit useless unless you want to teach the L2 you learned in university or you want to teach your L1 to foreigners; other option is to be an interpreter or a translator. It's a long path and you really have to think out of the box in order to earn a living.\n\nIf languages are not your passion/hobby/obsession, then a language degree is a bit of a risk. If languages are not your main interest you should consider a different degree more \"practical\" or simply requested (for real).", "created_utc": "1658243355.0", "edited": "False", "id": "igsbwcs", "is_submitter": "False", "link_id": "t3_w2sbg7", "parent_id": "t3_w2sbg7", "score": "19", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Some friends of mine studying Chinese and Japanese follow this custom of adopting Asian names and so do Chinese and Japanese students with local names.    \nPersonally speaking I don't know if this practice is common for other languages and cultural contexts. At least for the Middle East, from personal experience, I would say it is not common. I know many people from the Middle East from Morocco to Iran and no one does that thing with names. And if I'm not mistaken it can allow for some misunderstanding with Muslim people to adopt an Arabic name because only converts do so. So if you didn't accept Islam and you use an Arabic name you could be mistaken for a Muslim revert. Correct me if I didn't understand this thing", "created_utc": "1658139518.0", "edited": "False", "id": "igmj3zk", "is_submitter": "False", "link_id": "t3_w1vdpd", "parent_id": "t3_w1vdpd", "score": "23", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Premise: I have a solid base in the grammar of my L2 obtained thorough university classes so that's sorted out. \n\nI'm adopting the Ajatt approach: just behave like an Arab (I'm learning Arabic) and get exposure to the language as much as you can. And for making it sustainable/fun I just have my \"guilty pleasures\" and lazy times in my L2. For example instead of seeing an English Youtuber playing a specific game I search for an Arab gamer doing the same and I pretend to not know my L1 or English. Films, music tv series all in Arabic. That's problematic for one  or two specific English Youtubers that I really find entertaining, for them I make an exception\n\nFor the rest I just read a lot of graded readers, dialogues and text from every book I have (Assimil, grammar books, graded readers) and simplified news using the FSI course. I listen to the audios of these books and watch cartoons in my L2 like Naruto, Yu Gi Ho etc. In addition I do a little of Anki and 1h of Glossika. Usually I have min. 1h of active study, max. 2h, and the rest of the day is passive listening/watching. I find this approach sustainable because I get to to a bit of everything during the day and I just try to do everything I do usually in my L1 or in English in my L2.\n\nI think that it's helping me acquiring the real usage of the language that with grammar books or with classes I didn't got. I'm also learning a ton of words and by getting this much exposure I can avoid to kill myself by using Anki too much, just 10 min everyday", "created_utc": "1658088442.0", "edited": "False", "id": "igk1zse", "is_submitter": "False", "link_id": "t3_w1d9u8", "parent_id": "t3_w1d9u8", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Come tematica ho l'impressione che sia un campo minato. Così come c'è gente scema che fa figli, così ci sono padroni scemi che si prendono i cani e non ci capiscono nulla. L'unica soluzione è incentivare la consapevolezza sulla natura dei cani e su come vadano addestrati; mettere in atto misure restrittive che incentivino i giusti comportamenti e basta. Bandire le razze o cose del genere non so se possa essere effettivamente efficace, nel senso che non lo so proprio", "created_utc": "1658063698.0", "edited": "False", "id": "igij19g", "is_submitter": "False", "link_id": "t3_w148gl", "parent_id": "t3_w148gl", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": ">se sei una persona che aspira a una vita semplice e un lavoro specializzato, puoi cavartela anche solo con la triennale\n\nSi e no. Nel senso che stai usando un martello pneumatico per un discorso per il quale serve un bisturi, per rendere l'idea. Ci sono molte zone grigie e sfumature nel discorso. Già solamente nel mio ambito, lingue straniere orientali, una triennale è carta igienica per mille motivi; serve una magistrale che aggiunga conoscenze e competenze specialistiche ulteriori. Poi a seconda delle circostanze bisogna considerare anche percorsi paralleli per aggiungere \"sostanza\" alle lingue straniere che hai studiato e per ampliare le proprie possibilità lavorative.\n\nSul perché esista la triennale o su ITS e simili non mi infilo perché non ne so nulla onestamente", "created_utc": "1658003194.0", "edited": "False", "id": "igfqcqg", "is_submitter": "False", "link_id": "t3_w0hj00", "parent_id": "t3_w0hj00", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "I would say that we see the Romans just like everyone that historically speaking has ended up being part of the empire. It's a shared heritage from England to Egypt and from Syria to Spain basically. We owe a lot to the Romans but we are not them or their descendants. After the Romans many cultures and civilisations layered up upon the Roman layer, so they end up being just a part of the history of the peninsula just like Greeks, Longobards, Arabs and so on.    \n\nThe only difference between us, Italians, and other people is in quantity of artifacts we have to care for and of which we are proud. But as I said, nothing much to add to this national pride. We feel probably as everyone that live in lands ruled in the past by the empire", "created_utc": "1655717838.0", "edited": "False", "id": "id1ierh", "is_submitter": "False", "link_id": "t3_vez0bt", "parent_id": "t3_vez0bt", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Per anni non ho saputo quale fosse quella giusta pure io e ogni volta chiedevo in preda ai dubbi lmao", "created_utc": "1655445287.0", "edited": "False", "id": "icof6ln", "is_submitter": "False", "link_id": "t3_vdwc35", "parent_id": "t1_icmxcz6", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Numero 1: carta igienica    \n\nNumero 2: carta igienica + bidè", "created_utc": "1655108501.0", "edited": "1655121184.0", "id": "ic6jz9d", "is_submitter": "False", "link_id": "t3_vb6qk9", "parent_id": "t3_vb6qk9", "score": "36", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Poteva tranquillamente non esserci. Abbiamo ben altri problemi dei due spicci che si \"perdono\" con il reddito di cittadinanza", "created_utc": "1654861596.0", "edited": "False", "id": "ibuexk2", "is_submitter": "False", "link_id": "t3_v9356q", "parent_id": "t1_ibuekj9", "score": "3", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": ">serve a pagare il reddito di cittadinanza\n\nLe priorità bene in testa vedo", "created_utc": "1654855819.0", "edited": "False", "id": "ibu72hi", "is_submitter": "False", "link_id": "t3_v9356q", "parent_id": "t1_ibu50r3", "score": "8", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Mi crea non poco disagio l'idea dei baci sulle labbra tra parenti. I baci sulle labbra sono solo per persone non di famiglia e molto intime (fidanzati ecc.). Quando vedo i genitori baciare i figli così o simili mi viene sempre un po' di disgusto. Chissà da dove arriva sta abitudine strana", "created_utc": "1654613016.0", "edited": "False", "id": "ibhqj9i", "is_submitter": "False", "link_id": "t3_v6r7md", "parent_id": "t3_v6r7md", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Bizzarro che gli aghi da agopuntura riescano ad arrivare fino a un polmone. Credevano di avere davanti un vampiro da impalare?", "created_utc": "1654351036.0", "edited": "False", "id": "ib5aey4", "is_submitter": "False", "link_id": "t3_v4ne56", "parent_id": "t3_v4ne56", "score": "20", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Renzi sul libro paga dei sauditi e Salvini su quello dei russi. Benissimo!", "created_utc": "1654014404.0", "edited": "False", "id": "iaogad5", "is_submitter": "False", "link_id": "t3_v1nafl", "parent_id": "t3_v1nafl", "score": "17", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Well, believing a Turkish source speaking about the origins of the Kurds it's a bold move. You should search for scientific papers on the topic. It's an highly divisive one so many people have non-scientific interests involved in supporting one thesis over the other. Taking everything with a grain of salt it's a must", "created_utc": "1653899131.0", "edited": "False", "id": "iaiv6os", "is_submitter": "False", "link_id": "t3_v0v35t", "parent_id": "t3_v0v35t", "score": "1", "subreddit": "iran", "subreddit_id": "t5_2qhzq"}, {"author": "Playful_Custard_537", "body": "I love history, Medieval history more specifically, and another passion of mine is studying the Middle East. So, when choosing a degree my first idea was to go for an History degree. Then I thought: why not a language degree in Arabic? A bit more expendable and useful in my context and I would get to study more about the region itself. So I went for Arabic and added Farsi along the way (and a bit recklessly). Now I'm currently enrolled in a master degree in which I'm continuing Arabic and added Modern Hebrew just out of curiosity. In the free time I'm still studying Farsi.\n\nAfter graduating I have two plans but I'm still unsure about the path to choose:\n\n\\- Big and utopic plan: try to obtain a Phd in Islamic studies in my country and maybe to became a professor of Islamic studies one day\n\n\\- More cautious plan: becoming a teacher of my native language with Arabic/Farsi/Hebrew speakers as a specific target (but not only). After that maybe I could still try for the big plan if I can", "created_utc": "1653384652.0", "edited": "False", "id": "i9sdpg8", "is_submitter": "False", "link_id": "t3_uwepwl", "parent_id": "t3_uwepwl", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "How ironic", "created_utc": "1653224522.0", "edited": "False", "id": "i9k4luy", "is_submitter": "False", "link_id": "t3_uv7znk", "parent_id": "t3_uv7znk", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Ciò che dici è corretto com'è corretto quello che dico io. Solo che io mi limito a dire ciò che teoricamente va fatto. E non sono io ultimo arrivato a sostenere la necessità dell'immigrazione per supplire alle deficienze demografiche. Che l'Italia abbia delle circostanze che rendono l'implementazione della soluzione decisamente complessa non rende nullo il fatto che la soluzione non possa essere altro se non quella.", "created_utc": "1652800926.0", "edited": "False", "id": "i8yexwx", "is_submitter": "False", "link_id": "t3_urh1b5", "parent_id": "t1_i8ydfxl", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Per risolvere il problema della demografia in calo serve gente. Questa gente o nasce qui vivendo nel nostro contesto culturale o arriva da fuori e la assimili alla cultura locale. Non ci sono molte alternative. Sta allo Stato capire questo suo interesse vitale e organizzarsi di conseguenza per gestire questa operazione", "created_utc": "1652798929.0", "edited": "False", "id": "i8ya6fa", "is_submitter": "False", "link_id": "t3_urh1b5", "parent_id": "t1_i8y9cua", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Mi spiace se mi sono espresso male. Tu come la diresti?", "created_utc": "1652798588.0", "edited": "False", "id": "i8y9d0o", "is_submitter": "False", "link_id": "t3_urh1b5", "parent_id": "t1_i8y89yq", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Di per sè la notizia di un calo demografico non è strana. A meno di non essere Paesi in via di sviluppo è strutturale un calo delle nascite nelle economie avanzate.\nCiò che andrebbe fatto è assorbire più persone che si può in arrivo dalle economie in via di sviluppo strutturalmente in boom demografico. Le fai arrivare, le integri e le assimili culturalmente e hai le tue centinaia di migliaia di nuovi cittadini che ti servono.\nBasta leggere un manuale di geopolitica/demografia o aver letto e ascoltato Barbero sull'impero romano per farsi un'idea della dinamica", "created_utc": "1652789390.0", "edited": "False", "id": "i8xqdtv", "is_submitter": "False", "link_id": "t3_urh1b5", "parent_id": "t3_urh1b5", "score": "5", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Non so di gruppi di lettura ma se vuoi una soluzione alternativa ti basta andare su un sito di un'università italiana qualunque, cercare il corso di laurea in scienze politiche, cercare la lista degli insegnamenti, cercare gli insegnamenti che ti interessano (es. storia delle dottrine politiche) e segnarti i testi di studio usati in quell'insegnamento. Oppure puoi seguire le lezioni universitarie direttamente, tanto sono pubbliche e gratuite", "created_utc": "1652513733.0", "edited": "False", "id": "i8jx5k0", "is_submitter": "False", "link_id": "t3_upaoq0", "parent_id": "t3_upaoq0", "score": "27", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Stampa italiana + propaganda ucraina in tempo di guerra, cosa potrebbe mai andare storto?", "created_utc": "1652512866.0", "edited": "False", "id": "i8jw558", "is_submitter": "False", "link_id": "t3_upaylp", "parent_id": "t3_upaylp", "score": "38", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Context and sources pls", "created_utc": "1652442137.0", "edited": "False", "id": "i8fu6no", "is_submitter": "False", "link_id": "t3_uopfkf", "parent_id": "t3_uopfkf", "score": "42", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Playful_Custard_537", "body": "1) Wikipedia e documentari/YouTube\n\nUtili per avere una vaga idea di cosa si ha davanti. Niente di scientificamente accurato ma almeno un'idea la possono dare per sommi capi: date, principali eventi, eventuali fonti su cui approfondire. Non prendere tutto per oro colato.\n\n2) Manuali universitari\n\nLibri solitamente pubblicati da case editrici come Carocci, Mulino, Pearson, Laterza e ne sto certamente dimenticando. Si tratta solitamente di ottimi manuali scritti da specialisti e quindi con un minimo di approccio scientifico. Utili per entrare nel merito dell'argomento con testi affidabili.\n\n3) Enciclopedie specialistiche  \nLe classiche voci di enciclopedia che approfondiscono singoli temi. Cambiano da settore a settore. Per la storia contemporanea italiana ci sarà di sicuro un fracco di materiale ma non ne sono a conoscenza non essendo quello il mio ambito di studi. O le cerchi tu su internet faticando oppure chiedi in giro a chi ne può sapere di più (studenti o prof universitari; gente su internet). Utili perché danno informazioni condensate e a volte aggiungono informazioni bibliografiche per approfondire. Contro, magari non sono aggiornatissime.\n\n4) Riviste scientifiche/Papers\n\nSostanzialmente come le voci di enciclopedia ma aggiornate allo stato corrente della ricerca su quel dato argomento.\n\nSiti utili in tal senso:\n\n\\- Google scholar (buono ma maneggiare con cura)\n\n\\- Jstor.org (ottimo)\n\n5) Fonti primarie\n\nDa affrontare solamente quando le si sa collocare con cognizione all'interno del contesto storico che le ha generate. Se le si prende così a muzzo si rischia di farsi un'idea erronea o parziale o peggio di confondersi e basta. Prima si passa da chi ha scritto sulle fonti, si capisce che senso hanno e cosa implicano e poi si va alle fonti con questo bagaglio critico di conoscenze", "created_utc": "1652434211.0", "edited": "False", "id": "i8fjh0d", "is_submitter": "False", "link_id": "t3_uo9rt3", "parent_id": "t3_uo9rt3", "score": "3", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Well, we committed many atrocities in the colonies (Libya and Ethiopia), in Yugoslavia, in Greece, in the USSR, in Albania and we helped the Nazis with the Holocaust by sending Italian Jews to them. In Italy we are ignorant about our role in the Holocaust, we think only the Nazis were involved and we believe the myth of the \"Italiani brava gente\" (Italians are a good people)\n\nAbout the Holocaust:\n\nIn 1938 we had 47k Jews. After the \"Leggi Razziali\" (racial laws) many left the country (6k). Between 1939-1945 7579 Jews were identified and arrested; 6806 sent to concentration camps and 837 survived. We ended up in 1945 with 37k Italian Jews and 6k foreign Jews.\n\nSources:\n\n[https://www.governo.it/sites/governo.it/files/olocausto\\_italia.pdf](https://www.governo.it/sites/governo.it/files/olocausto_italia.pdf)\n\n[https://it.wikipedia.org/wiki/Olocausto\\_in\\_Italia](https://it.wikipedia.org/wiki/Olocausto_in_Italia)", "created_utc": "1652424309.0", "edited": "1652424518.0", "id": "i8f7tio", "is_submitter": "False", "link_id": "t3_uoj12r", "parent_id": "t3_uoj12r", "score": "8", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Playful_Custard_537", "body": "Absolutely no problem in your answer. Have a nice day!", "created_utc": "1652363055.0", "edited": "False", "id": "i8bffeu", "is_submitter": "True", "link_id": "t3_un65hx", "parent_id": "t1_i88scw2", "score": "2", "subreddit": "BeardTalk", "subreddit_id": "t5_30qjy"}, {"author": "Playful_Custard_537", "body": "Thank you for your answer! I'm trying to learn more about ingredients and chemicals and your answer is really welcome", "created_utc": "1652304418.0", "edited": "False", "id": "i88kjyp", "is_submitter": "True", "link_id": "t3_un65hx", "parent_id": "t1_i86tprf", "score": "1", "subreddit": "BeardTalk", "subreddit_id": "t5_30qjy"}, {"author": "Playful_Custard_537", "body": "Foreigner here! What's a \"sarsagi\"? Gangs or what? Are they related to the baltageya? Thanks in advance", "created_utc": "1652089104.0", "edited": "False", "id": "i7wfkkc", "is_submitter": "False", "link_id": "t3_ul7ga4", "parent_id": "t3_ul7ga4", "score": "1", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "Thanks for your answer!    \nWhich conditioner would you suggest for daily use? How should I use it combined with oil and butter?", "created_utc": "1652018832.0", "edited": "False", "id": "i7sr4cp", "is_submitter": "True", "link_id": "t3_ukxuto", "parent_id": "t1_i7scx3d", "score": "1", "subreddit": "BeardTalk", "subreddit_id": "t5_30qjy"}, {"author": "Playful_Custard_537", "body": "Having a marriage contract signed is different from consuming the marriage itself and Islamic law is pretty precise in this regard. In the context of Arabia and from the point of view of Muhammad, they were mostly political marriages aimed at securing alliances and loyalty with other social groups of the region\n\nEdit: English", "created_utc": "1651319363.0", "edited": "False", "id": "i6s3kl7", "is_submitter": "False", "link_id": "t3_uexhuk", "parent_id": "t3_uexhuk", "score": "3", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Playful_Custard_537", "body": "Per me 65€ su un rasoio elettrico sono già tanti per darti un'idea del metro di giudizio (vita da studente squattrinato). Per i rasoi di sicurezza d'accordo al 100%, non so se spenderei mai più di 30€ ma son sicuro che userò rasoi di sicurezza fino alla tomba. Per il momento quello della Gillette mi basta e avanza e i costi per le lame sono ottimi", "created_utc": "1649261845.0", "edited": "False", "id": "i3n5gbt", "is_submitter": "False", "link_id": "t3_txjbbf", "parent_id": "t1_i3n4ii3", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Per mia esperienza quelli poco costosi hanno la batteria che inizia a perdere colpi dopo poco tempo e hanno componenti che si rompono o si consumano di più. Poi non uso rasoi elettrici di frequente e non ho bisogno di roba costosa e seria quindi la mia esperienza è limitata a quelli scrausi da discount", "created_utc": "1649260923.0", "edited": "False", "id": "i3n318s", "is_submitter": "False", "link_id": "t3_txjbbf", "parent_id": "t1_i3mved3", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "\\*White man's burden intensifies\\*", "created_utc": "1648384113.0", "edited": "False", "id": "i2b18n2", "is_submitter": "False", "link_id": "t3_toodk2", "parent_id": "t3_toodk2", "score": "4", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Quizlet > Write mode  \n  \nAnki > flashcard asking for spelling    \n\nAnki > answer by writing\n\nOr you can exercise yourself doing dictations: you listen to an audio for which you have a transcript and try to write what you hear correctly", "created_utc": "1648284616.0", "edited": "False", "id": "i2681m5", "is_submitter": "False", "link_id": "t3_tok0sd", "parent_id": "t3_tok0sd", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": ">how can people read this with ease\n\nIt's just a matter of vocab. Quantity of known words. \n\nI suggest to you the **Foreign Service Institute** course of **Modern Written Arabic**. With it you'll build your vocab up to the point you'll be able to read newspapers and listen to news podcasts. This will be a solid foundation from which you can branch out to other sets of vocab in different fields\n\nLink 1:\n\n[https://www.fsi-language-courses.org/fsi-arabic-language-courses/](https://www.fsi-language-courses.org/fsi-arabic-language-courses/)\n\nLink 2:\n\nhttps://www.livelingua.com/arabic/courses/fsi", "created_utc": "1648112693.0", "edited": "False", "id": "i1wqem7", "is_submitter": "False", "link_id": "t3_tm0ra4", "parent_id": "t3_tm0ra4", "score": "6", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Sentences from course books, from drills, from Assimil, Glossika, phrasebooks and so on", "created_utc": "1647928887.0", "edited": "False", "id": "i1mp0qv", "is_submitter": "False", "link_id": "t3_tjgn7k", "parent_id": "t1_i1kthaw", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Anki/quizlet + sentences where the focus is on the grammatical structures you want to acquire", "created_utc": "1647887407.0", "edited": "False", "id": "i1k8kex", "is_submitter": "False", "link_id": "t3_tjgn7k", "parent_id": "t3_tjgn7k", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": ">I've been studying Japanese for about 2 months now.  \n>  \n>My brain doesn't seem to want to consciously or unconsciously absorb this language\n\nI think you have all the element in front of you. You are learning Japanese, not Spanish as you said. Japanese requires years of study, you can't measure your progress in two months.\n\nFind a **structured book** (grammar book; Assimil etc.) and follow it until the end, make **flashcards** with vocab and sentences and focus on learning the **first 1000 words** in any way possible. It is the minimum. Focus on the habit and in building consistence.\n\nedit: in this subreddit there is a really good guide I suggest you read", "created_utc": "1647590888.0", "edited": "False", "id": "i14n9ql", "is_submitter": "False", "link_id": "t3_tgst0o", "parent_id": "t3_tgst0o", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Frequency dictionary + flashcard or/and graded readers + flashcards", "created_utc": "1647587474.0", "edited": "False", "id": "i14j894", "is_submitter": "False", "link_id": "t3_tglvju", "parent_id": "t3_tglvju", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Oh no.", "created_utc": "1647548375.0", "edited": "False", "id": "i12blhg", "is_submitter": "False", "link_id": "t3_tggb8a", "parent_id": "t3_tggb8a", "score": "4", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "How many levels there are for Farsi with Pimsleur?", "created_utc": "1647502352.0", "edited": "False", "id": "i0zqezg", "is_submitter": "False", "link_id": "t3_tg1hdi", "parent_id": "t3_tg1hdi", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Playful_Custard_537", "body": "Thank you for the corrections!\n\nThe videogame is Nebuchadnezzar and it's on Steam", "created_utc": "1647452182.0", "edited": "False", "id": "i0wrgpv", "is_submitter": "True", "link_id": "t3_tfkg60", "parent_id": "t1_i0wnm2b", "score": "1", "subreddit": "ArabicStreak", "subreddit_id": "t5_5r5sfw"}, {"author": "Playful_Custard_537", "body": "Arabic and Farsi because I love middle eastern medieval history and I want to access the cultural production in these languages", "created_utc": "1647446174.0", "edited": "False", "id": "i0wcnal", "is_submitter": "False", "link_id": "t3_tez21q", "parent_id": "t3_tez21q", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "I advise you to search for the subreddit guide. It's well written and with plenty of tips", "created_utc": "1647446058.0", "edited": "False", "id": "i0wcd21", "is_submitter": "False", "link_id": "t3_tfbih7", "parent_id": "t3_tfbih7", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Here's the link to the page:\n\n[https://www.reddit.com/r/languagelearning/wiki/guide](https://www.reddit.com/r/languagelearning/wiki/guide)\n\nYou can access the wiki of the subreddit or the guide by downloading the pdf!", "created_utc": "1647349022.0", "edited": "False", "id": "i0qsegb", "is_submitter": "False", "link_id": "t3_temgoe", "parent_id": "t1_i0qrj08", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "I heard yesterday on the news that Russia lost in Ukraine more tanks than the tanks currently in service in the Italian army (204 vs 200). But no source to back this, so it is what it is", "created_utc": "1647347599.0", "edited": "False", "id": "i0qpqjx", "is_submitter": "False", "link_id": "t3_temljc", "parent_id": "t3_temljc", "score": "2", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Playful_Custard_537", "body": ">Also did you study the language yourself?\n\nYes, I'm studying it but I'm progressing slowly because I'm focusing more on MSA rather than a dialect for the moment. I'm learning it just for understanding a bit the songs of Abd al-Halim Hafez lol\n\n>Do you think my schedule is good to study effectively? Which aspects of learning should I focus on?\n\n5h every day for 6 days + 1-2h of speaking for 5 days it's a good amount of time. \n\nIf your goal is speaking you should focus on listening and speaking heavily, so finding courses (Assimil, Pimsleur, Kallimni Arabi, Glossika etc.) with audio, it's, well, a must. You can also use apps like HelloTalk where you can find native speakers of Egyptian Arabic learning your native languages. With it you can do language exchanges and add other hours of speaking the dialect for free and if you use the location filter you can set meetings with Egyptian speakers in your area and do the exchanges in person.\n\nI advise you to search for the guide for learning a language on r/languagelearning where you'll find many useful tips", "created_utc": "1647347354.0", "edited": "False", "id": "i0qpanb", "is_submitter": "False", "link_id": "t3_temgoe", "parent_id": "t1_i0qndaw", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": ">My goal is to obtain b1 or at least a2\n\nWith the same schedule but with different persons you'll have different results. Some will get faster results, some less. It's difficult to make a precise evaluation.\n\nHave you a background in MSA? Did you studied other languages in the past and with success? Do you know other Semitic languages? Is your native language linguistically near to Arabic?\n\nThe schedule to me seems feasible, but I would not focus on a goal. Just stick to the schedule, that's the most important thing.", "created_utc": "1647345663.0", "edited": "False", "id": "i0qmec4", "is_submitter": "False", "link_id": "t3_temgoe", "parent_id": "t3_temgoe", "score": "6", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "If you do not feel any motivation for learning Farsi and you want to learn Arabic with this mindset, I advise you to not do that. Linguistically speaking Farsi (Indo-european family) is easier than Arabic (semitic family) for an English speaker and with Arabic you must learn both Modern Standard Arabic and a dialect because of a socio-lingustic feature of Arabic called diglossia. You use two varieties of a single language in different contexts. If you use the wrong variety in a specific context, you'll face many different reactions but not really positive ones.\n\nIf your problem is loss of motivation because of lack of cultural immersion and difficulty in finding people who speak Farsi, you can download the app HelloTalk and use the location filter. By using it you can search for Farsi speaker in your area learning your native language. Good luck in your language journey!\n\n&#x200B;\n\nedit: added an explanation", "created_utc": "1647264386.0", "edited": "False", "id": "i0m4fcu", "is_submitter": "False", "link_id": "t3_tdkfzn", "parent_id": "t3_tdkfzn", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Playful_Custard_537", "body": "Extensive reading is the way to go. Read as much as you can and make it easy. You'll pick the language naturally without exhausting yourself with boring tasks. You can also use an SRS for words and sentences you want to learn specifically", "created_utc": "1647163342.0", "edited": "False", "id": "i0h3afr", "is_submitter": "False", "link_id": "t3_td21h7", "parent_id": "t3_td21h7", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Memrise and Quizlet are the most popular ones besides Anki", "created_utc": "1647089970.0", "edited": "False", "id": "i0d47z9", "is_submitter": "False", "link_id": "t3_tcfloi", "parent_id": "t3_tcfloi", "score": "4", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Joining the struggle of the working class under the Socialist banner", "created_utc": "1647076988.0", "edited": "False", "id": "i0co0qb", "is_submitter": "False", "link_id": "t3_tcbcfo", "parent_id": "t3_tcbcfo", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "SRS and comprehensible input are not mutually exclusive. You can use both. SRS with sentences, audio and images. Comprehensible input with materials aimed at beginners. But before going for comprehensible input you have to know some grammar. A good way of acquiring grammar is to put sentences in a SRS. In other words you need both SRS and comprehensible input. One without the other will slow you a bit, but together you can make rapid progress at least in the beginner stage", "created_utc": "1647022118.0", "edited": "False", "id": "i09p2yy", "is_submitter": "False", "link_id": "t3_tbw1lt", "parent_id": "t3_tbw1lt", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "So whose hell is this? The Christian one or the Islamic one? I'm curious regarding who took the religion thing right. Then I'll start regretting my agnosticism", "created_utc": "1646984624.0", "edited": "False", "id": "i07sawh", "is_submitter": "False", "link_id": "t3_tbb8vy", "parent_id": "t3_tbb8vy", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": ">Any resources would be helpful!!\n\n[https://www.livelingua.com/course/fsi/spoken\\_persian\\_(farsi)\\_course\\_](https://www.livelingua.com/course/fsi/spoken_persian_(farsi)_course_)\n\nYou'll find a pdf and mp3 for all the lessons.\n\n\"All of the lessons are in the spoken language. They represent Persian as illustrated by conversations based on everyday situations\" (pp. 13)\n\n&#x200B;\n\nPS. also the podcast [Chai and Conversation](https://www.chaiandconversation.com/) it's good and focus on conversational Farsi", "created_utc": "1646815622.0", "edited": "1646815809.0", "id": "hzy9d0a", "is_submitter": "False", "link_id": "t3_t9ljxa", "parent_id": "t3_t9ljxa", "score": "2", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Playful_Custard_537", "body": "You learn words from you beginner courses, from exposure and with flashcards. If you are starting a language, you have a book with chapters and vocabulary lists. You can also access YouTube videos with words and sentences for beginners. What you can do with these things is to put them in a flashcard app (Anki, Quizlet, Memrise etc.). With a flashcard app you can easily access all your words and sentences and review them daily until you memorize them. With flashcards you can really improve the speed of vocabulary acquisition and after a good amount of vocab learned (500-1000) and after finishing your first beginner course you can start using resources like short stories for beginners and you'll start learning words thorough exposure", "created_utc": "1646429090.0", "edited": "False", "id": "hzda1d6", "is_submitter": "False", "link_id": "t3_t6sam8", "parent_id": "t3_t6sam8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "My house gets invaded by orcs who kill everyone and destroy everything (Battle for Middle Earth II)", "created_utc": "1646418430.0", "edited": "False", "id": "hzci87o", "is_submitter": "False", "link_id": "t3_t6no4h", "parent_id": "t3_t6no4h", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "For Modern Standard Arabic (MSA) I think it's a bit imprecise. MSA is the mother tongue of no one, it's a second language acquired after the dialect of your area of origin thorough media and education. The dialect is acquired since birth by hearing and speaking with your family and outside the house. Also, the numbers of speakers are I suppose based on a count of the populations inside Arabic speaking countries. This is misleading because Arabic countries comprises many different linguistic minorities and ethnicities that are not Arabic speakers since birth and several of them have not a prominent level in MSA but understand the dialects", "created_utc": "1646382356.0", "edited": "False", "id": "hzals5n", "is_submitter": "False", "link_id": "t3_t60icx", "parent_id": "t3_t60icx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "almaany.com    \n\ncontext.reverso.net/translation/", "created_utc": "1646219986.0", "edited": "False", "id": "hz1bsou", "is_submitter": "False", "link_id": "t3_t4w47v", "parent_id": "t3_t4w47v", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "A silly question: what is the symbol on the Ukrainian flags I see sometimes?", "created_utc": "1646135559.0", "edited": "False", "id": "hywguat", "is_submitter": "False", "link_id": "t3_t3u7s6", "parent_id": "t3_t3u7s6", "score": "1", "subreddit": "ukraine", "subreddit_id": "t5_2qqcn"}, {"author": "Playful_Custard_537", "body": "No, perché a me va a rotoli la vita, a Putin non va a rotoli niente. Poi non vedo perché complicarmi l'esistenza quando starebbe ad altre realtà occuparsi attivamente di personaggi come Putin", "created_utc": "1645883574.0", "edited": "False", "id": "hyiif39", "is_submitter": "False", "link_id": "t3_t1v29t", "parent_id": "t3_t1v29t", "score": "12", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Speaking a foreign language. In my native language I'm quiet, but in a foreign language I start speaking about everything just because I like to use the foreign language", "created_utc": "1645820736.0", "edited": "False", "id": "hyfcdxw", "is_submitter": "False", "link_id": "t3_t1c9xf", "parent_id": "t3_t1c9xf", "score": "12", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Anki basically tells you when it's time to review something because you're on the verge of forgetting it. Other ways of remembering vocabulary are based on getting input (listening and reading) and producing output (speaking and writing). The main principle of every other method, other than Anki, is constant usage of the words you want to assimilate", "created_utc": "1645810514.0", "edited": "False", "id": "hyelqhe", "is_submitter": "False", "link_id": "t3_t19fnk", "parent_id": "t3_t19fnk", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Bad eyesight and almost deaf from the left ear. Guess I'm not dying in a trench", "created_utc": "1645803099.0", "edited": "False", "id": "hye2e9g", "is_submitter": "False", "link_id": "t3_t0rm7u", "parent_id": "t3_t0rm7u", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "I get a Daladier-Chamberlain feel for this situation", "created_utc": "1645691578.0", "edited": "False", "id": "hy7u82h", "is_submitter": "False", "link_id": "t3_t00aon", "parent_id": "t3_t00aon", "score": "8", "subreddit": "europe", "subreddit_id": "t5_2qh4j"}, {"author": "Playful_Custard_537", "body": "Sta cosa del latino è pura fuffa ideologica. È una lingua come un'altra, niente di diverso dal wolof o dall'indonesiano per dire. Molto meglio aggiungere più ore di storia o diritto o filosofia.", "created_utc": "1645623758.0", "edited": "False", "id": "hy3jyrx", "is_submitter": "False", "link_id": "t3_szfzjp", "parent_id": "t3_szfzjp", "score": "9", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Canottiere, mutande e calze le cambio ogni due giorni e lavo in lavatrice una volta la settimana. Gli altri vestiti più di rado perché mi doccio di frequente e li metto a rotazione, quindi a meno di macchie o sudate eccessive passano delle settimane. Nessuno si è mai lamentato di puzza o simili. Ricevo lamentele solo per lo stile \"da nonno\".   \nÈ sui jeans che non ho le idee chiare. C'è chi li lava e di frequente e chi dice che non va fatto perché si rovinano. Nel dubbio li cambio di frequente e li lavo quando mi sembra il caso o se si sporcano.", "created_utc": "1645564993.0", "edited": "False", "id": "hy0l75s", "is_submitter": "False", "link_id": "t3_sys9tj", "parent_id": "t3_sys9tj", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Quello scenario è \"Scraping the barrel\" di Hearts of Iron IV. Se arriviamo a quel punto siamo ben che morti", "created_utc": "1645524474.0", "edited": "False", "id": "hxy4t53", "is_submitter": "False", "link_id": "t3_syi466", "parent_id": "t3_syi466", "score": "18", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "See the analysis of geopolitical analysts. Other opinions would be just useless", "created_utc": "1645512091.0", "edited": "False", "id": "hxxpbvu", "is_submitter": "False", "link_id": "t3_sy8u4k", "parent_id": "t3_sy8u4k", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Try to remember the reasons you started Japanese. Forget about goals. And build small habits. Do a bit everyday and focus just on showing up for the task. You have time and no need to hurry. If you do too much everyday you'll just exhaust yourself. You'll learn Japanese in years, no way around.", "created_utc": "1645452415.0", "edited": "False", "id": "hxtziry", "is_submitter": "False", "link_id": "t3_sxqcv1", "parent_id": "t3_sxqcv1", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": ">how do i now find the other variations of this root word?\n\nGrammar should give you enough knowledge for you to obtain the verbal forms from I to X, the participles (actives and passives); masdars and the passive form of the verbs.\n\nYou should pick a grammar book and start from there. Or you can use a dictionary or the website almaany.com", "created_utc": "1645445793.0", "edited": "False", "id": "hxtocgz", "is_submitter": "False", "link_id": "t3_sxrtuz", "parent_id": "t3_sxrtuz", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Sorry I should have paid more attention to the wording of your question. To start learning grammar I would say that six hundred words are a good starting point. You can find lists with these words easily; they have the most common verbs, nouns, adjectives, adverbs etc.", "created_utc": "1645080680.0", "edited": "False", "id": "hxa2f1z", "is_submitter": "False", "link_id": "t3_stvbs2", "parent_id": "t1_hx96425", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Personally, I got burned out with Anki and language learning many times in the past. This because I overwhelmed myself with too many hours/cards on Anki that in brief time became unbearable. So, my tip would be: start easy, even for ten minutes a day and rebuild the habit gradually. And what you study on Anki try to study it differently, so you don't rely solely on Anki", "created_utc": "1645080438.0", "edited": "False", "id": "hxa22vz", "is_submitter": "False", "link_id": "t3_suhndu", "parent_id": "t3_suhndu", "score": "3", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "Playful_Custard_537", "body": "You should know at least the 1000 most frequent words. If you want to have a solid vocabulary foundation you should aim for the 2000 most common words. From that point you can study vocabulary from fields you are interested in (politics, literature, philosophy etc.).\nIf you start learning the nominal sentence and the verbal one you can form sencences easily and you'll be able to study these words in context.", "created_utc": "1645022166.0", "edited": "False", "id": "hx6dh9y", "is_submitter": "False", "link_id": "t3_stvbs2", "parent_id": "t3_stvbs2", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Hebrew and to a certain degree Farsi. They use different letters for the same sounds. And they write only some vowels. So you can struggle a bit when starting from scratch", "created_utc": "1645000509.0", "edited": "False", "id": "hx5f8a8", "is_submitter": "False", "link_id": "t3_st9x2o", "parent_id": "t3_st9x2o", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Lmao didn't noticed it. I'm trying to download it for Android but it seems that it's not present anymore on the store", "created_utc": "1644848292.0", "edited": "False", "id": "hwwsgbu", "is_submitter": "False", "link_id": "t3_srkhgg", "parent_id": "t1_hwwmhy9", "score": "1", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Playful_Custard_537", "body": "Dopo la tremenda fine di The Man in the High Castle, GoT e The Expanse e dopo aver visto quella trashata di The Hobbit ho smesso di avere aspettative. \nGli americani adesso hanno una situazione politica decisamente polarizzata tra i fasci e i razzisti da un lato e il woke dall'altro che si menano di santa ragione. E sta cosa per forza si riflette anche nella produzione di libri, film e serie.\nSta serie su Lotr userà Lotr come mezzo per parlare agli americani dei problemi americani, solo in secondo luogo sarà Lotr. Quindi ci metto la croce sopra e parto senza speranze", "created_utc": "1644827410.0", "edited": "False", "id": "hwvz4h3", "is_submitter": "False", "link_id": "t3_ss3gh0", "parent_id": "t3_ss3gh0", "score": "64", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Apps I do not know but the following website is useful because you can get the IPA of the word you're searching for:\n\nhttps://www.vajehyab.com/?q=%D8%A8%D8%A7%D9%84&d=en", "created_utc": "1644784524.0", "edited": "False", "id": "hwtlm7s", "is_submitter": "False", "link_id": "t3_srkhgg", "parent_id": "t3_srkhgg", "score": "3", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Playful_Custard_537", "body": "The idea that I get from the app is that you should use it for searching people near you that speak your TL, contact them, set an appointment, and make a language exchange in person. X time in a language and x time in the other. If you want a more safe thing you can choose people from the same sex of you.\n\nOther useful usage is the Moments thing where you can get your writing/speaking checked.", "created_utc": "1644762013.0", "edited": "False", "id": "hws2mus", "is_submitter": "False", "link_id": "t3_sr92cb", "parent_id": "t3_sr92cb", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Assimil, frequency dictionary for the first 2000 words, Anki and input", "created_utc": "1644692349.0", "edited": "False", "id": "hwog2yd", "is_submitter": "False", "link_id": "t3_sqvqvf", "parent_id": "t3_sqvqvf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "First: Assimil for getting a grasp of the language.    \nThen, I grab a frequency dictionary for the most common 2000 words and start putting sentences on Anki. This paired with a grammar book more detailed than Assimil for gramnar explanation", "created_utc": "1644609026.0", "edited": "False", "id": "hwjpo8t", "is_submitter": "False", "link_id": "t3_sq70yc", "parent_id": "t3_sq70yc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "I'm glad that you found them useful! Yep, the guy is really informative and chill. I hope his channel grows in numbers", "created_utc": "1644519754.0", "edited": "False", "id": "hwejxpj", "is_submitter": "False", "link_id": "t3_sp8s9o", "parent_id": "t1_hwdv6d9", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "On the channel Fintgam Languages the guy made two videos on how to teach your language to foreigners based on the principle of comprehensible input.\nThey're named \"Make money teaching languages on YouTube\" and \"Easiest way to make a language YouTube channel (part2)\".\nI think they're well made and really useful", "created_utc": "1644508876.0", "edited": "False", "id": "hwdq72g", "is_submitter": "False", "link_id": "t3_sp8s9o", "parent_id": "t3_sp8s9o", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "We are stupid as the other monkeys, just less hairy and more loud and with nukes. So be cautious", "created_utc": "1644502204.0", "edited": "False", "id": "hwd99sr", "is_submitter": "False", "link_id": "t3_sp68zp", "parent_id": "t3_sp68zp", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "As a person who doesn't have faith I don't really know. Maybe you are asking about finding meaning and purpose in this life, how do you have a moral compass and stuff related. I just try not to be a shitty person and to help others if I'm able. For the rest I figure it out day by day I think", "created_utc": "1644501883.0", "edited": "False", "id": "hwd8k96", "is_submitter": "False", "link_id": "t3_soxenk", "parent_id": "t3_soxenk", "score": "2", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "The salty smell you smell when near to the sea. In Italian we call it \"salsedine\"", "created_utc": "1644496400.0", "edited": "False", "id": "hwcxt5d", "is_submitter": "False", "link_id": "t3_soxkdx", "parent_id": "t3_soxkdx", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "\"White person shocks locals by speaking [insert language]!\"    \nJust so annoying. Native English speakers take bilingualism like some sort of superpower when in the world it's just them that speak only one language. It's so condescending seeing white persons making videos of themselves \"shocking\" native speakers of a different language", "created_utc": "1644482394.0", "edited": "False", "id": "hwcf5d6", "is_submitter": "False", "link_id": "t3_son4ou", "parent_id": "t3_son4ou", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Inconsistent spelling", "created_utc": "1644426412.0", "edited": "False", "id": "hw8w2ul", "is_submitter": "False", "link_id": "t3_sof5d6", "parent_id": "t3_sof5d6", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "“Your good thoughts, good words and good deeds alone will be your intercessors. Nothing more will be wanted. They alone will serve you as a safe pilot to the harbour of Heaven, as a safe guide to the gates of paradise.”\r  \nZoroaster", "created_utc": "1644254804.0", "edited": "False", "id": "hvyuywg", "is_submitter": "False", "link_id": "t3_smpnf2", "parent_id": "t3_smpnf2", "score": "30", "subreddit": "HistoryMemes", "subreddit_id": "t5_2v2cd"}, {"author": "Playful_Custard_537", "body": ">I would like the aqeedah which almost all muslims agree with.\n\n* al-Aqida al-Tahawiyyah by Ahmad al-Tahawi (d. 933)\n* al-Aqida al-Nasafiyya by Najm ad-Din al-Nasafi (d. 1142)\n* al-Aqida al-Wasitiyya by Ibn Taymiyyah (d. 1328)\n\nIf you follow the hanafi madhab the Nasafi one should be fine because if I'm not mistaken it follows Maturidi principles", "created_utc": "1644177134.0", "edited": "False", "id": "hvumvqm", "is_submitter": "False", "link_id": "t3_sm2guq", "parent_id": "t3_sm2guq", "score": "1", "subreddit": "islam", "subreddit_id": "t5_2qhbp"}, {"author": "Playful_Custard_537", "body": "Well, monolingual dictionaries should be fine in this regard, I think. Correct me otherwise", "created_utc": "1644176659.0", "edited": "False", "id": "hvulov4", "is_submitter": "False", "link_id": "t3_sm5h7k", "parent_id": "t3_sm5h7k", "score": "4", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "The Hobbit thrilogy", "created_utc": "1643716282.0", "edited": "False", "id": "hv4ebto", "is_submitter": "False", "link_id": "t3_shflwq", "parent_id": "t3_shflwq", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Didn't your instructor give you insights about where to find academic sources in your field of study?", "created_utc": "1643670399.0", "edited": "False", "id": "hv24u27", "is_submitter": "False", "link_id": "t3_sh3ees", "parent_id": "t3_sh3ees", "score": "6", "subreddit": "iran", "subreddit_id": "t5_2qhzq"}, {"author": "Playful_Custard_537", "body": "Ops I worded bad my question. In other words: what type of cards did you used and how did you make your cards?", "created_utc": "1643471696.0", "edited": "False", "id": "huqc0pz", "is_submitter": "False", "link_id": "t3_sfjglc", "parent_id": "t1_huq7dy8", "score": "3", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "Playful_Custard_537", "body": "How your cards are structured?", "created_utc": "1643467978.0", "edited": "False", "id": "huq3jpo", "is_submitter": "False", "link_id": "t3_sfjglc", "parent_id": "t3_sfjglc", "score": "4", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "Playful_Custard_537", "body": "I'm curious, what's the deal with that neighborhood?", "created_utc": "1643273393.0", "edited": "False", "id": "huf0vdr", "is_submitter": "False", "link_id": "t3_sdbgj2", "parent_id": "t1_huc4wsk", "score": "2", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "You anticipated me for 10m lmao", "created_utc": "1643127259.0", "edited": "False", "id": "hu62djf", "is_submitter": "False", "link_id": "t3_scdx7m", "parent_id": "t1_hu608x0", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "My suggestion would be to go for Uzbek. Better than Mandarin on every aspect", "created_utc": "1643127234.0", "edited": "False", "id": "hu62b8j", "is_submitter": "False", "link_id": "t3_scdx7m", "parent_id": "t3_scdx7m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "It depends by the class you belong. A rich person will live a good life almost everywhere. A poorer or less richer person will live better in countries with a strong welfare and bad where there is not. Generally a person will live better in a first world country and less better in a developing one. And so on", "created_utc": "1643044455.0", "edited": "False", "id": "hu1hpeb", "is_submitter": "False", "link_id": "t3_sb5gci", "parent_id": "t3_sb5gci", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "You can learn words with images. For less obvious words you can put them in sentences. After you reach an intermediate level you can start studying words using monolingual dictionaries with definitions and synonyms", "created_utc": "1642958748.0", "edited": "False", "id": "htwhym5", "is_submitter": "False", "link_id": "t3_satog2", "parent_id": "t3_satog2", "score": "6", "subreddit": "Anki", "subreddit_id": "t5_2s9lm"}, {"author": "Playful_Custard_537", "body": "Well, Islamic Golden Age and you'll find that almost all of the great writers, historiographers, poets, physicians and so on were from people different from the Arabs that learned Arabic and wrote their works in Arabic", "created_utc": "1642880404.0", "edited": "False", "id": "hts51j9", "is_submitter": "False", "link_id": "t3_sa38qo", "parent_id": "t3_sa38qo", "score": "21", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Every language that uses the Arabic script. The main two beign Arabic and Farsi of Iran. Less common languages are Dari, Kurdish Sorani and Urdu", "created_utc": "1642719512.0", "edited": "False", "id": "htisxjh", "is_submitter": "False", "link_id": "t3_s8rxpm", "parent_id": "t3_s8rxpm", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Italian here.    \nIt is a formal way of writing. You put emphasis on pronouns referred to your interlocutor. You usually entounter this extremely formal writing in emails to professors in university or in work contexts.\nIf I'm not mistaken we call it \"capital letter of courtesy\"", "created_utc": "1642715834.0", "edited": "False", "id": "htilgj2", "is_submitter": "False", "link_id": "t3_s8rdnf", "parent_id": "t3_s8rdnf", "score": "15", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Yeah, I hate also English for this reason. But with English my main problem are the h. In Italian we do not pronounce them", "created_utc": "1642689189.0", "edited": "False", "id": "htgmyno", "is_submitter": "False", "link_id": "t3_s873gw", "parent_id": "t1_htgin8l", "score": "2", "subreddit": "hebrew", "subreddit_id": "t5_2rk3f"}, {"author": "Playful_Custard_537", "body": "I struggle in understanding how a word is written because the pronunciation of some letters can be undistinguishable:\nק כ ח\nא ע\nModern Hebrew is not really precise in the correspondence between sounds and letters. Speaking as a guy native in a pretty regular language and who is studying also Arabic.", "created_utc": "1642672409.0", "edited": "False", "id": "htfvak4", "is_submitter": "False", "link_id": "t3_s873gw", "parent_id": "t3_s873gw", "score": "2", "subreddit": "hebrew", "subreddit_id": "t5_2rk3f"}, {"author": "Playful_Custard_537", "body": "Reading the comments in order to see if translators are useless. But I guess I'm safe lol", "created_utc": "1642617341.0", "edited": "False", "id": "htcmqah", "is_submitter": "False", "link_id": "t3_s7oy5c", "parent_id": "t3_s7oy5c", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Field: Islamic studies    \n\nWhat theological position can help us distinguish between Sunni Orthodox Islam and Reformist (also called generically \"Islamism\") ideologies?    \n\nThe imposter will answer random things, correct in part but too much vague like violence and the like. The expert will go directly to the stances on tawassul (intercession between God and humanity) and tasawwuf (Sufism) of the person/group", "created_utc": "1642256831.0", "edited": "False", "id": "hsrntxe", "is_submitter": "False", "link_id": "t3_s40jxv", "parent_id": "t3_s40jxv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "In uni in my degree it's mandatory to choose a second language.  I study Arabic and I studied Farsi  and Ihad to choose between many languages I was not intrested or didn't had anything in common in my field but also I didn't wanted to study English so now I'm studying Biblical Hebrew and Modern Hebrew. And I'm loving Modern Hebrew. Before I had no clue or any curiosity towards it but now I'm obsessed with it lol", "created_utc": "1642256133.0", "edited": "False", "id": "hsrmcu8", "is_submitter": "False", "link_id": "t3_s4cwh5", "parent_id": "t3_s4cwh5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Same. I hate waking up early, but with my gf I can wake up at any hour just to cuddle with her", "created_utc": "1642152067.0", "edited": "False", "id": "hslwzia", "is_submitter": "False", "link_id": "t3_s3gcrh", "parent_id": "t1_hsl6h4o", "score": "31", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": ">**What activities do you do?**\n\n* Extensive reading + listening with the Foreing Service series for Modern Standard Arabic\n* Anki for vocabulary learning for Hebrew and Farsi\n* Assimil for Hebrew and Farsi\n* Pimsleur for Hebrew\n\n>**How much time per activity on average?**\n\n* Extensive reading + listening with the FSI series can take from 2 to 3 hours with the schedule I have during these weeks\n* Anki + Assimil almost an hour at the moment\n* Pimsleur requires 30 minutes for lesson\n\n>**How much time per day overall?**\n\n* Let's say: 2h (reading) + 1h (Anki) + 30m (Pimsleur) = 3h 30m\n* All in the early morning\n\n>**One or more languages?**\n\n* Arabic (intermediate); Farsi (false beginner); Hebrew (beginner)\n* I know that this routine won't be eternal unfortunately because I'm supposed to study also for other classes and I have other deadlines but It's working in this period and I hope that in the summer I'll be able to dedicate a lot more time to the languages I'm studying now", "created_utc": "1641923913.0", "edited": "False", "id": "hs8hlla", "is_submitter": "False", "link_id": "t3_s0r4m2", "parent_id": "t3_s0r4m2", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "I prefer to learn in a more active way. I tried setting a different language on my smartphone but everything becomes just slower and I do not find it useful. And if I need to do something different from the routine I just  cannot", "created_utc": "1641746550.0", "edited": "False", "id": "hrxk9g8", "is_submitter": "False", "link_id": "t3_rzf91a", "parent_id": "t3_rzf91a", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Historically speaking Kingdom of Heaven (2005) is terrible. But from an entertaining piont of view I just love it. I could watch againg and again the director's cut. I especially love the soundtracks of the film.", "created_utc": "1641666958.0", "edited": "False", "id": "hrt32tq", "is_submitter": "False", "link_id": "t3_ryo4rr", "parent_id": "t3_ryo4rr", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "It is really dangerous to enforce laws about child birth. China having to modernise itself and to raise the standards of living enforced child birth limits. Now that the living standars are highers the law on child birth is backfiring heavily. This because more economical development lower the births, and the laws on child birth speeded up heavily the process so now China has a really big problem with ageing population.\nIf Egypt enforces laws in this sense and develop the country, it has to calculate perfectly the timing for removing the laws.", "created_utc": "1640649122.0", "edited": "False", "id": "hq7ltx6", "is_submitter": "False", "link_id": "t3_rpnnmt", "parent_id": "t3_rpnnmt", "score": "-1", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "I know little about India so I have an orientalised idea derived from stereotypes and Hollywood films. I know for certain that India is surely the opposite of the sparse ideas I have", "created_utc": "1640648602.0", "edited": "False", "id": "hq7kmzi", "is_submitter": "False", "link_id": "t3_rpg89m", "parent_id": "t3_rpg89m", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Try this:\n\n[https://ejtaal.net/](https://ejtaal.net/)\n\nYou can find dictionaries in English and French for Classical Arabic:\n\n* Kazimirsky\n* Lane + Supplement\n\nAlso Arabic ones:\n\n* Lisan al-3arab\n* Taj al-3arus\n\nFor Modern Standard Arabic you can use the Hans Wehr one.\n\nThose are the dictionaries I use but on that website there are more also in Urdu and for specific topics like Quranic exegesis and so on", "created_utc": "1640453510.0", "edited": "False", "id": "hpxn2oy", "is_submitter": "False", "link_id": "t3_roacza", "parent_id": "t3_roacza", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Academic", "created_utc": "1640348975.0", "edited": "False", "id": "hpsvkh1", "is_submitter": "False", "link_id": "t3_rnl23i", "parent_id": "t3_rnl23i", "score": "11", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Islamic theology... How? Lmao", "created_utc": "1639661384.0", "edited": "False", "id": "hos0cs7", "is_submitter": "False", "link_id": "t3_rhpnuh", "parent_id": "t3_rhpnuh", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "English. I find it useful in many ways but I prefer other languages from all the others points of view", "created_utc": "1639651950.0", "edited": "False", "id": "horlgmr", "is_submitter": "False", "link_id": "t3_rh827d", "parent_id": "t3_rh827d", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "I do this to my gf hahah", "created_utc": "1639644935.0", "edited": "False", "id": "hord0we", "is_submitter": "False", "link_id": "t3_rhdfpn", "parent_id": "t1_hor2sde", "score": "2", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "Playful_Custard_537", "body": "Persia / Iran", "created_utc": "1639595553.0", "edited": "False", "id": "hooi7yh", "is_submitter": "False", "link_id": "t3_rh186t", "parent_id": "t1_honmo0f", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "A masdar express the meaning of the verb but without connotations of time and behaves as a name. It's a way for Arabic of creating new words.\n\nأسلم he submitted\n\nيسلم he is submitting\n\nإسلام islam / submission", "created_utc": "1639254284.0", "edited": "False", "id": "ho5ty3x", "is_submitter": "False", "link_id": "t3_rdp33u", "parent_id": "t1_ho475fd", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "I just saw the part 1. Tomorrow I will read the articles written by the shaykh and asap I will watch also the part 2. I found it really interesting and informative! Thank you", "created_utc": "1638744663.0", "edited": "False", "id": "hndvzet", "is_submitter": "True", "link_id": "t3_r9l9qv", "parent_id": "t1_hnclnrq", "score": "1", "subreddit": "islam", "subreddit_id": "t5_2qhbp"}, {"author": "Playful_Custard_537", "body": "You will find full vocalisation only in the Qur'an and in special texts for childrens or in books aimed at learners of Arabic.    \n\nIn all of the other cases, \"in the wild\", you'll find no vocalisation for the exception sometimes for a vowel in a word that otherwise would be ambiguous.    \n\nPersonally what I do is to learn words with vocalisation/audio. And at the same time, by knowing grammar rules, I know that I can vocalise easily the word if I encounter it without vowels because I'm able to understand syntax and morphology.\n\nIn practice:    \n\n-learn with vowels    \n\n-learn words in context in a sentence    \n\n-learn the grammar rules for syntax and morphology\n\nEdit: typos and layout", "created_utc": "1638743858.0", "edited": "False", "id": "hndtyug", "is_submitter": "False", "link_id": "t3_r9q4yu", "parent_id": "t3_r9q4yu", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Deheuvels? Lesson 15th? I studied MSA on this book!", "created_utc": "1638640368.0", "edited": "False", "id": "hn7vuv8", "is_submitter": "False", "link_id": "t3_r274pq", "parent_id": "t3_r274pq", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "It depends by your object. Why do you want to study Arabic? Based on this answer you will choose MSA or a dialect", "created_utc": "1638367372.0", "edited": "False", "id": "hmsoind", "is_submitter": "False", "link_id": "t3_r68f8o", "parent_id": "t3_r68f8o", "score": "5", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Well, why do you hate Arabs? They are 400 million people. So you have to think about the circumstances that made you hate \"Arabs\". \nWhat happened? Why? Did someone hurt you and how?", "created_utc": "1638098908.0", "edited": "False", "id": "hme22rs", "is_submitter": "False", "link_id": "t3_r3wpaw", "parent_id": "t3_r3wpaw", "score": "3", "subreddit": "islam", "subreddit_id": "t5_2qhbp"}, {"author": "Playful_Custard_537", "body": "Aadenr Accefnors", "created_utc": "1637802496.0", "edited": "False", "id": "hlz567e", "is_submitter": "False", "link_id": "t3_r1gnn3", "parent_id": "t3_r1gnn3", "score": "1", "subreddit": "teenagers", "subreddit_id": "t5_2rjli"}, {"author": "Playful_Custard_537", "body": "As books I suggest:\n1) Foreign Service Institute Modern Standard Arabic corse in three volumes with audio. It is focused on making you able to read Arabic press\n2) Assimil Arabic With Ease with audio. A bit pricey but with it you learn the MSA that the FSI do not covers\n\nThese two resources would get a non-native to an upper-internediate level and I myself benefitted a lot from them.", "created_utc": "1637678356.0", "edited": "False", "id": "hlrsjx4", "is_submitter": "False", "link_id": "t3_r0cz24", "parent_id": "t3_r0cz24", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "What really helped me raising my level all by myself in MSA were Assimil Arabic With Ease (with audio) and the Foreign Service Institute Modern Standard Arabic Course in three volumes.\n\nI also use Memrise, Clozemaster and Hellotalk for additional exposure.\n\nIf you want to improve you have to learn a ton of new words and to be exposed to the language daily with reading and listening at least. If you are lucky you can find Arab speakers that can kindly help you practising MSA", "created_utc": "1637596151.0", "edited": "False", "id": "hlnee7j", "is_submitter": "False", "link_id": "t3_qkkwrw", "parent_id": "t3_qkkwrw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Yeah but who determine and how what is \"hard work\" firstly? It does not sound really scientific as thing honestly. And it is not only a discussion about hard work because in a work environment and not only there, there are a lot of factors to consider before making judgements about \"hard work\"", "created_utc": "1637545007.0", "edited": "False", "id": "hll2xs5", "is_submitter": "False", "link_id": "t3_qyz55h", "parent_id": "t3_qyz55h", "score": "1", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "CEOs and gurus of economics", "created_utc": "1637249294.0", "edited": "False", "id": "hl4ox85", "is_submitter": "False", "link_id": "t3_qwn9t5", "parent_id": "t3_qwn9t5", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "In my opinion the problem is not overpopulation but to build a system where wealth is redistributed equally among the members of the society.\nEgypt has the demographic of a developing country, so an explosion of new people beign born and entering the workforce every year.\nBut if you look to more developed countries like in the West, they have the opposite problem, they lack demographic increase. This because with development cames less desire to make children in general.\n\nSo the solution is not overpopulation but how the socio-economic system is built and how wealth is redistributed.", "created_utc": "1637232340.0", "edited": "False", "id": "hl3u0yb", "is_submitter": "False", "link_id": "t3_qwkyr8", "parent_id": "t3_qwkyr8", "score": "2", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "Idiots because with feminism we can solve also all men's problems.\nMra are only right wingers opposed to feminism that want to defend the status quo, the patriarchal society", "created_utc": "1637182200.0", "edited": "False", "id": "hl19e7h", "is_submitter": "False", "link_id": "t3_qw6kf5", "parent_id": "t3_qw6kf5", "score": "-1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Well, just in case: marhaban officier Karim! How are you?", "created_utc": "1637069008.0", "edited": "False", "id": "hkum73q", "is_submitter": "False", "link_id": "t3_qv66hb", "parent_id": "t3_qv66hb", "score": "28", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "I use social media following content in the language I'm learning (Arabic). So if I use them I'm sure that I will also do some comprehension practice.\nBut if you want to replace them I suggest you to replace them with apps related to your hobbies (reading, gardening, language learning etc.)", "created_utc": "1637016795.0", "edited": "False", "id": "hks3suw", "is_submitter": "False", "link_id": "t3_quoqo7", "parent_id": "t3_quoqo7", "score": "1", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "Capitalism", "created_utc": "1636930574.0", "edited": "False", "id": "hkndmrj", "is_submitter": "False", "link_id": "t3_qttky1", "parent_id": "t3_qttky1", "score": "-14", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "You can try with forvo.com", "created_utc": "1636810600.0", "edited": "False", "id": "hkgehwm", "is_submitter": "False", "link_id": "t3_qstorv", "parent_id": "t3_qstorv", "score": "3", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "I highly recommend two resources:\n1) Foreign Service Institure course of Modern Standard Arabic in three volumes with pdfs and audios. I'm studying on it myself and thanks to it I'm sble to read newspapers in MSA. You can find it online and gratis.\n2) Assimil Arabic With Ease, with audio, you have to buy it, you can find some pdfs on internet but the audio is essential to this method.\nI tried many resources during the years and these two are the only one giving me the results I want. So I suggest them to you.", "created_utc": "1636810032.0", "edited": "False", "id": "hkgdjqx", "is_submitter": "False", "link_id": "t3_qsz477", "parent_id": "t3_qsz477", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "1) I do not like being angry or to hurt others 2) I'm lazy, being angry and to fuss over everything it is tiring and stressful 3) Every person just deserve kindness and empathy, you never know how your actions can impact the other person and which consequences could there be for her mental health", "created_utc": "1636798944.0", "edited": "False", "id": "hkfz33w", "is_submitter": "False", "link_id": "t3_qsj87v", "parent_id": "t3_qsj87v", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "In a verbal sentence there is always agreement in gender. Masculine with masculine and feminine with feminine. \n\nThe scheme is as it follows:\n\nVerb masculine singular + Subject masculine singular\n\nVerb masculine singular + Subject masculine plural\n\nVerb feminine singular + Subject feminine singular\n\nVerb feminine singular + Subject feminine plural\n\nThe correct phrase is:\n\nتريد الطالبات طعامًا\n\n(You forgot to use the accusative form in \"food\" that is the object of the verb \"to want\").\n\nYou use the plural forms of the verbs **only** when the subject comes before of the verb in the phrase.", "created_utc": "1636654600.0", "edited": "False", "id": "hk8bq8n", "is_submitter": "False", "link_id": "t3_qrb25i", "parent_id": "t3_qrb25i", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Concerning MSA, in my personal experience, these two are awesome resources that will get you to an intermediate-advanced level in MSA (not Classical Arabic btw):\n\n* Foreign Service Institute Modern Standard Arabic in three volumes\n   * You can easily find it online with pdf and audios;\n   * Useful if you want to be able to understand Arabic press;\n* Assimil Arabic With Ease\n   * You have to buy the book with the audios and it is a bit pricey (in Italy around 70 euros);\n   * It covers the MSA that the FSI skip, so a more \"day-to-day\" form of MSA;\n\nConcerning the dialects I do not really know what to suggest. I hope others will give you some tips.", "created_utc": "1636654138.0", "edited": "False", "id": "hk8akmv", "is_submitter": "False", "link_id": "t3_qrbo5b", "parent_id": "t3_qrbo5b", "score": "1", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Capitalism", "created_utc": "1636289659.0", "edited": "False", "id": "hjo216o", "is_submitter": "False", "link_id": "t3_qoiavv", "parent_id": "t3_qoiavv", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Try to warn in all the possible ways the Usa from the 9/11 attacks.\nSo we can avoid 20 years of stupid wars and consequences that ended up messing half of the world", "created_utc": "1636217151.0", "edited": "False", "id": "hjkhhuc", "is_submitter": "False", "link_id": "t3_qo3zzz", "parent_id": "t3_qo3zzz", "score": "4", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "My 2 cents:\n\nYou are L1 in Arabic which is a Semitic language. So there's pretty much little or nothing in common with German, a Germanic language, or Russian, a Slavic one.\n\nPersonally I would suggest German because of your prior study of English. It is not of much help but it a less difficult passage than with Russian.", "created_utc": "1636126181.0", "edited": "False", "id": "hjfccfu", "is_submitter": "False", "link_id": "t3_qn8h3t", "parent_id": "t3_qn8h3t", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "When the university I'm enrolled in comunicated its closure due to Covid. Until that moment I wasn't really worried, but then I realized the gravity of the situation", "created_utc": "1636110735.0", "edited": "False", "id": "hjeg9ge", "is_submitter": "False", "link_id": "t3_qmy1uz", "parent_id": "t3_qmy1uz", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Cringe", "created_utc": "1636021070.0", "edited": "False", "id": "hj9jdsm", "is_submitter": "False", "link_id": "t3_qmgoqe", "parent_id": "t3_qmgoqe", "score": "-9", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Social media, porn, smoking of all types\n\nEdit: I would sacrifice Reddit too", "created_utc": "1635958894.0", "edited": "False", "id": "hj651uq", "is_submitter": "False", "link_id": "t3_qlv8k2", "parent_id": "t3_qlv8k2", "score": "5", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Saw the picture but I think I'm missing some background. Could you break it down? I'm interested in knowing more", "created_utc": "1635956457.0", "edited": "False", "id": "hj5yj9x", "is_submitter": "True", "link_id": "t3_qlr0u1", "parent_id": "t1_hj5y7ar", "score": "3", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "Absence of critical thinking and evaluation of sourced of information", "created_utc": "1635956220.0", "edited": "False", "id": "hj5xwg8", "is_submitter": "False", "link_id": "t3_qlvebc", "parent_id": "t3_qlvebc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "https://youtu.be/YIiGn2CbQJU", "created_utc": "1635947635.0", "edited": "False", "id": "hj5c59r", "is_submitter": "True", "link_id": "t3_qlr0u1", "parent_id": "t1_hj53ypy", "score": "1", "subreddit": "Egypt", "subreddit_id": "t5_2ql2m"}, {"author": "Playful_Custard_537", "body": "Learning Arabic, Hebrew and Farsi and living some time in every middle eastern country teaching my native language", "created_utc": "1635882795.0", "edited": "False", "id": "hj1wkj6", "is_submitter": "False", "link_id": "t3_ql4d10", "parent_id": "t3_ql4d10", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Too many different factors to be able to say something precise. Beign conservative I would say at least B1. B2, maybe C1, if you study well and not only at uni", "created_utc": "1635588718.0", "edited": "False", "id": "himkqxj", "is_submitter": "False", "link_id": "t3_qir7mm", "parent_id": "t3_qir7mm", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Well, I can not say that I can read Classical Arabic with ease but going to the uni helped me developing a method and an approach to the text and the language that help me dealing with Classical Arabic. I use dictionaries and grammars and I'm able to work thorough a text.\n\nFor MSA my degree (focused on Classical Arabic) is not the best and personally I benefitted the most from self-study with *Assimil Arabic with Ease* and the *Foreign Service Institute* three volumes. With Assimil I got exposure to a more \"colloquial\" version of MSA while with the FSI volumes I became able to read Arabic press and to understand more formal MSA.\n\nAs other said, with Classical Arabic and MSA it's a matter of years. Uni can help you at some degree but most of the time you will conduct self-study with your materials. At least this was my case", "created_utc": "1635587572.0", "edited": "False", "id": "himjcer", "is_submitter": "False", "link_id": "t3_qiujjc", "parent_id": "t3_qiujjc", "score": "6", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}, {"author": "Playful_Custard_537", "body": "Fantasy is a pretty European genre with a medieval and European background. I think that outside the Western world it is difficult to find any work with some resemblance to Tolkien or Lewis", "created_utc": "1635510002.0", "edited": "False", "id": "hii53h8", "is_submitter": "False", "link_id": "t3_qhwh2o", "parent_id": "t3_qhwh2o", "score": "1", "subreddit": "iran", "subreddit_id": "t5_2qhzq"}, {"author": "Playful_Custard_537", "body": "Field: Medieval Islamic History\n\nLanguage of primary sources (only Middle East):\n\nClassical Arabic: You must know it. It grants you access to sources from the 7th to the 19th century, for contemporary studies on Islam you have to know Modern Standard Arabic but usually both the variants are studied at uni so it is not really a problem. Classical Persian (10th-18th centuries): optional but if you study Islam also from the 10th century on you will feel the need to access the sources in Persian because from this point in history the production of knowledge in the Islamicate world becomes highly persianised. Ottoman Turkish: only if you are interested in later periods of Islamic history and specifically Turkish history. In this case you must know both Classical Arabic and Classical Persian.\n\nOther useful languages but not required are dialects of Aramaic or Greek that grant you access to Christian sources. But usually you can find translation in European languages made by specialists of those languages.\n\nLanguage of secondary sources:\n\nArabic, English, French and German. English is just a must. French and German are also really useful languages in this field and for some specific topics you have to know them. If you study Ottoman history you have to know also Modern Turkish because there is a big production of knowledge in Turkish in this field.", "created_utc": "1635499939.0", "edited": "False", "id": "hihqtzu", "is_submitter": "False", "link_id": "t3_qho6wz", "parent_id": "t3_qho6wz", "score": "7", "subreddit": "AskHistorians", "subreddit_id": "t5_2ssp3"}, {"author": "Playful_Custard_537", "body": "In the general picture a language is not only its grammar rules. It is also the culture expressed with it and it express the understanding of the world of its speakers. Also, in order to learn a language you have to understand and in part embrace the culture. So in many ways learning languages of others develops empathy and you need empathy if you want to learn in a deep way a language.\n\nWhere I study I know many friends from many different countries that are using my language (Italian) while studying other subjects (Spanish, Hebrew, Arabic, History and so on) and they are from China, Arabic countries, Central Asia etc. And all of them struggle but constantly go forward despite the difficulties. I myself I would just die of panic attacks in their situation and probably many of them suffer at least a bit of anxiety because of this situation. So I always lend my hand to them whenever they need some help", "created_utc": "1635498190.0", "edited": "False", "id": "hihov3v", "is_submitter": "False", "link_id": "t3_qi40vw", "parent_id": "t3_qi40vw", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Medieval 2 Total War", "created_utc": "1635439943.0", "edited": "False", "id": "hiegffz", "is_submitter": "False", "link_id": "t3_qhqymn", "parent_id": "t3_qhqymn", "score": "0", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Mosquitoes. They would just impale you I think", "created_utc": "1635318837.0", "edited": "False", "id": "hi7xm7a", "is_submitter": "False", "link_id": "t3_qgqqki", "parent_id": "t3_qgqqki", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "As humans we create religions. Every religion claim to be the right one in some way or another. In history humankind created hundreds of religious that now are forgotten. Why, should the faiths of our times be different? And is not a litte much fortunate that we are living just when religion x who claim to be the truly one exist and we have the opportunity to follow it?\n\nI do not know if it makes sense but in other words I'm not against religion per se, but I'm skeptical about the claim \"my religion is the right one and the others are not\". This when we have millennia in which faiths developed and disappeared or changed radically overtime.    \n\nAnd also, I think that humankind is too limited to understand God or everything it does. This maybe is a contradiction with the first part, but this is why I'm an agnostic and not an atheist", "created_utc": "1635318150.0", "edited": "1635318378.0", "id": "hi7ws8a", "is_submitter": "False", "link_id": "t3_qgdff5", "parent_id": "t3_qgdff5", "score": "1", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "Playful_Custard_537", "body": "Fascists", "created_utc": "1635268828.0", "edited": "False", "id": "hi4z6qg", "is_submitter": "False", "link_id": "t3_qgb3es", "parent_id": "t3_qgb3es", "score": "11", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Could you elaborate on why a social person but with few friends is a red flag? What consequences could there be?", "created_utc": "1635268307.0", "edited": "False", "id": "hi4xv2d", "is_submitter": "False", "link_id": "t3_qg57gk", "parent_id": "t1_hi4usjy", "score": "2", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "Playful_Custard_537", "body": "Can you elaborate?", "created_utc": "1635266954.0", "edited": "False", "id": "hi4ueju", "is_submitter": "False", "link_id": "t3_qg57gk", "parent_id": "t1_hi4slka", "score": "6", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "Playful_Custard_537", "body": "Possibly of old age and not alone; leaving behind a big family", "created_utc": "1633933121.0", "edited": "False", "id": "hg77nwl", "is_submitter": "False", "link_id": "t3_q5gcv7", "parent_id": "t3_q5gcv7", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "12 hours in a day of study to me seems a little unrealistic and unreasonable.\nBut, anyway, it depends from your starting language and your target language.\nLanguages are gruped in linguistics families. A linguistic family is characterized by a set of shared linguistic features.\nIn practice, if your first language is English you'll have a relatively easy time in learning Germanic languages and Romance languages. This because for many linguistic and sociolinguistic aspect they share a lot of elements.\nIf you want to learn Japanese you'll have literally nothing in common and you'll need much more time of study in oder to reach a solid level.\nIn other words, 12h per day for 2 months in a Germanic or Romance lamguage would mean probably a lot of progress. But a language of a different family like a Semitic language (Hebrew, Arabic) or Chinese, Japanese and so on, it would be a good start", "created_utc": "1633866193.0", "edited": "False", "id": "hg3decx", "is_submitter": "False", "link_id": "t3_q4zkc9", "parent_id": "t3_q4zkc9", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Loneliness. Meh", "created_utc": "1633811187.0", "edited": "False", "id": "hg0sopn", "is_submitter": "False", "link_id": "t3_q4l86a", "parent_id": "t3_q4l86a", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Virginity does not exist. It's a toxic cultural construct", "created_utc": "1633681170.0", "edited": "False", "id": "hftyd0w", "is_submitter": "False", "link_id": "t3_q3biwo", "parent_id": "t3_q3biwo", "score": "1", "subreddit": "ask", "subreddit_id": "t5_2qhlj"}, {"author": "Playful_Custard_537", "body": "Well, I'm learning Modern Standard Arabic (B2), Contemporary Farsi of Iran (A2) and Modern Hebrew (A1) because I find extremely interesting all of the Middle East. Maybe one day I will also add Turkish. To be able to speak other languages and to understand the ways of living of others are things that are worth the effort. To be limited only to the understanding of my culture and first language would mean to live a less meaningful life in my opinion.", "created_utc": "1633593492.0", "edited": "False", "id": "hfpef0b", "is_submitter": "False", "link_id": "t3_q2h92u", "parent_id": "t3_q2h92u", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Personally I use the Spaced Repetition System (SRS) where an algorythm establish when you need to revise a new word. You can find more detailed guides on this by the way.\n\nSpecifically I use a program called Anki where I can create my flashcards. I learn 10 new words everyday and I am able to keep the pace with the classes in time for final exams\n\nedit: try to learn words in context, not isolated. It will make your learning more easier and you will be able to study more words", "created_utc": "1633437563.0", "edited": "False", "id": "hfh0cqa", "is_submitter": "False", "link_id": "t3_q1s5lx", "parent_id": "t3_q1s5lx", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Playful_Custard_537", "body": "Dune (2020) by Denis Villeneuve", "created_utc": "1632844967.0", "edited": "False", "id": "hely83q", "is_submitter": "False", "link_id": "t3_px4ol1", "parent_id": "t3_px4ol1", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Sono stato abbonato a periodi alterni a Jacobin e a Limes. Al momento niente perché non avrei molto tempo per starci dietro", "created_utc": "1632510831.0", "edited": "False", "id": "he4km0q", "is_submitter": "False", "link_id": "t3_puozeq", "parent_id": "t3_puozeq", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "Capitalism and patriarchy", "created_utc": "1632508302.0", "edited": "False", "id": "he4elxg", "is_submitter": "False", "link_id": "t3_puitc6", "parent_id": "t3_puitc6", "score": "-15", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Playful_Custard_537", "body": "Mmm. Parlerei lingue utili come il klingon immagino. Bè ripiegherei sull'insegnamento dell'italiano a stranieri", "created_utc": "1632385058.0", "edited": "False", "id": "hdxwdfj", "is_submitter": "False", "link_id": "t3_ptqiyp", "parent_id": "t3_ptqiyp", "score": "2", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "1. The word\n\nThe word caliph in Arabic is *khalifa* pl. *khulafaa'.*\n\nThe term is firstly attested in the Qur'an in two *ayat* of two *suras*: 2:30 and 38:26. There the word *khalifa* is referred to the prophet Adam (2:30) e to the Israeli king David (38:26). The word means a person entitled to represent the will of God on earth, from which the notion of *khalifat Allah*, the representative of God on earth (only for prophets). \n\n2. The history\n\nHistorically, Muhammad (PBUH) never referred to himself as a caliph but always as a messenger, *rasul*, of God. \n\nWhen Muhammad passed away in 632 AD the Umma had to choose a new leader and which duties this leader was supposed to fulfil. Representative of the people of Medina (*ansar*), of the first muslims of Mecca (*muhajirun*) and the aristocracy of Mecca formed an assembly, *shura*, and elected Abu Bark as first caliph with unanimity, *ijma*'. This caliph was not a *khalifat Allah* but a *khalifat rasul Allah*, a successor of the messenger of God. \n\nThis was a model of *khilafa* (caliphate) inspired to umility, modesty and religious piety that lasted until the *khilafa* of Ali b. Abi Talib. The *khilafa* was supposed to be different from the model of the *mulk*, the leadership of a normal king, *malik,* as the Persians, the Romans or the Arab Ghassanids and the Lakhmids were. Duties of the caliph were to defend the faith, control the correct application of the shari'a and to rule politically the Umma. The caliph was to be chosen by the assembly, *shura*, of the most prominent figures of the Umma, so it was elective.\n\nWith the Umayyads (r. 660-750) and the Abbasids (r. 750-1258) the institution of the *khilafa* became more similar to a *mulk* and the caliphate, from a *khalifat rasul Allah* became a *khalifat Allah*. The elective form was transformed in a dynastic form since the caliphate of Mu'awiya who designed his son Yazid as heir. \n\nCaliphs like al-Ma'mun (r. 813-833) took this so far that they became indistinguishable from kings, *muluuk* in the way the royal court and the ruler behaved. This was true also for other dynasties like the Umayyads in al-Andalus, the Fatimids in Egypt or the Ottomans in Turkey. \n\nImportant Sunni scholars like al-Ghazali (d. 1111) and Ibn Taymiyya (d. 1328) defended for practical reasons the *khilafa-mulk* model in their works even if the right one was the *khilafa* of the rightly guides one's (Abu Bakr, Umar, Uthman and Ali) and particularly in al-Ghazali we can see which characteristics the caliph must have to be a legitimate one:\n\n1. From the Quraysh\n2. Competent and capable\n3. Knowledgeable\n4. Without physical deficiencies\n\nThe institution of the khilafa historically, after the fall of the Fatimids, then of the Umayyads in al-Andalus and of the Abbasids war reclaimed by the Ottomans and lasted until the fall of the Ottoman empire in the WW1 and the political reforms of Mustafa Kemal Ataturk in Turkey.\n\nThe lastest attempt to recreate the *khilafa* was implemented by ISIS in a barbaric way. It was almost laughable if it was not for the bloodshed and fortunately it was a failure from the beginning.\n\nToday the caliphate does not exist and is not reclaimed in a credible way by anyone.", "created_utc": "1629470400.0", "edited": "False", "id": "h9o11a6", "is_submitter": "False", "link_id": "t3_p81i92", "parent_id": "t3_p81i92", "score": "1", "subreddit": "islam", "subreddit_id": "t5_2qhbp"}, {"author": "Playful_Custard_537", "body": "I Talebani sono un gruppo politico come un altro. Non è che perché son jihadisti non sappiano fare politica o capire la convenienza di un'azione rispetto ad un'altra. Trattenere gli stranieri non ha semplicemente senso pratico ed equivarrebbe solo a darsi la zappa sui piedi", "created_utc": "1629110905.0", "edited": "False", "id": "h953ydg", "is_submitter": "False", "link_id": "t3_p4pkze", "parent_id": "t1_h90d846", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "*\"Diversamente dal diritto sciita, per i sunniti le persone dei non-musulmani sono pure: solo è interdetto loro di entrare nel territorio sacro (haram) della Mecca. In territorio sunnita è in genere loro permesso visitare le moschee, fuori dell'ora del culto pubblico\"* (Bausani. 2018. *L'Islam. Una religione, un'etica, una prassi politica*. Milano: Garzanti).\n\nPoi a titolo personale confermo che puoi entrare senza problemi nelle moschee e non c'è alcun bisogno di sapere la sura al-Fatiha a memoria (?!).", "created_utc": "1629110559.0", "edited": "False", "id": "h953hve", "is_submitter": "False", "link_id": "t3_p4pkze", "parent_id": "t1_h94manh", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "L'autore della saga, Frank Herbert, creando il popolo dei Fremen si ispirò allo stile di vita dei beduini arabi prendendo elementi culturali pre-islamici e islamici. Anche a livello di terminologia la lingua araba è molto presente. E il pianeta stesso Arrakis dove vivono i Fremen è desertico e ispirato ai territori dell'Arabia.\n\nIl fatto è che Dune venne scritto ben prima di tutto ciò (anni '60) che è successo dagli anni '90 in poi (Talebani che salgono al potere, Twin Towers, invasione dell'Afghanistan, guerre del golfo, Daesh, attacchi terroristici ecc.), e il film uscirà avendo alle spalle invece tutti gli eventi avvenuti dal 2000 in poi. Quindi c'è un grande scarto in termini di sensibilità rispetto a nozioni come il jihad e il ricorso ai concetti propri della religione islamica come il Mahdi. Immagino si siano accorti di essere in un campo minato quando hanno deciso di girare il film e può essere che abbiano rimosso buona parte di tutto ciò che poteva risultare 'problematico'.\n\nTi lascio un link ad un articolo approfondito a riguardo:\n\nhttps://baheyeldin.com/literature/arabic-and-islamic-themes-in-frank-herberts-dune.html", "created_utc": "1629109615.0", "edited": "False", "id": "h9529oq", "is_submitter": "False", "link_id": "t3_p4pkze", "parent_id": "t1_h90hapc", "score": "1", "subreddit": "italy", "subreddit_id": "t5_2qkhk"}, {"author": "Playful_Custard_537", "body": "edit 1: I'm referring only to Sunni Islam\n\nUsually the short answer is: no, there is not a hierarchy of leadership. But in reality the topic is more nuanced.\n\nThe first authorities in religious knowledge were the Companions, the *Sahaba*, of the Prophet. After them authoritative people were literate men and scholars.\n\nThen, starting from the X-XI centuries new institutions developed in a much greater way, the *madrasa* pl. *madaris*. In these institutions scholars studied Islamic sciences and law. The *madaris* were not linked to a central authority like a christian catholic pope but were more similar to orthodox patriarchies where the single patriarchy is pretty much independent and autonomous.\n\nThe oldest madaris are:\n\nJami3at al-Kairouwan (f. 670);\n\nJami3at al-Zaytuna (f. 737) and heir to the Kairouwan one;\n\nJami3at al-Qarawiyyin (f. 859), founded by scholars from Kairouwan;\n\nJami3at al-Azhar (f. 959), still active and probably the most prestigious in the whole Sunni Muslim world. The actual rector, *shaykh*, is Muhammad Ahmad al-Tayyib.\n\nIn these institutions still active today you can get a degree in different Islamic sciences and these degrees are recognised internationally. The scholar also obtain a degree that open the option to became *imam* pl. *a'imma* and to supervise a mosque, *masjid*. So from a certain point of view, yes, you have a clergy in Islam. This because only those who obtained a degree after years of studies can teach Islamic sciences and lead a *masjid*. And if you pay attention every scholar has a specific dress code based on the rules of his *jami3at* and every type of dress indicates his hierarchical role in that institution.\n\nSource:\n\nBombardieri, Maria, Maria Chiara Giorda and Sara Hejazi. 2019. *Capire l'Islam. Mito o realtà?* Brescia: Scholé. From page 63 to 66.", "created_utc": "1628443817.0", "edited": "1628444215.0", "id": "h86uvr0", "is_submitter": "False", "link_id": "t3_p0frbz", "parent_id": "t3_p0frbz", "score": "1", "subreddit": "islam", "subreddit_id": "t5_2qhbp"}, {"author": "Playful_Custard_537", "body": "*Burtuqaal* is what's called an *ism al-jins al-jam3iyy*. It indicates a colletcive noun. In this case you have a noun indicating oranges in a general and indefinite way. \n\n*Burtuqala* is an *ism al-wahda*. You add a *ta marbuta* to an *ism al-jins al-jam3iyy* and you obtain a single specific orange.\n\nIf you want to talk about two specific oranges you'll say *burtuqaalat-ani* and if you want to talk about three or more specific oranges you will use the feminine plural *-aat*, so yuo'll say *burtuqaal-aat.*\n\nSo you have this development of the word:\n\nبرتقال\n\nبرتقالــــــة\n\nبرتقالتـــــــان / ــــــين\n\nبرتقالــــــات", "created_utc": "1628339695.0", "edited": "False", "id": "h81so34", "is_submitter": "False", "link_id": "t3_ozq88d", "parent_id": "t3_ozq88d", "score": "2", "subreddit": "learn_arabic", "subreddit_id": "t5_2v4vi"}]