[{"author": "Pleasant_Exchange568", "body": "Taz vez te resulte dificil crear oraciones complejas cuando hablas porque hasta ahora nunca has estudiado ni una sola regla gramatical. ¿por que decidiste no estudiar la gramatica? Hace que todo sea más facil.", "created_utc": "1660122887.0", "edited": "False", "id": "ijp38y5", "is_submitter": "False", "link_id": "t3_wkfu92", "parent_id": "t1_ijoods3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Pleasant_Exchange568", "body": "I also got a 7 (97%) and and an A on my spanish EE. These tips are **excellent**! For anyone doing spanish B HL, these will definlty help you. Such a great resource. I think something I would add is the importance of reading widely. Esspecially for the reading exam, I would suggest reading lots of books in spanish byound the set texts so that you can tackle text C on the reading test with confidence. You need quite a wide vocab to understand an unseen literary passage.", "created_utc": "1658107850.0", "edited": "False", "id": "igl88le", "is_submitter": "False", "link_id": "t3_w1ffrz", "parent_id": "t3_w1ffrz", "score": "2", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Hey,\n\nI have also used drops and it is an excellent app. Although for me after a bit of time it became a bit boring and limiting. I found reading an article in persian and then noting down new vocab in a quizlet and going over the list was easier and also more interesting. :) Also, I beleive the past tense is regular, and can be worked out using the infinitive while the present tense must be memorised.", "created_utc": "1657938009.0", "edited": "False", "id": "igcffvz", "is_submitter": "False", "link_id": "t3_w02zy7", "parent_id": "t3_w02zy7", "score": "4", "subreddit": "farsi", "subreddit_id": "t5_2t22i"}, {"author": "Pleasant_Exchange568", "body": "I mean, reading your paragraph I can tell your not a native straight away. \n\nFor example:\n\n'very different than the standard one' \n\n'just by the first sentence' \n\n'you can know'\n\n'a english speaking country'\n\nMost if not all native speakers will be able to tell if english is your 1st langauge or not. Just like native albanian speakers can tell when alabanian is a speakers first langauge or not. One is not more difficult than the other, lol.", "created_utc": "1657713226.0", "edited": "False", "id": "ifzayp6", "is_submitter": "False", "link_id": "t3_vxyhte", "parent_id": "t1_ifz3lxy", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Pleasant_Exchange568", "body": "Learning one language to fluency can take years and years, not to mention two langauges. I would just focus on the german and spanish if I were you.", "created_utc": "1656062045.0", "edited": "False", "id": "idjebzs", "is_submitter": "False", "link_id": "t3_vjk4fy", "parent_id": "t3_vjk4fy", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Pleasant_Exchange568", "body": "Surely it is about what you want to get out of a degree. If you are choosing a degree with the hopes of getting a job immediately and having a career path laid out, then no, I woudnlt recommend a language degree as you suggest. However, if you are going to university to simply expand your mind and become truely excellent at your target language within an academic setting, i.e, analysing cultural artefacts, such as films and newspapers, reading and analysing literature, understanding history, this can only be accomplished in my opinion with university study. I would also add that the difficulty of 'advanced' classes may vary between institution. That is to say, if you go to a Russell group uni in the UK or an Ivy league in the US the standards are going to be higher than other unis.", "created_utc": "1653362118.0", "edited": "False", "id": "i9rk6pn", "is_submitter": "False", "link_id": "t3_uwepwl", "parent_id": "t1_i9r2gkb", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Pleasant_Exchange568", "body": "I found that with enough exposure it becomes second nature. That’s not to say I didn’t learn the conjugations, but after time the rules become quite internalised and you can apply them to new verbs you encounter.", "created_utc": "1650763293.0", "edited": "False", "id": "i5y3um7", "is_submitter": "False", "link_id": "t3_uaeuoe", "parent_id": "t3_uaeuoe", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Pleasant_Exchange568", "body": "This", "created_utc": "1650704096.0", "edited": "False", "id": "i5uvuby", "is_submitter": "False", "link_id": "t3_ua0hyq", "parent_id": "t1_i5uv87e", "score": "1", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "HL is significantly different, in difficulty and what you do. Typically you read two works of literiaure which you discuss as part of the oral assessment at HL whereas a SL your only expected to describe a picture. Reading, writing and listening are all more difficult at HL, significantly so in comparison with SL.", "created_utc": "1648733827.0", "edited": "False", "id": "i2ugkad", "is_submitter": "False", "link_id": "t3_tsvcwc", "parent_id": "t1_i2tzt96", "score": "2", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "If you have an account with El País, you can actually switch regions/editions to see different types of news. I think they have editions in Mexico and the USA as well as the edition from spain.", "created_utc": "1647159329.0", "edited": "False", "id": "i0gygf0", "is_submitter": "False", "link_id": "t3_tcyt7x", "parent_id": "t3_tcyt7x", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Pleasant_Exchange568", "body": "Hey there, I wrote my EE in spanish B as well. I did an interview and included a transcript in the apendcies. Although I did my interview in spanish, i would advise translating yours into spanish. Hope this helps :)", "created_utc": "1646303792.0", "edited": "False", "id": "hz61kr6", "is_submitter": "False", "link_id": "t3_t5oh3d", "parent_id": "t3_t5oh3d", "score": "2", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Hola, me encantaría ayudarte con tu inglés. También tengo 18 años y llevo 4 años aprendiendo español. Por cierto, soy de Nueva Zelanda.", "created_utc": "1645431275.0", "edited": "False", "id": "hxt6gbz", "is_submitter": "False", "link_id": "t3_sxis5o", "parent_id": "t3_sxis5o", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Pleasant_Exchange568", "body": "If you are struggling at French B SL, French B HL is probably not for you. Any language B at higher level requires you to read a least two works of literature in the target language and then be able to analyse a random extract from one of these works as part of the oral assessment instead of a photo at Standard Level. Additionally, for the reading assessment you have to read more complex texts including an unknown piece of literature. The idea that French B HL is ‘pretty much the same as SL’ is completely untrue. I would definitely go with HL History as it seems that you enjoy that more, evidenced by your better marks. Hope this helps :)", "created_utc": "1645333895.0", "edited": "False", "id": "hxo4foh", "is_submitter": "False", "link_id": "t3_swm490", "parent_id": "t3_swm490", "score": "2", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Honestly this annoys me soo much. However, it is important to remember that many heritage speakers aren’t fluent per se. Many haven’t learned to write correctly, I.e with accent marks or haven’t read books before so have to accustom themselves to literary language. Many can literally just speak with their parents and that’s it. So being ‘fluent’ doesn’t mean you are bound for success in language B.", "created_utc": "1644099645.0", "edited": "False", "id": "hvqxox2", "is_submitter": "False", "link_id": "t3_slarcl", "parent_id": "t3_slarcl", "score": "10", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "100% agree", "created_utc": "1643078786.0", "edited": "False", "id": "hu3pqbo", "is_submitter": "False", "link_id": "t3_sbzeeu", "parent_id": "t1_hu3n902", "score": "2", "subreddit": "newzealand", "subreddit_id": "t5_2qhma"}, {"author": "Pleasant_Exchange568", "body": "I’m in total agreement. N20 had one entire year without disruptions where as N21 had a whole two years of coming in an out of online learning and lockdowns. The idea that it was supposedly easier is a completely unfair assessment to make. At my school in New Zealand we were in the highest lockdown level and were given an exception to sit our exams. Didn’t see our teachers face to face for months.", "created_utc": "1643078638.0", "edited": "False", "id": "hu3pdwh", "is_submitter": "False", "link_id": "t3_sbu4j5", "parent_id": "t1_hu3cj0l", "score": "3", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Yep, basic VPN to Spain is needed.", "created_utc": "1642814280.0", "edited": "False", "id": "htoiwj5", "is_submitter": "False", "link_id": "t3_s9ia1i", "parent_id": "t1_htodqh5", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Pleasant_Exchange568", "body": "You could try RTVE. It’s the national broadcasting corporation in Spain. All their shows have spanish subtitles so may be useful. Although you live in Mexico, RTVE is a good way to listen to different expressions and idioms from Spain. :)", "created_utc": "1642811425.0", "edited": "False", "id": "htobyz6", "is_submitter": "False", "link_id": "t3_s9ia1i", "parent_id": "t3_s9ia1i", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Pleasant_Exchange568", "body": "Are you doing HL or SL? They are quite different in language B. DM if you want to discuss :)", "created_utc": "1642416822.0", "edited": "False", "id": "ht0wxic", "is_submitter": "False", "link_id": "t3_s5yt52", "parent_id": "t3_s5yt52", "score": "1", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Mate, this is language B. Not A. OP please ignore these comments.", "created_utc": "1642416749.0", "edited": "False", "id": "ht0wu5y", "is_submitter": "False", "link_id": "t3_s5yt52", "parent_id": "t1_ht0tkms", "score": "3", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "This seems like an odd list. You would introduce the past subjunctive before the past and present perfect?", "created_utc": "1641788181.0", "edited": "False", "id": "hs0n88t", "is_submitter": "False", "link_id": "t3_s0528o", "parent_id": "t1_hrzodww", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Pleasant_Exchange568", "body": "One that’s not been mentioned is ‘being 17’. A French film", "created_utc": "1641104823.0", "edited": "False", "id": "hqwn41w", "is_submitter": "False", "link_id": "t3_rtye3e", "parent_id": "t3_rtye3e", "score": "5", "subreddit": "gaybros", "subreddit_id": "t5_2tdzg"}, {"author": "Pleasant_Exchange568", "body": "Second season of the orginal version of SKAM", "created_utc": "1641104709.0", "edited": "False", "id": "hqwmxka", "is_submitter": "False", "link_id": "t3_rtye3e", "parent_id": "t3_rtye3e", "score": "1", "subreddit": "gaybros", "subreddit_id": "t5_2tdzg"}, {"author": "Pleasant_Exchange568", "body": "One thing although its very small, when you say ‘the locals were amazed by hearing a foreign conversation”. I think ‘upon’ would work better in this case. I believe in spanish you would say ‘Al escuchar’ where al can be translated depending on the situation as either upon or by in English.", "created_utc": "1640936907.0", "edited": "False", "id": "hqnpcq0", "is_submitter": "False", "link_id": "t3_rs93vl", "parent_id": "t3_rs93vl", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Pleasant_Exchange568", "body": "Hey there, \nI did my EE in spanish B so could help you if you want. However, it appears your doing one which is based on literature whereas my approach was more cultural. DM me if you need any help though, as i understand the process and the criteria. :)", "created_utc": "1640765773.0", "edited": "False", "id": "hqdyxoi", "is_submitter": "False", "link_id": "t3_rqwmo4", "parent_id": "t3_rqwmo4", "score": "1", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "La casa de papel is a difficult show to learn new language, not only does it contain a bunch of slang, it also has accents from different parts of the Spain and the spanish speaking world making it difficult for beginners. You could watch dora the explorer as Dignified_llama says, or perhaps pepa pig becuase like in dora the explorer words are repeated over and over again and everything can be typically deduced from context. If you want something more entertaining perhaps watch something which has been dubbed into spanish from English. These shows, although difficult, are more simple and tend to use more generic idioms and structures which are no specific to one country (although many are translated using Mexican Spanish). Emily en parís could work as she doesn’t use overly sofisticated words or expressions. However, in saying this, to learn spanish you have to put in the hard graft. That means sitting down and going frame by frame through a film noting down words and expressions. The more you do this and learn, the more they will appear again and again and you wont need to note as many words down. I would also add one more thing. One of the best ways to learn a new language is through reading. Read a work in translation that you have already read in English. Books with a lot of dialogue work best which are simple but also enjoyable to read. Hope this helps :) Dm if you need any help, I did spanish B HL and my EE in spanish.", "created_utc": "1640649458.0", "edited": "False", "id": "hq7mlic", "is_submitter": "False", "link_id": "t3_rpqhfu", "parent_id": "t3_rpqhfu", "score": "1", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Hey there, \nI took spanish HL and did my EE in spanish as well. I would definitely recommend the language which you feel the strongest in as to score an A or B you must have a very firm grip on grammar and be able to read highly complex academic texts during your research. It will also mean that your writing will be more fluent and contain less errors.", "created_utc": "1640144010.0", "edited": "False", "id": "hpihjst", "is_submitter": "False", "link_id": "t3_rlo9cm", "parent_id": "t3_rlo9cm", "score": "3", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Looks a little like HIT (spanish) or Merlí (Catalan)", "created_utc": "1639719370.0", "edited": "False", "id": "hovsa99", "is_submitter": "False", "link_id": "t3_ri9prx", "parent_id": "t3_ri9prx", "score": "6", "subreddit": "skam", "subreddit_id": "t5_3ckh3"}, {"author": "Pleasant_Exchange568", "body": "Yep", "created_utc": "1638297342.0", "edited": "False", "id": "hmoz83k", "is_submitter": "False", "link_id": "t3_r5qle9", "parent_id": "t3_r5qle9", "score": "1", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Hi, I did my EE in spanish B. I would have a very close look at the EE guide and which category of EE you want to look at. Also, your topic is far too wide. Remember you have to explore the TARGET culture and language. Youth problems are way to generalistic. If you were to focus on the series skins, what issues are relevant to British teenagers, not all teenagers! Would you be exploring representations of certain issues? It is also advisable to have some core theory behind your EE, that is, big theoretical ideas which you can use to analyse the tv shows. I would also keep in mind that Skins is a bit dated, and probably doesn’t represent current ‘modern’ day concerns. You could pick as specific theme from it, such as the representation of homosexuality and compare it to a more modern British TV show for example and explore how representations have changed. Just an idea. Hope this help, is a difficult process but I’m sure you’ll get there :)", "created_utc": "1638251206.0", "edited": "False", "id": "hmmqafb", "is_submitter": "False", "link_id": "t3_r57352", "parent_id": "t3_r57352", "score": "3", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Anything that’s in the subject guide could be tested on the test. So you do need to learn the nature of science stuff.", "created_utc": "1638071317.0", "edited": "False", "id": "hmcxqys", "is_submitter": "False", "link_id": "t3_r3mbmp", "parent_id": "t3_r3mbmp", "score": "5", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Funny boy by Shyam Selvadurai", "created_utc": "1637565666.0", "edited": "False", "id": "hlm47si", "is_submitter": "False", "link_id": "t3_qzfkkv", "parent_id": "t3_qzfkkv", "score": "1", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "My question to you would be, why must you go to a ‘top’ university? Pressure from peers, the expectations of your family or your school? I am sure there a plenty of universities that would be keen to accept you. Perhaps the problem is that your not willing to accept a University that does not meet what you expect of yourself. I understand that it must be frustrating not achieving a 6, even after doing a retake in maths but you have to ask yourself why you didn’t achieve it. It seems you place far too much emphasis on doing well and have neglected your mental health. If I were you I would take a gap year and find something you really enjoy. Maybe its not even physics? I would also suggest a rethink about what your consider failure to be. Do you think of yourself as a faluire just becuase you didnt score a top score in a maths test? Sometimes it helps to look at our problems from a different perspective. I seems like you are an excellent student from what you have written. \nIt may also help if I told you that once you have completed an undergraduate degree, you can go on to do a masters or PHD at many other prestigious universities if you do well. My advice to you now would be to look after yourself, make sure you are happy and think deeply about what you want from this next chapter of your life which is university.", "created_utc": "1637366689.0", "edited": "False", "id": "hlbpbu8", "is_submitter": "False", "link_id": "t3_qxsap2", "parent_id": "t3_qxsap2", "score": "4", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "I believe a 7 is comparable to a C1 level, while a 6 is comparable to a high B2.", "created_utc": "1637207852.0", "edited": "False", "id": "hl2v2hq", "is_submitter": "False", "link_id": "t3_qwgrxq", "parent_id": "t3_qwgrxq", "score": "3", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Lol, you from New Zealand?", "created_utc": "1636344772.0", "edited": "False", "id": "hjrl8qp", "is_submitter": "False", "link_id": "t3_qp40v3", "parent_id": "t3_qp40v3", "score": "11", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Agreed, it was about the probablity of the windmill being over  a certain height. Didn’t make any sense.", "created_utc": "1636005529.0", "edited": "False", "id": "hj91khx", "is_submitter": "False", "link_id": "t3_qlv8ts", "parent_id": "t1_hj90yd7", "score": "7", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Why was it so difficult, what the hell!", "created_utc": "1635975438.0", "edited": "False", "id": "hj7c73y", "is_submitter": "False", "link_id": "t3_qm0sba", "parent_id": "t3_qm0sba", "score": "3", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Language B HL for nonnative/heritage speaker", "created_utc": "1634867262.0", "edited": "False", "id": "hhkgizo", "is_submitter": "False", "link_id": "t3_qcu2nt", "parent_id": "t3_qcu2nt", "score": "3", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "Personalmente, creo que es importante que aceptemos y respetamos las identidades de lo demás. Si queremos vivir en una sociedad igual y justa la dignidad es esencial. Si alguien quiere que uses los pronombres con un ‘e’, deberíamos intentar respectar su petición.", "created_utc": "1634634011.0", "edited": "False", "id": "hh7ne5l", "is_submitter": "False", "link_id": "t3_qb1rv9", "parent_id": "t3_qb1rv9", "score": "1", "subreddit": "espanol", "subreddit_id": "t5_2qhg6"}, {"author": "Pleasant_Exchange568", "body": "Estoy de acuerdo, básicamente tienes que escuchar las palabras todo el tiempo y poco a poco vas mejorando.", "created_utc": "1634331179.0", "edited": "False", "id": "hgs9v4s", "is_submitter": "False", "link_id": "t3_q8vjho", "parent_id": "t1_hgs7ul6", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Pleasant_Exchange568", "body": "Hi there, I’m doing the IB,  but I know pinehurst school who does Cambridge in Auckland applied for an exemption and can sit exams under level 3.", "created_utc": "1634008190.0", "edited": "False", "id": "hgb76cb", "is_submitter": "False", "link_id": "t3_q6c64n", "parent_id": "t3_q6c64n", "score": "3", "subreddit": "auckland", "subreddit_id": "t5_2rd5j"}, {"author": "Pleasant_Exchange568", "body": "Watching pepper pig in Spanish helped me, jajaja.", "created_utc": "1633489280.0", "edited": "False", "id": "hfk6zxk", "is_submitter": "False", "link_id": "t3_q28nmc", "parent_id": "t1_hfjlpv8", "score": "14", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Pleasant_Exchange568", "body": "Yes, but if they are speaking at the speed of a caracol thats no good either.", "created_utc": "1632968641.0", "edited": "False", "id": "hesx8ip", "is_submitter": "False", "link_id": "t3_pxyzwh", "parent_id": "t3_pxyzwh", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Pleasant_Exchange568", "body": "I am learning spanish, so didnt even bother with English or Swedish. You do you.", "created_utc": "1632423808.0", "edited": "False", "id": "hdzyff3", "is_submitter": "False", "link_id": "t3_ptyacx", "parent_id": "t3_ptyacx", "score": "9", "subreddit": "YoungRoyals", "subreddit_id": "t5_4g36f6"}, {"author": "Pleasant_Exchange568", "body": "Becuase the passive form is more commonly used to express how to say something in spanish. The translation is correct.", "created_utc": "1632255850.0", "edited": "False", "id": "hdrfcec", "is_submitter": "False", "link_id": "t3_psozms", "parent_id": "t3_psozms", "score": "-4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "Pleasant_Exchange568", "body": "To me ‘are you not’ sounds far more formal, something which is used in historical dramas quite often.", "created_utc": "1630746719.0", "edited": "False", "id": "hbjtdn6", "is_submitter": "False", "link_id": "t3_phmksy", "parent_id": "t3_phmksy", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Pleasant_Exchange568", "body": "Hola, me encantaría practicar mi español contigo y puedo ayudarte con inglés por supuesto. Acabamos de entrar otra vez en cuarentena  aquí en Nueva Zelanda por lo que tengo un montón de tiempo libre. Enviame un mensaje si quieres charlar :)", "created_utc": "1630300074.0", "edited": "False", "id": "haw7rx0", "is_submitter": "False", "link_id": "t3_pe8md1", "parent_id": "t3_pe8md1", "score": "2", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Pleasant_Exchange568", "body": "You may like ‘Quand on a 17 ans’ or being 17 in english. It’s French and its got a similar vibe to Jongens.", "created_utc": "1629949033.0", "edited": "False", "id": "hadre0g", "is_submitter": "False", "link_id": "t3_pb3b81", "parent_id": "t3_pb3b81", "score": "1", "subreddit": "YoungRoyals", "subreddit_id": "t5_4g36f6"}, {"author": "Pleasant_Exchange568", "body": "That’s not necessarily true. I am a non-native speaker doing spanish HL. The difference between Higher level and Standard level is certainly greater. If you are achieving 7s at HL you are around C1, where as 7’s at SL are around high B2.", "created_utc": "1628194900.0", "edited": "1628215298.0", "id": "h7unrc5", "is_submitter": "False", "link_id": "t3_oymn49", "parent_id": "t1_h7tzxe6", "score": "2", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}, {"author": "Pleasant_Exchange568", "body": "This is very good advice. I agree that we should pin this post on the forum.", "created_utc": "1626833790.0", "edited": "False", "id": "h5yaws3", "is_submitter": "False", "link_id": "t3_oode5c", "parent_id": "t3_oode5c", "score": "7", "subreddit": "YoungRoyals", "subreddit_id": "t5_4g36f6"}, {"author": "Pleasant_Exchange568", "body": "Hola,\n\nPuedo ayudarte. Soy de Nueva Zelanda y hablo inglés. Quieres charlar por Skype?\n\nSaludos,  \nRohan", "created_utc": "1625874675.0", "edited": "False", "id": "h4ncwaa", "is_submitter": "False", "link_id": "t3_ofzwzz", "parent_id": "t3_ofzwzz", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Pleasant_Exchange568", "body": "muy parecida \n\nhablaba \n\na mi tía \n\nme lo dijo", "created_utc": "1625609783.0", "edited": "False", "id": "h4adxb1", "is_submitter": "False", "link_id": "t3_of4jgr", "parent_id": "t3_of4jgr", "score": "1", "subreddit": "WriteStreakES", "subreddit_id": "t5_2eamt5"}, {"author": "Pleasant_Exchange568", "body": "Interesting I watched the series in Spanish and didn't even pick up on this, lol.", "created_utc": "1625602325.0", "edited": "False", "id": "h49xr8i", "is_submitter": "False", "link_id": "t3_oeos96", "parent_id": "t3_oeos96", "score": "2", "subreddit": "YoungRoyals", "subreddit_id": "t5_4g36f6"}, {"author": "Pleasant_Exchange568", "body": "Había aprendido \nSeguía", "created_utc": "1625599691.0", "edited": "False", "id": "h49rrtk", "is_submitter": "False", "link_id": "t3_oex81y", "parent_id": "t3_oex81y", "score": "1", "subreddit": "WriteStreakES", "subreddit_id": "t5_2eamt5"}, {"author": "Pleasant_Exchange568", "body": "Hola, I was watching it in Spanish and I thought it was quite realistic.", "created_utc": "1625440494.0", "edited": "False", "id": "h42ocgs", "is_submitter": "False", "link_id": "t3_oc0xxq", "parent_id": "t1_h41x6ee", "score": "10", "subreddit": "YoungRoyals", "subreddit_id": "t5_4g36f6"}, {"author": "Pleasant_Exchange568", "body": "Hola, envíame un mensaje. Me gustaría hablar contigo. Soy de Nueva Zelanda. :)", "created_utc": "1624579652.0", "edited": "False", "id": "h2xtqew", "is_submitter": "False", "link_id": "t3_o552qs", "parent_id": "t3_o552qs", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Pleasant_Exchange568", "body": "Hola, \n\n¿Qué tal? Me gustaría hablar contigo. llevo 3-4 años aprendiendo español y soy un angloparlante nativo de Nueva Zelanda. ¿Quieres hablar? Enviame un mensaje. :)", "created_utc": "1624579502.0", "edited": "False", "id": "h2xtgih", "is_submitter": "False", "link_id": "t3_o7biws", "parent_id": "t3_o7biws", "score": "1", "subreddit": "language_exchange", "subreddit_id": "t5_2tdbm"}, {"author": "Pleasant_Exchange568", "body": "What is her knowledge of grammar rules? Does she know when to use the subjunctive, or the difference between the two past tenses or how the passive tense is constructed. Films are great and so is translating books but these must be done in tandem with grammar so that your friend can see how the language works and functions. You could buy a grammar book and continue to do all the other things that you are already doing. Hope this helps :)", "created_utc": "1623719006.0", "edited": "False", "id": "h1spp3m", "is_submitter": "False", "link_id": "t3_nzzlar", "parent_id": "t3_nzzlar", "score": "4", "subreddit": "TranslationStudies", "subreddit_id": "t5_2uk7r"}, {"author": "Pleasant_Exchange568", "body": "Yes this would be very useful!", "created_utc": "1622430388.0", "edited": "False", "id": "h01ksva", "is_submitter": "False", "link_id": "t3_noidw4", "parent_id": "t3_noidw4", "score": "2", "subreddit": "IBO", "subreddit_id": "t5_2s05l"}]