[{"author": "Prestigious_Carob745", "body": "Not sure why, but this hit me hard. Poor everyone.", "created_utc": "1666622181.0", "edited": "False", "id": "itldi76", "is_submitter": "False", "link_id": "t3_ycc4dz", "parent_id": "t3_ycc4dz", "score": "210", "subreddit": "dataisbeautiful", "subreddit_id": "t5_2tk95"}, {"author": "Prestigious_Carob745", "body": "Totally agree. What is frustrating to me is the hilariously hypocritical way people evaluate cop behavior. Cops can often feel like they are representing the greater good and make snap judgements because the ends justify the means in “fighting bad guys.” People criticizing them—unironically—then respond by villifying any participant in the justice system as corrupt. They, too, want to “fight the bad guys.” People are generally assholes, especially when they think they have the moral high ground.", "created_utc": "1666201409.0", "edited": "False", "id": "isyo9g2", "is_submitter": "False", "link_id": "t3_y6tfiw", "parent_id": "t1_isy92le", "score": "1", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "MANY bad guys working for or aligned with The Bad Guy who have their own character arc. I want The Forsaken in all my epic fantasy.", "created_utc": "1666139586.0", "edited": "False", "id": "isvjs0v", "is_submitter": "False", "link_id": "t3_y7f4kz", "parent_id": "t3_y7f4kz", "score": "7", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Prestigious_Carob745", "body": "I think you’re making some assumptions. There was hardly this kind of issue a year ago, which was A YEAR after shut down. The law has changed a lot even in the past year, especially in terms of bond. Sentences aren’t what they used to be, which is demoralizing for cops, I think. However, cops in Denver seem to be choosing to be petulant rather than reconsider the problematic way they look at crime and punishment. \n\nFrom a large perspective, I think it all stems from the paramilitary structure cops live in and support. Cops act A LOT like soldiers do. It’s easy to look the other way on a rape or a village slaughter when you’ve been conditioned to feel like everyone is the enemy. That’s not to say all cops do look the other way. Many do.", "created_utc": "1666122853.0", "edited": "False", "id": "isufna5", "is_submitter": "False", "link_id": "t3_y6tfiw", "parent_id": "t3_y6tfiw", "score": "19", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "Ok, weird recommendation, but you should really check out Meow the Infinite. It’s 2 volumes, it’s beautiful, it’s perfect for that age range, and my daughters love it (including one very near that age)", "created_utc": "1665779381.0", "edited": "False", "id": "isc1u65", "is_submitter": "False", "link_id": "t3_y40rjg", "parent_id": "t3_y40rjg", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "I’m a prosecuting attorney in Colorado. This is not legal advice\n\nFlyovers are legal. Police have been using aerial surveillance to find pot farmers for 6 decades legally. \n\nA drone hovering and watching for more than a flyover is different and is governed by different rules that will depend exactly on what the drone is doing and why. \n\nThere was a recent case, Tafoya, referenced elsewhere talking about pole cams. Again, the use will matter. A good rule of thumb is that a pole cam peeking INTO private property, even curtilage, needs a warrant if it will be there longer than a cop could reasonably sit there and watch.", "created_utc": "1665624123.0", "edited": "False", "id": "is3lax5", "is_submitter": "False", "link_id": "t3_y2iqrm", "parent_id": "t3_y2iqrm", "score": "95", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "Check out {{Warbreaker by Brandon Sanderson}}", "created_utc": "1665197423.0", "edited": "False", "id": "irh7dfz", "is_submitter": "False", "link_id": "t3_xycfjg", "parent_id": "t3_xycfjg", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "Boscassatok de mi folyik itt? Amerikai vagyok es nem figyelem meg a Magyar politikat", "created_utc": "1665017569.0", "edited": "False", "id": "ir83e49", "is_submitter": "False", "link_id": "t3_xwejit", "parent_id": "t3_xwejit", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Prestigious_Carob745", "body": "Ok, I get that this was charged. But dude is like 3 times her size and weight. Did he really have to knock her that hard? I mean, I wouldn’t be too surprised if something on that girls face broke. Self defense is supposed to be proportionate. \n\nDon’t get me wrong, that girl fucked around, and maybe I don’t fully understand the background on what’s going on.", "created_utc": "1664908784.0", "edited": "False", "id": "ir1thv8", "is_submitter": "False", "link_id": "t3_xun0yf", "parent_id": "t3_xun0yf", "score": "0", "subreddit": "JusticeNow", "subreddit_id": "t5_5nd8kq"}, {"author": "Prestigious_Carob745", "body": "The misinformation on this thread is nuts. \n\n1. Judges are appointed. After set periods of time, they are up for retainer, not election. If you vote “no” and the majority votes the same way, that judge loses their judgeship. Judges don’t run for their judgeship in this state. \n\n2. Judges can’t change the charges. They can only decide to accept a plea agreement or not. If the DA charged misdemeanors, the judge can’t just make it a felony. If the judge rejects a plea agreement, often this means blowing up a deal the parties may have worked out for very specific reasons. In many cases, a judge rejecting a plea agreement means the case will be forced to trial and there’s a legitimate risk of acquittal. In that case, the asshole rapist cop is found NOT GUILTY and KEEPS HIS JOB. Is 90 days jail and a conviction on a misdemeanor better than that, when we can now keep this predator off the police force?\n\n3. DAs charge what they can. I have never seen a DA handling a rape case cut the defendant a break just because they were a cop. It’s RAPE. I’m shocked people here just assume that the DA or judge thought “oh, it’s no big deal.”  I’m pretty confident the DA felt the same outrage y’all do. \n\n4. In cases where you see outcomes like this, it’s very likely related to weight of outcomes for both the victim and the community. Dollars to donuts the poor woman raped would not, could not, or should not testify in that rape trial. Knowing this, the DA likely had a similar choice to make as referenced above: should I force this case to trial and possibly cause and re-victimize this woman at the substantial risk this asshole is acquitted? Or do I offer misdemeanors so I get at least something? Id be interested in reading the transcript of the sentencing hearing for this case. The only other reasonable explanation is that he knew something else about the feds….\n\n5. The feds, by their own admission, cherry pick the cases they want to throw their resources into. Sometimes they actually help state cases. The feds do not fuck around. They have virtually unlimited resources and unlimited time. I have tried a lot of cases, including several in federal court, and they usually don’t lose. I haven’t read anything about the feds taking this case or not, so I don’t know what they may or may not have done.", "created_utc": "1664844252.0", "edited": "False", "id": "iqygr7n", "is_submitter": "False", "link_id": "t3_xump6x", "parent_id": "t3_xump6x", "score": "16", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "I think it’s melted butter but without the milk fat or solids. It’s the stuff that comes out for the first 2/3 of the pour when you pour melted butter out of a pan.", "created_utc": "1664754157.0", "edited": "False", "id": "iqti974", "is_submitter": "False", "link_id": "t3_xu1hj6", "parent_id": "t1_iqtgply", "score": "5", "subreddit": "NatureIsFuckingLit", "subreddit_id": "t5_3gdh7"}, {"author": "Prestigious_Carob745", "body": "If you read closely, it is implied the prosecutor likely charged him based on the strength of their case if it had to go to trial. It seems the victim is likely to have not testified. Id rather have him convicted of SOME sex crime rather than take the case to court and it gets dismissed. That asshole cop would still be on the force.", "created_utc": "1664753558.0", "edited": "False", "id": "iqtgvmy", "is_submitter": "False", "link_id": "t3_xtfsyt", "parent_id": "t1_iqsr3u2", "score": "5", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "I didn’t send anything. I’ve literally been at work all day without access to Reddit. I’m unsure what you’re talking about. \n\nIt sounds like you’ve reviewed a few thousand cases for this year alone and found police didn’t catch ANYBODY. That’s about the only possible way you could reasonably say you “did the work.” Cops literally catch criminals all day long. True, they almost never catch a criminal in the middle of a violent act, but that’s not what you claimed they never do. You implied that they prevent no crime. Which is a really silly thing to say, considering the thousands of criminals they have arrested for—and convicted of—crime this year alone.", "created_utc": "1664240762.0", "edited": "False", "id": "iq1pf8v", "is_submitter": "False", "link_id": "t3_xnbybx", "parent_id": "t1_iq0z5tu", "score": "1", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "Solid point.  Everyone who provides objective information that the cops don’t just murder babies and puppies all day must be absolute sycophants for cops.", "created_utc": "1664240286.0", "edited": "False", "id": "iq1oc9d", "is_submitter": "False", "link_id": "t3_xnbybx", "parent_id": "t1_iq0zflv", "score": "1", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "Are you suggesting the cops don’t actively catch criminals for their crimes? That’s a silly thing to imply. Which county was this in? Arapahoe, probably, right? Maybe you should look at how many active cases there are this year in Arapahoe. I think their felony case numbers are in the thousands, maybe tens of thousands. So there’s the link for you. Start with Arapahoe county case 22cr1. Many of those are open records, though you may have to go to the courthouse to view the affidavits.", "created_utc": "1664199142.0", "edited": "False", "id": "ipyvhpo", "is_submitter": "False", "link_id": "t3_xnbybx", "parent_id": "t1_ipx89k2", "score": "-1", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "It’s hilarious you conflate a conviction with the underlying truth. You also overlook the same thing for the cops. The cops haven’t been convicted of shooting anyone. Does that mean it didn’t happen? Tf outta here", "created_utc": "1664152612.0", "edited": "False", "id": "ipwu5fk", "is_submitter": "False", "link_id": "t3_xnbybx", "parent_id": "t1_ipwnw30", "score": "8", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "I think I managed it because I listened to it rather than read it. The audiobook plods on no matter what, so you cut through some of what you’re talking about.", "created_utc": "1663905018.0", "edited": "False", "id": "ipk4y2w", "is_submitter": "False", "link_id": "t3_xlk2ry", "parent_id": "t3_xlk2ry", "score": "0", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Prestigious_Carob745", "body": "Oh, so THATS why my dog plays tug o war.", "created_utc": "1663620970.0", "edited": "False", "id": "ip42o88", "is_submitter": "False", "link_id": "t3_xini6v", "parent_id": "t3_xini6v", "score": "1487", "subreddit": "natureismetal", "subreddit_id": "t5_324zi"}, {"author": "Prestigious_Carob745", "body": "Kocsonya. That’s about it. I eat almost everything.", "created_utc": "1663619299.0", "edited": "False", "id": "ip3ypa3", "is_submitter": "False", "link_id": "t3_xhw4gc", "parent_id": "t3_xhw4gc", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Prestigious_Carob745", "body": "Shooting up schools.", "created_utc": "1663542825.0", "edited": "False", "id": "iozsk8z", "is_submitter": "False", "link_id": "t3_xhkn0j", "parent_id": "t3_xhkn0j", "score": "1", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Prestigious_Carob745", "body": "I have tried Julia Childs recipes and they are generally unintuitive and outdated. The most I learned from her is more of the French palate. I feel like she’s a terrible book to learn from in 2022.", "created_utc": "1663114688.0", "edited": "False", "id": "iobw9ln", "is_submitter": "False", "link_id": "t3_xcxqgb", "parent_id": "t1_io9kcgh", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "Not quite a novella, but check out Nightfall by Isaac Asimov. I read it a long time ago, but it’s still got some space in this low rent tiny house I call a brain.", "created_utc": "1662851747.0", "edited": "False", "id": "inx2tdo", "is_submitter": "False", "link_id": "t3_xarjqw", "parent_id": "t3_xarjqw", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "Boo dee boo boo dee boop SEX", "created_utc": "1662346206.0", "edited": "False", "id": "in4ylb1", "is_submitter": "False", "link_id": "t3_x5wovs", "parent_id": "t1_in3x6q2", "score": "128", "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i"}, {"author": "Prestigious_Carob745", "body": "As a Mormon who has resolved some kind of peace with the religion (after significant crisis and some religious trauma), I could add a vote for a few:\n\nEducated by Westover is a good book, but it’s a bit difficult to relate to mainstream Mormonism. It’s more about mental illness than religion, though the religion is the vehicle mental illness uses to go to crazy and horrifying places. \n\nJoseph Smith: Rough Stone Rolling is an actually accurate view of the things she was taught as a kid, rather than the whitewashed or revisionist stuff given by the Mormon church. It’s by an apologist, so it’s not out to be bitter or preachy. \n\n A book by Mike McHague may be helpful. \n\nIf she wants something more secular, I have a weird recommendation: the Magicians by Lev Grossman. She needs to read the whole trilogy, though. Can’t just be the first book or she’ll hate it. It’s about a character who seems to frame his happiness a certain way, but by the end learns identity and satisfaction is more than just what life has for you.", "created_utc": "1662122740.0", "edited": "False", "id": "imsg66o", "is_submitter": "False", "link_id": "t3_x3do5l", "parent_id": "t1_imqf563", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "This kind of abuse of power is a true horror story. I’ve done D&N cases before and the suffering can’t be understated. To do that because you didn’t like what they said about your girlfriend? Every frivolous slight? This person needs to be absolutely skull fucked by the justice system.", "created_utc": "1661532559.0", "edited": "False", "id": "ilw2shg", "is_submitter": "False", "link_id": "t3_wxpk36", "parent_id": "t3_wxpk36", "score": "2", "subreddit": "Colorado", "subreddit_id": "t5_2qhkb"}, {"author": "Prestigious_Carob745", "body": "I put in on average an hour. I started Spanish a few weeks ago, so I have no idea how I’m progressing. \n\nI feel like what kind of hour you put in matters. Speaking with someone who is patient to go to your level is the only important thing to find. Everything else doesn’t matter as much.", "created_utc": "1661518296.0", "edited": "False", "id": "ilv3q7k", "is_submitter": "False", "link_id": "t3_wy2t51", "parent_id": "t3_wy2t51", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "I suppose you could be right if there is some pretty clear proof the judge just didn’t want to go to work today. But I’m pretty much every other situation, I have to disagree. You speak as if she’s done nothing to get herself into this situation. Everyone hates waiting at the DMV, too, but you wait in line like everybody else to make sure your license is valid or you create more problems for yourself. The governments inability to make compliance with the law convenient doesn’t mean it’s denying justice.", "created_utc": "1661361478.0", "edited": "False", "id": "ilma8gc", "is_submitter": "False", "link_id": "t3_wvvzjp", "parent_id": "t1_ilkhu4z", "score": "1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "Prestigious_Carob745", "body": "I am no poet, and my Hungarian is probably now less than a C1\n\nA hamvak közül feltámadva, újjáéledek", "created_utc": "1661305984.0", "edited": "False", "id": "iljfjn8", "is_submitter": "False", "link_id": "t3_ww5ejm", "parent_id": "t3_ww5ejm", "score": "13", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "If you want to understand this on some level, I recommend reading “The Body Keeps the Score” by Bessel Vanderkolk", "created_utc": "1661036115.0", "edited": "False", "id": "il4hqoh", "is_submitter": "False", "link_id": "t3_wt5qic", "parent_id": "t1_il28ydj", "score": "1", "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa"}, {"author": "Prestigious_Carob745", "body": "I’m a victim oh noes", "created_utc": "1660776444.0", "edited": "False", "id": "ikpz4bu", "is_submitter": "False", "link_id": "t3_wqj6it", "parent_id": "t3_wqj6it", "score": "1", "subreddit": "NatureIsFuckingLit", "subreddit_id": "t5_3gdh7"}, {"author": "Prestigious_Carob745", "body": "Itt az USA-ban az biztonsagi or aki meg baszta a rendorsegi lehetoseget vagy azonban failure. Elnezest a szornyu magyar irasert", "created_utc": "1660702659.0", "edited": "False", "id": "iklsb60", "is_submitter": "False", "link_id": "t3_wpprg7", "parent_id": "t1_ikj3dbd", "score": "2", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Prestigious_Carob745", "body": "This is homespun DIY amateur-ness, but I would get a tow strap and ratchet with padding and cinch it that way. It may not be enough pressure to do that much good, though.", "created_utc": "1660576835.0", "edited": "False", "id": "ike4yrs", "is_submitter": "False", "link_id": "t3_woydif", "parent_id": "t3_woydif", "score": "1", "subreddit": "woodworking", "subreddit_id": "t5_2qlqp"}, {"author": "Prestigious_Carob745", "body": "I don’t remember any lightning up here yesterday. It may have passed by a little south", "created_utc": "1660098130.0", "edited": "False", "id": "ijo08hm", "is_submitter": "False", "link_id": "t3_wjv56l", "parent_id": "t3_wjv56l", "score": "2", "subreddit": "Colorado", "subreddit_id": "t5_2qhkb"}, {"author": "Prestigious_Carob745", "body": "{{The Magicians by Lev Grossman}} continues to affect me deeply, but I’m not sure it’s totally changed my life or outlook. I identify with the character, as immature as he is. I think the whole series is about finding happiness. In the end, Quentin finds happiness by enthusiasm today instead of an ideal. It’s depressing but just a really good book (I consider the trilogy one book, I guess)", "created_utc": "1660016433.0", "edited": "False", "id": "ijjag6e", "is_submitter": "False", "link_id": "t3_wjn3e5", "parent_id": "t3_wjn3e5", "score": "1", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Prestigious_Carob745", "body": "u/SaveVideo", "created_utc": "1659588040.0", "edited": "False", "id": "iivkz8v", "is_submitter": "False", "link_id": "t3_wdmg1d", "parent_id": "t3_wdmg1d", "score": "1", "subreddit": "HighQualityGifs", "subreddit_id": "t5_2ylxz"}, {"author": "Prestigious_Carob745", "body": "Me too! There was a CRAZY amount of bureaucratic ambition that made ALMOST everyone just insanely two faced and cruel. Probably the most toxic office I’ve worked in.", "created_utc": "1659066567.0", "edited": "False", "id": "ii30imi", "is_submitter": "False", "link_id": "t3_tb7v0z", "parent_id": "t1_i06bgj3", "score": "1", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "Ok, this is embarrassing, but {{Ready Player One}}. It’s got a lot good going for it, but I recognize it is essentially Twilight for a certain age of man. It’s delightful and very low burden of entry, which is probably why it’s easy for me to reread.", "created_utc": "1659046327.0", "edited": "False", "id": "ii1sl7x", "is_submitter": "False", "link_id": "t3_waaa11", "parent_id": "t3_waaa11", "score": "16", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "Butters, my eyes are up here!!!", "created_utc": "1658870235.0", "edited": "False", "id": "ihrnieo", "is_submitter": "False", "link_id": "t3_w7w4i2", "parent_id": "t3_w7w4i2", "score": "1", "subreddit": "Unexpected", "subreddit_id": "t5_2w67q"}, {"author": "Prestigious_Carob745", "body": "It’s Ben’s fault and he’s sorry.", "created_utc": "1657987527.0", "edited": "False", "id": "igeppxz", "is_submitter": "False", "link_id": "t3_w099b1", "parent_id": "t3_w099b1", "score": "1", "subreddit": "dataisbeautiful", "subreddit_id": "t5_2tk95"}, {"author": "Prestigious_Carob745", "body": "There’s a trend going in my county lately where “there is a prescription medicine” from Mexico, a painkiller, that has meth as an active ingredient. Probation officer tracked it down. It does not.", "created_utc": "1657685888.0", "edited": "False", "id": "ify9dcv", "is_submitter": "False", "link_id": "t3_f5u5t0", "parent_id": "t3_f5u5t0", "score": "2", "subreddit": "Prosecutors", "subreddit_id": "t5_2woir"}, {"author": "Prestigious_Carob745", "body": "If you’re into fantasy, you could try the lightbringer series by Brent weeks. It’s long, but the main characters arc is essentially existential identity crisis and faith crisis and a resolution to it.", "created_utc": "1655584623.0", "edited": "False", "id": "icvcwks", "is_submitter": "False", "link_id": "t3_vfc8an", "parent_id": "t3_vfc8an", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "Hungarian isn’t valuable for you and will ultimately not really serve you. I say this as someone who lived in Hungary and was also a linguistics major. You would be better served going straight to Portuguese. You will learn interesting principles of morphology not from a specific language but by studying linguistics.", "created_utc": "1655581637.0", "edited": "False", "id": "icv6oem", "is_submitter": "False", "link_id": "t3_vf7f7x", "parent_id": "t3_vf7f7x", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "{{The Black Prism by Brent Weeks}} is the book series you’re looking for if you like fantasy. Lots of interesting twists!", "created_utc": "1654920811.0", "edited": "False", "id": "ibxu4no", "is_submitter": "False", "link_id": "t3_v9civi", "parent_id": "t3_v9civi", "score": "2", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "I’ve wanted to study Vietnamese but I hear native speakers are ruthlessly unforgiving and unhelpful with learners. Since it’s such a phonetically challenging language for English speakers (assuming you are one), have you found it accessible?", "created_utc": "1646512719.0", "edited": "False", "id": "hzhrusl", "is_submitter": "False", "link_id": "t3_t78s8t", "parent_id": "t1_hzg5k0m", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "Could be a weird contribution but you should look into an old tabletop I used to play called [In Nomine.](https://en.wikipedia.org/wiki/In_Nomine_(role-playing_game)). Some of the flavor text and introductory example plot lines to this day are imprinted in my brain.", "created_utc": "1644274602.0", "edited": "False", "id": "hw09qed", "is_submitter": "False", "link_id": "t3_smjbym", "parent_id": "t3_smjbym", "score": "2", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Prestigious_Carob745", "body": "I am a divorce attorney. I can virtually promise you that the diagnosis was just the perfect excuse for him to do what he didn’t have the balls to do otherwise. I know that’s little comfort. However, you should understand that begging will not help. You’ll eventually get past the grief of this and it will even out. I’m so sorry.", "created_utc": "1644208225.0", "edited": "False", "id": "hvwlc0r", "is_submitter": "False", "link_id": "t3_smc4af", "parent_id": "t3_smc4af", "score": "1", "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy"}, {"author": "Prestigious_Carob745", "body": "Amerikabam ezt is mondjuk 🤣", "created_utc": "1644205411.0", "edited": "False", "id": "hvwfo0v", "is_submitter": "False", "link_id": "t3_sluuku", "parent_id": "t3_sluuku", "score": "2", "subreddit": "FostTalicska", "subreddit_id": "t5_kiiam"}, {"author": "Prestigious_Carob745", "body": "I made a very similar comment in my TL country’s group just a few days ago. Someone commented that people are just so impressed someone is trying that they are proud and happy to hear it. When I point out it’s hard to progress when everyone says that and it’s hard to distinguish genuine praise from this common reaction to foreigners, they tend to loosen up a bit. Maybe you should just try to tell them that you need genuine help and you want them to be sincere. I suspect that may be less effective in Japanese culture, but it can’t really hurt either.", "created_utc": "1644204737.0", "edited": "False", "id": "hvwe8xx", "is_submitter": "False", "link_id": "t3_slyq22", "parent_id": "t3_slyq22", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "Check out Mortal Coils by Eric Nylund. Kind of a Harry Potter with gods. I don’t think he finished the series but I remember enjoying the first two.\n\n[Mortal Coils](https://www.goodreads.com/en/book/show/5178537-mortal-coils)\n\n\"Nothing interesting had ever happened\" to orphans Eliot and Fiona for 15 years with strict Grandmother and well-meaning great gran Cee. But unintended offspring of a goddess and Lucifer can break a long truce. Rather than kill the pair, Immortals create three Trials; Infernals add three Temptations. The pair must stick together; adult allegiances are uncertain.\n\nEdit: added link", "created_utc": "1644175195.0", "edited": "1644175434.0", "id": "hvui2aq", "is_submitter": "False", "link_id": "t3_slwlf8", "parent_id": "t3_slwlf8", "score": "1", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Prestigious_Carob745", "body": "Ti magyarok szoktatok ilyet mondani mikor kulfoldivel szemben alltok mert udvariasok vagytok. Meg mar nem tudom igaz-e. Nem Mondom nem vagytok sincere (bocs, nem emlekszem sincere magyarul), de kulfoldieknek nehez biztosan megtudni mikor udvariaskodtok vagy sincerekedtek. Ez igy is van mashol ha tanuljak a nativ nyelvet. 🤷‍♂️", "created_utc": "1643984262.0", "edited": "False", "id": "hvkaayr", "is_submitter": "False", "link_id": "t3_sjr5zn", "parent_id": "t1_hvjat2r", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Prestigious_Carob745", "body": "Nagyon szepen koszonom a sok sok valaszt erre a kerdesre mert Amerikai vagyok de laktam magyarorszagon annak idejen es neha borzasztoan nekem hianyzik a magyar gyakorlasat es a Magyar nep is. Tehat amikor hallok valamit magyarul en rogton megyek es valoszinuleg zavarom akarmelyik szerencsetlen Magyar turistat aki mer magyarul tomegben beszelni. Nekem jo tudnom milyen hatast nyomok ilyenekre. (Bocsanat kerek h durva magyar irasom)", "created_utc": "1643948349.0", "edited": "False", "id": "hvipqab", "is_submitter": "False", "link_id": "t3_sjr5zn", "parent_id": "t3_sjr5zn", "score": "10", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Prestigious_Carob745", "body": "This ain’t new. I’m the youngest of 6. Still funny though.", "created_utc": "1643946076.0", "edited": "False", "id": "hvikyeo", "is_submitter": "False", "link_id": "t3_sjqwg3", "parent_id": "t3_sjqwg3", "score": "-1", "subreddit": "funny", "subreddit_id": "t5_2qh33"}, {"author": "Prestigious_Carob745", "body": "Kuldd ezt a videot ha angolul beszel [John Oliver](https://youtu.be/XMGxxRRtmHc)", "created_utc": "1643722452.0", "edited": "False", "id": "hv4p9eb", "is_submitter": "False", "link_id": "t3_shghzc", "parent_id": "t3_shghzc", "score": "3", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Prestigious_Carob745", "body": "Mexico!?! Dude, you’re from a dumpster fire of corruption and murder and you want to get wrapped up in American identity politics in a language learning forum over who is worse?! Lmao", "created_utc": "1643515706.0", "edited": "False", "id": "hut6t2y", "is_submitter": "False", "link_id": "t3_sfr9o4", "parent_id": "t1_hut39z3", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "Where are you from? Should we judge you by whatever leaders your country has endured?", "created_utc": "1643513093.0", "edited": "False", "id": "hut19w6", "is_submitter": "False", "link_id": "t3_sfr9o4", "parent_id": "t1_husrkak", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "That’s not the impression I get at all from the post. Heaven forbid an American dreams of bettering himself/herself by asking a question about language options on a language learning forum!", "created_utc": "1643508198.0", "edited": "False", "id": "husql7o", "is_submitter": "False", "link_id": "t3_sfr9o4", "parent_id": "t1_hus4iki", "score": "32", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "Angol beszeloknek jol esnek magyar nyelvet hallani. Bisztos h igy is van a kutyaknak.", "created_utc": "1643428518.0", "edited": "False", "id": "huof3hu", "is_submitter": "False", "link_id": "t3_seued5", "parent_id": "t3_seued5", "score": "1", "subreddit": "hungary", "subreddit_id": "t5_2qzzt"}, {"author": "Prestigious_Carob745", "body": "Fallen Dragon by Peter f. Hamilton", "created_utc": "1642964555.0", "edited": "False", "id": "htwx2lc", "is_submitter": "False", "link_id": "t3_sagbum", "parent_id": "t3_sagbum", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "The Sims 4. As embarrassing as it is that I know that.", "created_utc": "1642963699.0", "edited": "False", "id": "htwuveo", "is_submitter": "False", "link_id": "t3_sareyr", "parent_id": "t3_sareyr", "score": "1", "subreddit": "gaming", "subreddit_id": "t5_2qh03"}, {"author": "Prestigious_Carob745", "body": "I can definitely attest to how much Hungarians want to speak English. I taught Anglo orak for years. For me the only thing that made me feel better was getting good enough at Hungarian that it took people awhile to notice I wasn’t Hungarian. At first it was really frustrating. Can’t say I blame people who want to speak a target language, though", "created_utc": "1642551105.0", "edited": "False", "id": "ht912c6", "is_submitter": "False", "link_id": "t3_s6q8xx", "parent_id": "t1_ht59gpo", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "Hungarian is unique and cool. I speak Hungarian at probably a B2, maybe a C1", "created_utc": "1640838252.0", "edited": "False", "id": "hqi8h39", "is_submitter": "False", "link_id": "t3_rrdi7b", "parent_id": "t3_rrdi7b", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "Prestigious_Carob745", "body": "TL;DR “Thanks for your reasoned and data driven response, but everyone should ignore it because of my anecdotal and subjective experiences that EVERYONE has had.”", "created_utc": "1639583140.0", "edited": "False", "id": "honm987", "is_submitter": "False", "link_id": "t3_rgjpnf", "parent_id": "t1_holv0y8", "score": "7", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "Here come all the weak minded conservatives, ready to swallow anything because they thrive exclusively on boogie men and straw men.", "created_utc": "1639582789.0", "edited": "False", "id": "honlclf", "is_submitter": "False", "link_id": "t3_rgjpnf", "parent_id": "t1_holubw1", "score": "1", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "Brauchler has been saying stupid stuff for years. Prosecutors across the county ousted by more liberal policy makers have been trying to cherry pick the same old conservative scare tactics and boogie men to get them back into office (see Virginia). They want you to believe it’s certain policies in place that are alone responsible for any change in crime rate. As if it’s the only variable. As if other major factors—like an unprecedented pandemic—has absolutely no effect on social norms. \n\nCrime is half of what is was in the 90s.", "created_utc": "1639582377.0", "edited": "False", "id": "honkba3", "is_submitter": "False", "link_id": "t3_rgjpnf", "parent_id": "t3_rgjpnf", "score": "2", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "Check out heroes die by Matthew stover. I read it a few years ago, but it was fascinating world building and I think the character count was less than what we see these days on average", "created_utc": "1638722747.0", "edited": "False", "id": "hnc9flo", "is_submitter": "False", "link_id": "t3_r990hw", "parent_id": "t3_r990hw", "score": "1", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Prestigious_Carob745", "body": "Where are you getting that? It seems you are looking at some federal sentencing argument. Do you really think a judge or da would have looked at the federal sentencing argument in a federal case from who knows when? And time spent in what prison has absolutely no statistical bearing on future risk. That's what CPAT and ODARA scoring is for. Many, many people going through the criminal justice system have been to prison before. It is NOT a predictor of future violence, much less murder, armchair captain hindsights notwithstanding.", "created_utc": "1637911601.0", "edited": "False", "id": "hm4qgzk", "is_submitter": "False", "link_id": "t3_r250h3", "parent_id": "t1_hm4l56c", "score": "-1", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "What was he arrested for in Boulder? What did his criminal history look like. Those are the things that would have mattered to a judge issuing a PR. Unless there was some indication he was about to murder people, I don’t know if the judge could have done anything. People seem to think that everybody accused of any crime signals to the world they are about to murder.", "created_utc": "1637897607.0", "edited": "False", "id": "hm445ks", "is_submitter": "False", "link_id": "t3_r250h3", "parent_id": "t1_hm32piq", "score": "1", "subreddit": "Denver", "subreddit_id": "t5_2qn3i"}, {"author": "Prestigious_Carob745", "body": "I recommend the Magicians by Lev Grossman. It’s Harry Potter for intellectuals. Kind of. You have to read all 3 books though. If you stop at the first book, you won’t really know what the series is about.", "created_utc": "1636552494.0", "edited": "False", "id": "hk2g70k", "is_submitter": "False", "link_id": "t3_qqtllt", "parent_id": "t3_qqtllt", "score": "2", "subreddit": "Fantasy", "subreddit_id": "t5_2qknd"}, {"author": "Prestigious_Carob745", "body": "The Magicians (all 3) by Lev Grossman. It’s kind of a downer series, but the development of the main character into a better person just fills me with hope. I don’t know why, but I find that series profound and comforting.", "created_utc": "1635602386.0", "edited": "False", "id": "hin6gxe", "is_submitter": "False", "link_id": "t3_qimuzc", "parent_id": "t3_qimuzc", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}, {"author": "Prestigious_Carob745", "body": "[Rain King](https://youtu.be/izeDRfkyMAQ)", "created_utc": "1633614515.0", "edited": "False", "id": "hfq849u", "is_submitter": "False", "link_id": "t3_q2slzs", "parent_id": "t1_hfnne5p", "score": "1", "subreddit": "suggestmeabook", "subreddit_id": "t5_31t41"}]