[{"author": "tocayoinnominado", "body": "it does [https://apps.apple.com/us/app/words-hk-%E7%B2%B5%E5%85%B8/id1621976909](https://apps.apple.com/us/app/words-hk-%E7%B2%B5%E5%85%B8/id1621976909) i should have added it", "created_utc": "1666919559.0", "edited": "1666919743.0", "id": "iu2dfbg", "is_submitter": "True", "link_id": "t3_xrnxmp", "parent_id": "t1_iu1iapw", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "The reason you put a view results option is to improve the accuracy of the poll. For example, any non-native or a native who doesn't know might simply want to see the results and not give a vote to one of the options. Basically anyone who just wants to see the results will just pick one because people are not going to wait for the poll to close thus rendering the poll in effect, mostly useless.", "created_utc": "1666663523.0", "edited": "False", "id": "ito6lih", "is_submitter": "False", "link_id": "t3_ycivai", "parent_id": "t1_ito0zy6", "score": "6", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "always put a view results option", "created_utc": "1666641094.0", "edited": "False", "id": "itmpo4b", "is_submitter": "False", "link_id": "t3_ycivai", "parent_id": "t3_ycivai", "score": "10", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I don’t think there is any benefit in being this listening dominant. I do think there is benefit in reading more. Definitely read more.\n\nThe way I see it, the skill of listening takes a long time because it depends so much on your knowledge (vocab & grammar), processing speed, and pattern recognition ability. Reading helps with everything except recognizing sounds. But natives aren’t so good because their ears are amazing, they are so good because of their knowledge, processing speed, and pattern recognition. I think being this listening dominant is a waste of time.", "created_utc": "1666415046.0", "edited": "False", "id": "itaqsh5", "is_submitter": "False", "link_id": "t3_ya42wy", "parent_id": "t3_ya42wy", "score": "9", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "tocayoinnominado", "body": "lemme know if you come across anything", "created_utc": "1666316471.0", "edited": "False", "id": "it5f19z", "is_submitter": "False", "link_id": "t3_xx5k2c", "parent_id": "t3_xx5k2c", "score": "2", "subreddit": "quechua", "subreddit_id": "t5_32jdl"}, {"author": "tocayoinnominado", "body": "How would they not understand if you are literally speaking the language out loud too? I suppose there is the deaf audience, but I think most people in Hong Kong would understand most common 口語, so I vote for 口語 subtitles.", "created_utc": "1666300330.0", "edited": "False", "id": "it4ef7o", "is_submitter": "False", "link_id": "t3_y9949l", "parent_id": "t3_y9949l", "score": "10", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "if you're learning canto, you should check this podcast out!", "created_utc": "1666217306.0", "edited": "False", "id": "iszth98", "is_submitter": "False", "link_id": "t3_y7wzir", "parent_id": "t3_y7wzir", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "better frequency information from here https://words.hk/faiman/", "created_utc": "1665890548.0", "edited": "False", "id": "isi0izf", "is_submitter": "False", "link_id": "t3_y4xg7g", "parent_id": "t3_y4xg7g", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Another way to think about why this is a terrible idea: let’s say you grew up playing the cello and now want to learn the violin. You wouldn’t make time for learning the viola as an intermediary. You would just learn the damn violin because even if it’s similar to another instrument it’s never going to save you time from just learning the target instrument directly!", "created_utc": "1665855921.0", "edited": "False", "id": "isfvjxt", "is_submitter": "False", "link_id": "t3_y4t2hu", "parent_id": "t3_y4t2hu", "score": "31", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Almost everything works given enough time.", "created_utc": "1665852670.0", "edited": "False", "id": "isfnq25", "is_submitter": "False", "link_id": "t3_xxy1mh", "parent_id": "t1_isejnyt", "score": "1", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "tocayoinnominado", "body": "your mom’s love language", "created_utc": "1665592401.0", "edited": "False", "id": "is1f5fb", "is_submitter": "False", "link_id": "t3_y28egb", "parent_id": "t3_y28egb", "score": "49", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Well for one, I don't think listening exposure should make up the bulk of your studies early on because as you rightly point out, to have even a high comprehension (95%+) of things like Peppa Pig is going to require 2-3k words or maybe more. So I do think reading, SRS, and other study (phonology, grammar, etc.) should make up the bulk of your time in the early stages (however, listening should still be a consistent thing you do, but just in moderation, like 15-20 minutes or so).\n\nBut how should you go about it?\n\nNow this is a hot take but given that at the start *nothing* is highly comprehensible, and that our only goal is exposure to auditory components of the language, I think the ideal immersion is watching compelling content with native language subtitles. Now, the reason native language subtitles tend to get such a bad wrap is because people will just say: \"Look at all those anime watchers who don't know any Japanese besides 'baka'\". But this a very weak argument given that the average anime viewer is **not even trying to learn Japanese in the first place**. Not to mention they have no basic foundation of vocabulary or grammar. Now as a learner who is learning the basics and wants to pay attention to how the language is spoken, this can absolutely be achieved with native language subs. This can even be an intensive activity where you simply speed-read the subtitles as fast as you can and try to make connections from the translation to the actual Japanese. Granted, this last part is far from necessary as. at the end of the day, we mainly want to get our ears more attuned to the sounds of Japanese.\n\nAside from that, graded readers with audio, simple short stories or fables with audio, short dialogues, comprehensible input youtube channels, and even textbook audios can be great at the beginning because there will be messages that you understand.\n\nLastly, listening comprehension is not something you can really speedrun by just doing a bajillion hours  of it anyways. For one it seems to be just a slow, incremental process, and on the other it is tied to your knowledge of the language, both vocabulary and grammar. Even if knowledge is not the problem your general processing speed of the language takes time to develop so there's no reason to whitenoise with input in the hopes that you will get native-like ability as quickly as possible. I think an AJATT-style approach is much more suitable from a late-intermediate stage and beyond.", "created_utc": "1665250782.0", "edited": "1665559421.0", "id": "irjbo1e", "is_submitter": "False", "link_id": "t3_xxy1mh", "parent_id": "t1_iril7o3", "score": "5", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "tocayoinnominado", "body": "This is so true. Just because you are exposed to something does not mean you are learning from it. The time you are most primed for white noising (and the exact time you shouldn't be dumping 6 hours a day of your life into listening) is in the first couple months.", "created_utc": "1665221080.0", "edited": "False", "id": "iri02ck", "is_submitter": "False", "link_id": "t3_xxy1mh", "parent_id": "t1_irehnaz", "score": "1", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "tocayoinnominado", "body": "Disclaimer: I don't follow this shitty method (and neither should you)\n\nYou absolutely shouldn't spend most of your time listening to completely incomprehensible input. It's actually laughable reading how Khatz talks about Krashen because he totally misrepresents what he says and self admits that he doesn't actually read much of what Krashen writes. Someone else posted the article, \"Why You Should Keep Listening Even If You Don’t Understand\" which is complete nonsense, so let's take a look.\n\n&#x200B;\n\n>I haven’t actually read Krashen in a while and I can’t be bothered to go back and check, but, as I recall, he suggests input be fun, freely available in large quantity, and, yes, comprehensible in an i+1 way. Nothing wrong with that whatsoever. What I’m saying is that the “comprehensible” part is just a way to make it more “fun”, so it’s more a bonus option than necessarily a hard requirement. The hard requirements are the input x fun x large quantity. Or something like that? I don’t want to get too wrapped up in theory since I don’t know what I’m talking about anyway…Besides, Dr. Krashen is probably down with this already. -Khatzumoto\n\n&#x200B;\n\n* \"I haven’t actually read Krashen in a while and I can’t be bothered to go back and check\"\n   * he doesn't actually care about the research or what Krashen thinks\n* \"the “comprehensible” part is just a way to make it more “fun”, so it’s more a bonus option than necessarily a hard requirement\"\n   * his source is literally that he made it the fuck up because that's not what Krashen says\n* \"I don’t know what I’m talking about anyway\"\n   * yes, we know\n\n&#x200B;\n\nSo what did Krashen actually say?\n\n>We acquire language in one way and *only* one way: when we get **comprehensible** input in a low anxiety environment.\n\n(emphasis mine)\n\n[https://youtu.be/NiTsduRreug?t=914](https://youtu.be/NiTsduRreug?t=914)\n\n&#x200B;\n\nThe comprehensible part isn't just for funsies, it is the foundational mechanism for improving at a language. But of course, Khatz wouldn't know that because he doesn't fucking care. He literally said as much in that article. Why do people still follow his teachings when he literally just follows his intuition just like any other dipshit. He isn't trying to get to the truth. He already has his truth based on his experience and how babies learn. Large amounts of incomprehensible input is stupid, Krashen doesn't agree, and the creator of this method doesn't know what the fuck they are talking about, so maybe y'all should stop taking them so seriously.", "created_utc": "1665220432.0", "edited": "False", "id": "irhzfnu", "is_submitter": "False", "link_id": "t3_xxy1mh", "parent_id": "t3_xxy1mh", "score": "4", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "tocayoinnominado", "body": "Knowing Jyutping is gonna be very useful.", "created_utc": "1665076859.0", "edited": "False", "id": "irazr19", "is_submitter": "False", "link_id": "t3_xwppdc", "parent_id": "t3_xwppdc", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Oh yes I think you are 100% right. That would be way better", "created_utc": "1664615205.0", "edited": "False", "id": "iqlsff1", "is_submitter": "False", "link_id": "t3_xoy4pq", "parent_id": "t1_iqlk38e", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "very cool!", "created_utc": "1664615123.0", "edited": "False", "id": "iqlsc2c", "is_submitter": "True", "link_id": "t3_xrnxmp", "parent_id": "t1_iqlq9o2", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I am. These super old comics aren't really available any other way.", "created_utc": "1664605266.0", "edited": "False", "id": "iqlguev", "is_submitter": "False", "link_id": "t3_xoy4pq", "parent_id": "t1_iqbtqmk", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Oh I see what you mean now. It's extremely limited. It only offers support for Cantonese words that are single characters. Even when a Mandarin word coincides, as in 巴士 it is simply broken down as baa1 si6 and not baa1 si2 (so it seems the Jyutping is auto-generated mostly). There's really no reason to use this over any of the above dictionaries.", "created_utc": "1664584206.0", "edited": "False", "id": "iqkhasl", "is_submitter": "True", "link_id": "t3_xrnxmp", "parent_id": "t1_iqjgjiy", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "As far as I can tell, it doesn’t have any Cantonese support?", "created_utc": "1664554100.0", "edited": "False", "id": "iqij4zl", "is_submitter": "True", "link_id": "t3_xrnxmp", "parent_id": "t1_iqh5qgl", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Ah I see, I’ll add it and note that.", "created_utc": "1664553980.0", "edited": "False", "id": "iqiiubf", "is_submitter": "True", "link_id": "t3_xrnxmp", "parent_id": "t1_iqh3lae", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "So this has every CantoDict entry?", "created_utc": "1664516590.0", "edited": "False", "id": "iqgsq80", "is_submitter": "True", "link_id": "t3_xrnxmp", "parent_id": "t1_iqgiqjj", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Awesome! Looks like the same as Cantonese Popup Dictionary but with Mandarin support too.", "created_utc": "1664500485.0", "edited": "False", "id": "iqfxzac", "is_submitter": "True", "link_id": "t3_xrnxmp", "parent_id": "t1_iqfxrpf", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "If anybody is interested in learning Cantonese, check out the Refold Cantonese discord server. Has the best resources that exist.\n\nhttps://refold.la/", "created_utc": "1664443370.0", "edited": "False", "id": "iqchibh", "is_submitter": "False", "link_id": "t3_xqnyms", "parent_id": "t3_xqnyms", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "you could always make another anonymous email", "created_utc": "1664302245.0", "edited": "False", "id": "iq4tu89", "is_submitter": "False", "link_id": "t3_xp1psq", "parent_id": "t1_iq41gjs", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "You should make a Google Doc and collect the info so people can see what you have.", "created_utc": "1664258014.0", "edited": "False", "id": "iq2lucr", "is_submitter": "False", "link_id": "t3_xp1psq", "parent_id": "t1_iq2iihi", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "* Brigham Young University, Provo, UT.  Cantonese through intermediate level offered.\n* College of Alameda, Peralta Community Colleges District, Alameda, California. Cantonese course offered up to Advanced level.\n* Columbia University, Columbia, New York. Courses through the intermediate level offered through the Language Resource Center.\n* The Five Colleges (Amherst, Hampshire, Mount Holyoke, Smith, and University of Massachusetts, Amherst) Offers Cantonese for Mandarin speakers through the Supervised Independent Language Programs.\n* Foreign Service Institute, Arlington, Virginia. Basic course online.\n* Harvard  University, Cambridge, MA. Taught as an on-demand tutorial for those needing language training for a research purpose.\n* New York University, Manhattan, New York City. (Note: elementary and intermediate Cantonese courses for credit in the Department of Social and Cultural Analysis. Classes consist of mostly Mandarin speakers with a few local heritage learners.)\n* Ohio State University, Columbus, Ohio. Several Cantonese courses to choose from.\n* Sacramento City College, Sacramento, California. Two beginner and two intermediate courses offered.\n* University of California San Diego, San Diego, California. Offers an introductory course and Cantonese for heritage learners.\n* San Francisco City College, San Francisco, California. Beginning and intermediate level\n* San Francisco State University, San Francisco, California. A bilingual authorization program is offered.\n* Stanford University, Stanford, California. Oral-communication courses at the beginning and intermediate levels.\n* University of Arizona Critical Languages Program, Tucson, Arizona. One Cantonese class offered.\n* University of California Berkeley, Berkeley, California. Offers Elementary Cantonese for both heritage and non-heritage learners.\n* University of Hawaii, Manoa, Honolulu, Hawaii.\n* Williams College, Williamstown, MA. Introductory Cantonese courses offered.\n* University of Pennsylvania, PA. The Penn Language Center offers two beginning and two intermediate level Cantonese course.  \n\n\nSource: [https://cantoneselanguageassociation.byu.edu/cantonese-programs-around-the-world/](https://cantoneselanguageassociation.byu.edu/cantonese-programs-around-the-world/)", "created_utc": "1664254664.0", "edited": "False", "id": "iq2h17v", "is_submitter": "False", "link_id": "t3_xp1psq", "parent_id": "t3_xp1psq", "score": "12", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Just because you appeal to authority doesn't make that a fallacious appeal to authority. We appeal to authorities like doctors, the CDC, the FDA, etc. all the time and it makes sense to do so.\n\nIt does warrant more consideration when someone of Magnus's standing and prowess makes such a claim. That doesn't mean the claim is true.", "created_utc": "1664233185.0", "edited": "False", "id": "iq18oix", "is_submitter": "False", "link_id": "t3_xotwyt", "parent_id": "t1_iq0jzu5", "score": "1", "subreddit": "LivestreamFail", "subreddit_id": "t5_38jf0"}, {"author": "tocayoinnominado", "body": "Cantonese. In Hong Kong the formal written language is pretty much Mandarin (Standard Written Chinese). A diglossic situation exists for pretty much all Chinese languages as far as I know.", "created_utc": "1664128324.0", "edited": "False", "id": "ipv6sri", "is_submitter": "False", "link_id": "t3_xnhob4", "parent_id": "t3_xnhob4", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Even if I were to grant you that, it just doesn't matter. It's one of the most well known languages in the world. There's also more English speakers on the internet. And ALSO you can discuss and promote the learning of Cantonese in any language you want. Reddit is just one place. Nothing is stopping natives from posting more in Cantonese. If the subreddit wants to promote more writing in Cantonese they could make Cantonese-only posts. And also this subreddit is just a tiny drop in the bucket. There are way more impactful things one can do for Cantonese than leaving a comment on a reddit thread.", "created_utc": "1663807537.0", "edited": "False", "id": "ipeokt9", "is_submitter": "False", "link_id": "t3_xjnfxc", "parent_id": "t1_ipee4c4", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "1. That's \"first-language speakers\". English is the most spoken language in the world, as in the language known by the largest number of people. [Ethnologue](https://www.ethnologue.com/guides/ethnologue200)\n2. You can promote Cantonese with English, and you can also do so with Cantonese.", "created_utc": "1663798603.0", "edited": "False", "id": "ipe47rf", "is_submitter": "False", "link_id": "t3_xjnfxc", "parent_id": "t1_ipdmzps", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Is it ironic? I mean r/cantonese is a place for discussing Cantonese. English is the most widely spoken language in the world. Discussing it in the most widely spoken language seems par for the course. I don't really see how that is ironic. It would be cool if more people posted in both English and Cantonese though.", "created_utc": "1663790252.0", "edited": "False", "id": "ipdj72h", "is_submitter": "False", "link_id": "t3_xjnfxc", "parent_id": "t1_ipd6tb0", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I understand. A lot of polls get posted here but nobody does it, so it's a little frustrating. No worries.", "created_utc": "1663715752.0", "edited": "False", "id": "ip9dpif", "is_submitter": "False", "link_id": "t3_xj81n8", "parent_id": "t1_ip99kpz", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "You HAVE to put a 3rd option for people that want to see results otherwise people will click something random just to see. For example, people that are learning or don’t know IPA.", "created_utc": "1663690809.0", "edited": "False", "id": "ip7me3t", "is_submitter": "False", "link_id": "t3_xj81n8", "parent_id": "t3_xj81n8", "score": "30", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "You didn't look very hard then. Literally google Cantonese textbooks and stuff comes up my guy.", "created_utc": "1663656590.0", "edited": "False", "id": "ip5ytpf", "is_submitter": "False", "link_id": "t3_xj067p", "parent_id": "t3_xj067p", "score": "17", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Imagine being this brave to post for the 1000th time about fake polyglots. Inspiring display.", "created_utc": "1663383482.0", "edited": "False", "id": "ior20iy", "is_submitter": "False", "link_id": "t3_xg59p3", "parent_id": "t3_xg59p3", "score": "13", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "tocayoinnominado", "body": "very true", "created_utc": "1663356827.0", "edited": "False", "id": "iopf9rh", "is_submitter": "False", "link_id": "t3_xfmcvw", "parent_id": "t1_iopd555", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "brave", "created_utc": "1663297802.0", "edited": "False", "id": "iombem4", "is_submitter": "False", "link_id": "t3_xf8k6e", "parent_id": "t3_xf8k6e", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I think making subtitles (or doing accurate transcriptions) is one of the best active techniques. You have to always give your attention to hear exactly what is spoken.", "created_utc": "1663149568.0", "edited": "False", "id": "iodk0wy", "is_submitter": "False", "link_id": "t3_xdrmw2", "parent_id": "t3_xdrmw2", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Chinese languages? Nah, just Mandarin. His canto is trash.", "created_utc": "1663041406.0", "edited": "False", "id": "io7rohp", "is_submitter": "False", "link_id": "t3_xc8ltj", "parent_id": "t1_io4sb17", "score": "3", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "tocayoinnominado", "body": "That’s because they’re fake and generate easy karma lol", "created_utc": "1662970988.0", "edited": "False", "id": "io3lcxl", "is_submitter": "False", "link_id": "t3_xbm4lj", "parent_id": "t1_io09cfh", "score": "1", "subreddit": "AmItheAsshole", "subreddit_id": "t5_2xhvq"}, {"author": "tocayoinnominado", "body": "Post a clip of you speaking Spanish about a random topic. Maybe you’re already there!", "created_utc": "1662944037.0", "edited": "False", "id": "io2d89a", "is_submitter": "False", "link_id": "t3_xbqli3", "parent_id": "t3_xbqli3", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I would love to fully explain everything, but I don’t really care to do it all in this reddit post comments. The thing about Migaku is that it is still in beta and already the best tool for cantonese. I am going to make a video going in depth on it when it is more or less done. Right now so much is changing that it simply just doesn’t make sense to do so. I made all the Cantonese dictionaries that it uses out of Canto Ceditct, CC-Canto, and most importantly Words.hk (the best Cantonese dictionary that exists). I also personally improve the parsing. the subtitles are available. Just click on my profile and go to the CantoCaptions post. If you want more details about Migaku and it’s potential then pls dm me.", "created_utc": "1662714037.0", "edited": "False", "id": "inpczi0", "is_submitter": "False", "link_id": "t3_x2tfbx", "parent_id": "t1_innykhh", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I use Migaku toolset to read Cantonese (best tool for learning Cantonese that exists) [https://www.migaku.io/](https://www.migaku.io/)\n\nMy routine mainly consists of reading (with the above toolset) and making accurate Cantonese subtitles.", "created_utc": "1662407256.0", "edited": "False", "id": "in828qi", "is_submitter": "False", "link_id": "t3_x2tfbx", "parent_id": "t3_x2tfbx", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I think Cantonese might actually be easier than Mandarin, but regardless, the gap is very small in terms of relative difficulty.", "created_utc": "1659380260.0", "edited": "False", "id": "iijjxsq", "is_submitter": "False", "link_id": "t3_wd3xii", "parent_id": "t3_wd3xii", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "The ABC Canto dictionary is worth it", "created_utc": "1658481249.0", "edited": "False", "id": "ih61b3u", "is_submitter": "False", "link_id": "t3_w24os0", "parent_id": "t3_w24os0", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Oh ya for sure. I should have clarified that.", "created_utc": "1656388626.0", "edited": "False", "id": "ie0jckm", "is_submitter": "False", "link_id": "t3_vjt9xr", "parent_id": "t1_idxbg7o", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "1. learn Jyutping\n2. basic vocab anki decks\n3. read through a basic grammar textbook\n4. read/watch hambaanglaang and read/listen to storybooks cantonese graded readers\n5. watch simple youtube videos with subs\n6. deep dive subbed content from CantoCaptions\n7. watch/read harder content that you find interesting\n\nLINKS\n\n* 1.\n   * [https://en.wikipedia.org/wiki/Jyutping](https://en.wikipedia.org/wiki/Jyutping) \n   * [https://cantolounge.com/jyutping-chart/](https://cantolounge.com/jyutping-chart/) \n   * Jyutping practice game [https://chaaklau.github.io/cantorocks/](https://chaaklau.github.io/cantorocks/) \n* 2. \n   *  [https://ankiweb.net/shared/decks/Cantonese](https://ankiweb.net/shared/decks/Cantonese)\n* 3. \n   * [https://www.amazon.com/Basic-Cantonese-Grammar-Workbooks-Virginia-dp-0415815592/dp/0415815592/ref=mt\\_other?\\_encoding=UTF8&me=&qid=](https://www.amazon.com/Basic-Cantonese-Grammar-Workbooks-Virginia-dp-0415815592/dp/0415815592/ref=mt_other?_encoding=UTF8&me=&qid=)\n* 4. \n   * 冚唪唥粵文讀本 Hambaanglaang Cantonese Graded Readers [https://www.youtube.com/channel/UCNKyBXronmLoYlja3VZG6AQ](https://www.youtube.com/channel/UCNKyBXronmLoYlja3VZG6AQ)\n   * 冚唪唥粵文讀本 Hambaanglaang Cantonese Graded Readers [https://hambaanglaang.hk/all-levels/](https://hambaanglaang.hk/all-levels/)\n   * [https://www.storybookscanada.ca/stories/yue/](https://www.storybookscanada.ca/stories/yue/)\n* 5.\n   * Uncle Calvin 廣東話教室 [https://www.youtube.com/c/UncleCalvin%E5%BB%A3%E6%9D%B1%E8%A9%B1%E6%95%99%E5%AE%A4](https://www.youtube.com/c/UncleCalvin%E5%BB%A3%E6%9D%B1%E8%A9%B1%E6%95%99%E5%AE%A4) \n   * 黐住這一家 Sticky Love Family [https://www.youtube.com/channel/UCUtm1awT2EO9D7uJ2OlMcTQ](https://www.youtube.com/channel/UCUtm1awT2EO9D7uJ2OlMcTQ) \n* 6. \n   * CantoCaptions [https://drive.google.com/drive/folders/1dQU8lb0dprmDNDr\\_Q6utOP\\_I7JcSQt-R?usp=sharing](https://drive.google.com/drive/folders/1dQU8lb0dprmDNDr_Q6utOP_I7JcSQt-R?usp=sharing)\n   * CantoCaptions - YouTube (5k+ videos with Cantonese subs) [https://docs.google.com/spreadsheets/d/1CmN8GPalrb45YFIPrWgh7GRYyoUhnizEOImY6kAW82w/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1CmN8GPalrb45YFIPrWgh7GRYyoUhnizEOImY6kAW82w/edit?usp=sharing)", "created_utc": "1656120191.0", "edited": "False", "id": "idmvukr", "is_submitter": "False", "link_id": "t3_vjt9xr", "parent_id": "t3_vjt9xr", "score": "16", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Not really a realistic nor helpful suggestion for people starting from 0.", "created_utc": "1656119421.0", "edited": "False", "id": "idmua6g", "is_submitter": "False", "link_id": "t3_vjt9xr", "parent_id": "t1_idlbcsm", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Nowadays there's more than enough content. I would even say it's a resource-rich language as opposed to a resource-poor one.", "created_utc": "1655853310.0", "edited": "False", "id": "id8mweo", "is_submitter": "False", "link_id": "t3_vhk8u6", "parent_id": "t1_id7qv3v", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Ya it takes some learning but then it becomes like anything else. You just get used to it. I think 倉頡 is way harder imo", "created_utc": "1655533879.0", "edited": "False", "id": "ict17yd", "is_submitter": "False", "link_id": "t3_vdid9n", "parent_id": "t1_ics8wjl", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "My only question is what is the point of this document?\n\nAlso, I use a Jyutping input method called 粵切 jyut6 cit3. It's a double jyutping keyboard 1 key for the initial and 1 key for the final, and optionally 1 key for the tone.", "created_utc": "1655460858.0", "edited": "False", "id": "icoxwla", "is_submitter": "False", "link_id": "t3_vdid9n", "parent_id": "t3_vdid9n", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "CantoCaptions is a database of Cantonese subtitles. As long as you have the English, you can display them simultaneously with a video player.", "created_utc": "1655199061.0", "edited": "False", "id": "icb6jb4", "is_submitter": "False", "link_id": "t3_vbt28f", "parent_id": "t1_icaaqq5", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Read?", "created_utc": "1655105338.0", "edited": "False", "id": "ic6ggxl", "is_submitter": "False", "link_id": "t3_v89fkv", "parent_id": "t3_v89fkv", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Individually 1 plate is 45 lbs (off the bar). If you are talking about a lift, e.g. a 2 plate bench, then you are talking about 2 plates on each side = 225.", "created_utc": "1655011023.0", "edited": "False", "id": "ic22127", "is_submitter": "False", "link_id": "t3_va9bhn", "parent_id": "t1_ic207ki", "score": "2", "subreddit": "Destiny", "subreddit_id": "t5_2qnvz"}, {"author": "tocayoinnominado", "body": "It absolutely is the case", "created_utc": "1655010914.0", "edited": "False", "id": "ic21v70", "is_submitter": "False", "link_id": "t3_va9bhn", "parent_id": "t1_ic1uieu", "score": "2", "subreddit": "Destiny", "subreddit_id": "t5_2qnvz"}, {"author": "tocayoinnominado", "body": "Was gonna post this. Thanks for sharing my post too.", "created_utc": "1654413683.0", "edited": "False", "id": "ib8a229", "is_submitter": "False", "link_id": "t3_v4erg5", "parent_id": "t1_ib4c7wg", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "It's not THE Refold Cantonese deck. There is no refold canto deck yet.", "created_utc": "1654413469.0", "edited": "False", "id": "ib89t9v", "is_submitter": "False", "link_id": "t3_v4zoys", "parent_id": "t1_ib7c5v5", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I don't think this is true. 阿 is the initial particle and 啊 is a final particle.", "created_utc": "1652214513.0", "edited": "False", "id": "i83hba2", "is_submitter": "False", "link_id": "t3_u8raqj", "parent_id": "t1_i5oylfb", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I’m not sure if there are studies on this, but I think your question is problematic to answer. You use both the words “study” (in the title) and “learn” (in the post) but I’m assuming you mean “learn” as you can obviously “study” as many words as you can read in a given time frame. The issue is, learning a word is not binary but an arbitrary decision among a number of parameters. For example, you have to determine the timeframe within which one can recall the information (relatively straightforward), but also the kind of information that constitutes learning (varied and complex). This could be learning to produce, learning to recall (with or without context), connotation, a range of senses for a given lexical item, collocations, etc. As for the meaning itself, does this mean recalling a definition? knowing a synonym? a translation? a vague, general understanding?\n\nAs for your question specifically, how long of a study session? How many occurrences of a given word are there? Is it just a list of vocab? Is there context presented? Accompanying audio? Pictures? Translations? There are so many variables at play. I don’t think there is an adequate answer to this question or studies to be able to answer it in any satisfactory capacity. \n\nThat said, I don’t think it’s particularly important to know the answer. Whether it’s 5 or 15, what really matters is consistent exposure and growing the depth of word knowledge gradually over time.", "created_utc": "1652059146.0", "edited": "False", "id": "i7v7pan", "is_submitter": "False", "link_id": "t3_ul918w", "parent_id": "t3_ul918w", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Well this is a modified version of the older edition. I made it so that it would have copypasteable text, characters, Jyutping, IPA, and some extra explanations and charts.", "created_utc": "1651903222.0", "edited": "False", "id": "i7nc8vd", "is_submitter": "False", "link_id": "t3_ujivpg", "parent_id": "t1_i7mi7cp", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "[https://www.linguajunkie.com/cantonese/cantonese-textbooks](https://www.linguajunkie.com/cantonese/cantonese-textbooks)\n\n  \nMy recommendation: [Modified Basic Cantonese](https://drive.google.com/file/d/1dfqAoWQgRA-CXNiGewoWCbcz7TgyTgLA/view?usp=sharing) (grammar reference)", "created_utc": "1651834088.0", "edited": "False", "id": "i7jercz", "is_submitter": "False", "link_id": "t3_ujivpg", "parent_id": "t3_ujivpg", "score": "11", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "God this post is infuratingly stupid but just so we're clear:  \n\n\nu/anoobypro's list of grievances:\n\n* sometimes it shows up before the standard written Chinese page causing you to waste half a second of additional scrolling :(\n\nActual benefits of Cantonese wikipedia:\n\n* preserving the oral language through a written language\n* providing an outlet to explain concepts in Cantonese, including instances where no such other examples exist\n* further development of Cantonese culture through writing/reading\n* massive resource for Cantonese learners\n\nMany people have already posted it but YOUR conception of it not being formal is due to your upbringing. There is absolutely no reason written Cantonese couldn't or shouldn't be a formal written language. It takes away from nobody, it doesn't affect the standard language, and provides actual benefits to many others.", "created_utc": "1651727740.0", "edited": "False", "id": "i7e3g2z", "is_submitter": "False", "link_id": "t3_uilr0m", "parent_id": "t3_uilr0m", "score": "16", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "And I'm not saying you're wrong, or that this wouldn't be a good way to approach using these words. I just wouldn't call it correct without saying according to what/who.", "created_utc": "1651639693.0", "edited": "False", "id": "i797faz", "is_submitter": "False", "link_id": "t3_uha9uk", "parent_id": "t1_i795s7u", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I think you are missing the point. It doesn't matter. We live in the present. Historical precedent is not binding.", "created_utc": "1651638428.0", "edited": "False", "id": "i7959zp", "is_submitter": "False", "link_id": "t3_uha9uk", "parent_id": "t1_i794yjs", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "They are *obviously* two different words? Even if I grant you that, it's irrelevant. Whether we're talking about two different words, or variants of the same word, correctness can only be defined according to some prescriptive body.", "created_utc": "1651638035.0", "edited": "False", "id": "i794l3k", "is_submitter": "False", "link_id": "t3_uha9uk", "parent_id": "t1_i78w6gi", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I would refer you to my post, but I would say you are actually confidently incorrect right now.", "created_utc": "1651614210.0", "edited": "False", "id": "i77p15u", "is_submitter": "False", "link_id": "t3_uha9uk", "parent_id": "t1_i74yimr", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I don't know what you're basing this off of, but Just because a usage or meaning of a word can be traced back historically, that does not mean that it is then ipso facto \"correct.\" Words change, meanings change, conventions change, and acceptability of all of the above in the eyes of native speakers change over time. In reality, the only way you can establish \"correctness\" of a given word or usage is by appealing to a given institution, such as some governing body, linguistic institution, or dictionary. If I spell word as \"worde,\" its correctness is not determined by if the original spelling of the word happened to be with an e at the end. You would have to say according to X modern source, \"worde\" is listed as a possible spelling.\n\nThe goal of most dictionaries is also not to decide entirely arbitrarily, but to capture the shared sentiment of natives and actual usage of the terms that they document in that era. I personally appeal to 粵典 [words.hk](https://words.hk)  when determinging what is correct, and they list 畀 and 俾 for all 3 senses. Regardless, making a blanket statement on correctness is just nonsensical. Lanugage is all arbitrary at the end of the day and what matters is effective communication.", "created_utc": "1651613994.0", "edited": "False", "id": "i77oipn", "is_submitter": "False", "link_id": "t3_uha9uk", "parent_id": "t3_uha9uk", "score": "9", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "oh mb", "created_utc": "1651337320.0", "edited": "False", "id": "i6t2mzo", "is_submitter": "False", "link_id": "t3_uesxa0", "parent_id": "t1_i6rh3r1", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Literally the 5th link on google my guy. https://xiaoheimi.net/index.php/vod/play/id/10420/sid/1/nid/1.html", "created_utc": "1651283570.0", "edited": "False", "id": "i6qq2nj", "is_submitter": "False", "link_id": "t3_uesxa0", "parent_id": "t3_uesxa0", "score": "0", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "It's the Migaku discord. You can message that you're learning canto and I will message you.  \n[https://discord.gg/JR5NrTTFhF](https://discord.gg/JR5NrTTFhF)", "created_utc": "1650954990.0", "edited": "False", "id": "i68hwst", "is_submitter": "False", "link_id": "t3_uc1vhg", "parent_id": "t1_i680h7v", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "If you post in the discord, I can help you set up things and I have a ton of resources.", "created_utc": "1650942648.0", "edited": "False", "id": "i67xrl8", "is_submitter": "False", "link_id": "t3_uc1vhg", "parent_id": "t1_i67x3ra", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "If you used Migaku (language learning program) you could generate jyutping above each character and parse text into separate words. You can also track your known words and then show jyutping only over unknown words. You can parse any website, subtitles, ebooks, etc. It's the best way to learn Cantonese that exists.  \n\n\nhttps://www.migaku.io/", "created_utc": "1650941537.0", "edited": "False", "id": "i67vg4p", "is_submitter": "False", "link_id": "t3_uc1vhg", "parent_id": "t3_uc1vhg", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Rhapsody in Lingo 絮言．狂想  \n\n\nLinguistics podcast\n\n  \nhttps://rhapsodyinlingo.com/en/category/podcast-en/  \nhttps://www.youtube.com/c/RhapsodyinLingo", "created_utc": "1650789502.0", "edited": "False", "id": "i5z9qqd", "is_submitter": "False", "link_id": "t3_uaism4", "parent_id": "t3_uaism4", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Free lingq is very bad. However, the paid version is extremely good. I would highly recommend using LingQ. You seem to be a bit flustered with the program, so I'd recommend checking out a guide to get your bearings like this [one](https://www.youtube.com/watch?v=Dgg1iChSKi8).", "created_utc": "1650421114.0", "edited": "False", "id": "i5fho74", "is_submitter": "False", "link_id": "t3_u7gimk", "parent_id": "t3_u7gimk", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "direct link to refold cantonese discord server: https://discord.gg/uu3xfWHXw2", "created_utc": "1650181972.0", "edited": "False", "id": "i523xps", "is_submitter": "False", "link_id": "t3_u4q5ya", "parent_id": "t1_i4xbvxe", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Migaku Tools are far and away the best. It's still in beta but already very powerful a number of languages. It's like LingQ and Language Reactor on steroids. You can easily make cards, do lookups, import texts into the reader, track known words, can parse text to have readings, and a whole host of other features are on the way like a language learning SRS, OCR, and more. It's not super user-friendly yet but they are making great strides.\n\nWebsite: https://www.migaku.io/\n\nTrailer (somewhat outdated) https://www.youtube.com/watch?v=85kRGJuQ7aU\n\nChrome extension: https://chrome.google.com/webstore/detail/immerse-with-migaku-beta/acpchjgielgmkgkplljakcibfbjjppbk", "created_utc": "1650154813.0", "edited": "False", "id": "i50tu9f", "is_submitter": "False", "link_id": "t3_u516oh", "parent_id": "t3_u516oh", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "What shows are you referring to?", "created_utc": "1650000183.0", "edited": "False", "id": "i4sr09g", "is_submitter": "False", "link_id": "t3_u3wfe9", "parent_id": "t1_i4s0uab", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Formal written Cantonese is pseudo-Mandarin. I would say you should focus on the written vernacular language. I would recommend that you join the Refold Cantonese server as I have many of the best resources laid out in an easy to understand format. Join here: [https://refold.la/join](https://refold.la/join)\n\nSteps:\n\n1. Get a good anki deck of common words\n2. Get a basic grammar resource (I recommend [this](https://www.reddit.com/r/Cantonese/comments/knfytj/best_new_grammar_resource_modified_basic/))\n3. Start reading graded readers (I recommend [this](https://www.storybookscanada.ca/stories/yue/) and [this](https://hambaanglaang.hk/all-levels/))\n4. Start reading actual literature (see this [catalog](https://www.reddit.com/r/Cantonese/comments/sy8s8s/cantonese_literature_database_%E7%B2%B5%E8%AA%9E%E6%96%87%E5%AD%B8_hundreds_of/))", "created_utc": "1649785497.0", "edited": "1649788385.0", "id": "i4gfhvn", "is_submitter": "False", "link_id": "t3_u24fxn", "parent_id": "t3_u24fxn", "score": "24", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "available here as an etext [https://wordshk.github.io/yue\\_references/%E5%BB%96%E9%B3%B3%E8%88%92%EF%BC%8E%E5%AC%89%E7%AC%91%E9%9B%86/%E5%AC%89%E7%AC%91%E9%9B%86.html](https://wordshk.github.io/yue_references/%E5%BB%96%E9%B3%B3%E8%88%92%EF%BC%8E%E5%AC%89%E7%AC%91%E9%9B%86/%E5%AC%89%E7%AC%91%E9%9B%86.html)", "created_utc": "1648443368.0", "edited": "False", "id": "i2ei538", "is_submitter": "False", "link_id": "t3_tpz1j6", "parent_id": "t3_tpz1j6", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "If you want advice on learning and a bunch of resources then join the Refold Cantonese Discord server https://refold.la/join", "created_utc": "1648030727.0", "edited": "False", "id": "i1rzpee", "is_submitter": "False", "link_id": "t3_tkqjzq", "parent_id": "t3_tkqjzq", "score": "7", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "This is unnecessarily cumbersome at least on Windows you can just use ShareX OCR. Press a hotkey, select the region, runs OCR, and it automatically copies the output to your clipboard.", "created_utc": "1647235773.0", "edited": "False", "id": "i0l1wn2", "is_submitter": "False", "link_id": "t3_tdcktl", "parent_id": "t1_i0j26sf", "score": "1", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "tocayoinnominado", "body": "What you are asking for is inherently technical though.  \n\n\nLow tech: Use OCR to capture text then paste the result then use a popup dictionary on that text kinda like here [https://youtu.be/CDbxEIUL0RU?t=1147](https://youtu.be/CDbxEIUL0RU?t=1147)\n\n&#x200B;\n\nHigh tech: Use a textextractor to automatically extract the game text to a clipboard that can parse that text and do instant lookups. Example with a visual novel here:   \n[https://www.youtube.com/watch?v=OxN\\_f59kAfs](https://www.youtube.com/watch?v=OxN_f59kAfs)  \n\n\nThis last example uses Migaku software which has been updated alot since. Find it here: [https://www.migaku.io/](https://www.migaku.io/)", "created_utc": "1647235653.0", "edited": "False", "id": "i0l1qhp", "is_submitter": "False", "link_id": "t3_tdcktl", "parent_id": "t1_i0jf6wt", "score": "3", "subreddit": "ChineseLanguage", "subreddit_id": "t5_2qyz1"}, {"author": "tocayoinnominado", "body": "You are the best!", "created_utc": "1646600622.0", "edited": "False", "id": "hzmdypr", "is_submitter": "False", "link_id": "t3_t7wrxq", "parent_id": "t3_t7wrxq", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Happy to help!", "created_utc": "1645567827.0", "edited": "False", "id": "hy0sqbv", "is_submitter": "True", "link_id": "t3_sy8s8s", "parent_id": "t1_hxzzl5g", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Just realized not even [Words.hk](https://Words.hk) 粵典 is a recommended dictionary in the side bar. The side bar itself could really use a rework and update.", "created_utc": "1645497699.0", "edited": "False", "id": "hxwz2rx", "is_submitter": "True", "link_id": "t3_sy8s8s", "parent_id": "t1_hxwn53j", "score": "8", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Appreciate the kind words!", "created_utc": "1645492223.0", "edited": "False", "id": "hxwn9im", "is_submitter": "True", "link_id": "t3_sy8s8s", "parent_id": "t1_hxwn53j", "score": "4", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "What is the dictionary that it uses?", "created_utc": "1645399251.0", "edited": "False", "id": "hxrj4l8", "is_submitter": "False", "link_id": "t3_sxdmm0", "parent_id": "t3_sxdmm0", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": ">was supposedly just about ready for public release something like 2 Christmases ago\n\nNot even remotely true. Back then he was only mentioning how early they were into the project and stressed how *far* it was from being fully developed.\n\n>The thing is, we've been repeatedly assured that the browser extension, and all the Anki addons, would be completely free and open source. Unless I'm missing something with these recent changes, that was an outright lie.\n\nThere are still a healthy amount of addons that are free. They never said it would be completely free, but that they wanted to release a free version eventually. Do you not think business plans can change? You do realize this is a business trying to do its best to actually be viable and help language learners in the meantime? You do realize that projects and time cost money? The crying about how stuff can only be free and always be free is insufferably short-sighted.", "created_utc": "1645347459.0", "edited": "False", "id": "hxon7pl", "is_submitter": "False", "link_id": "t3_svngbj", "parent_id": "t1_hxj7ff5", "score": "3", "subreddit": "ImmerseWithMigaku", "subreddit_id": "t5_34moth"}, {"author": "tocayoinnominado", "body": "no u", "created_utc": "1644807492.0", "edited": "False", "id": "hwv30a1", "is_submitter": "False", "link_id": "t3_srhu8h", "parent_id": "t1_hws0t5t", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "白話文 is just written vernacular language tho technically, even if ppl do use that to specifically refer to written vernacular cantonese. Why not use a cantonese specific term? 粵文 is the best term", "created_utc": "1644807473.0", "edited": "False", "id": "hwv2yud", "is_submitter": "False", "link_id": "t3_srhu8h", "parent_id": "t1_hwrxomb", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Ya Disney+ is one of the best platforms for Cantonese content right now.", "created_utc": "1644320007.0", "edited": "False", "id": "hw2j84y", "is_submitter": "False", "link_id": "t3_smi0kk", "parent_id": "t1_hw2ieza", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Imo, the usage of written Cantonese is growing. There are over a hundred books/comics on the Google Play store with many released in the last 5 years. There is also the very important [Resonate 迴響](https://resonate.hk/) literary magazine that is going strong after well over a year. Cantonese Wikipedia is also growing. I started a subtitle project to make and compile existing subtitles called [CantoCaptions](https://drive.google.com/drive/u/1/folders/1dQU8lb0dprmDNDr_Q6utOP_I7JcSQt-R) in the hopes of promoting the creation of more accurate subtitles.", "created_utc": "1644265382.0", "edited": "False", "id": "hvzm94l", "is_submitter": "False", "link_id": "t3_smi0kk", "parent_id": "t3_smi0kk", "score": "6", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "They pretty clearly mean written vernacular Cantonese", "created_utc": "1644264966.0", "edited": "False", "id": "hvzl6gf", "is_submitter": "False", "link_id": "t3_smi0kk", "parent_id": "t1_hvz3ca4", "score": "5", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Looks awesome so far!", "created_utc": "1643851499.0", "edited": "False", "id": "hvcxbdr", "is_submitter": "False", "link_id": "t3_sg3i9e", "parent_id": "t3_sg3i9e", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Use an SRS to learn the most common words and then read some of your grammar book and then read graded readers.", "created_utc": "1643627500.0", "edited": "False", "id": "huzawit", "is_submitter": "False", "link_id": "t3_sgp1wu", "parent_id": "t3_sgp1wu", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Best vlogger for accurate subs! Also check out their podcast!", "created_utc": "1643020234.0", "edited": "1643059483.0", "id": "hu058s1", "is_submitter": "False", "link_id": "t3_satbi8", "parent_id": "t3_satbi8", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "If you check out CantoCaptions, I made matching Cantonese subtitles for the first two episodes. It's probably 100 times more useful than this video. I will be working on more.", "created_utc": "1643020146.0", "edited": "False", "id": "hu054s9", "is_submitter": "False", "link_id": "t3_sbhuvi", "parent_id": "t3_sbhuvi", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Jyutping is just a better version of Yale. First of all, the two systems are very similar so there aren't too many differences. It has coverage of more phonemes and is more consistent. Jyutping is easier to type on a keyboard because of the lack of weird accents. Jyutping is more concise because of the lack of h's. You can write yale with numbers too, which is better because of clarity. I think the romanization is more intuitive (possibly with the exception of j for the english y consonant), but this is simply a single phoneme in the system. If you are familiar with IPA, which is a really good idea, then this system is also more intuitive.", "created_utc": "1642642118.0", "edited": "False", "id": "htedp71", "is_submitter": "False", "link_id": "t3_s84vt6", "parent_id": "t3_s84vt6", "score": "15", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "https://cantowords.com/learn/", "created_utc": "1641893056.0", "edited": "False", "id": "hs6r4jk", "is_submitter": "False", "link_id": "t3_s1798r", "parent_id": "t3_s1798r", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I don’t think this is that good of a counterargument to using the above distinction because you shouldn’t be going up to someone and flaunting your languages anyways and very few people really do.", "created_utc": "1641716417.0", "edited": "False", "id": "hrw3hh4", "is_submitter": "False", "link_id": "t3_rzebvm", "parent_id": "t1_hrvthqm", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Well under my framework, so long as you learned 1 language to B2 or C1, you would be bilingual.", "created_utc": "1641706839.0", "edited": "False", "id": "hrvogiv", "is_submitter": "False", "link_id": "t3_rzebvm", "parent_id": "t1_hrvfzh8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I think it would be better if multilingual and polyglot were not identical terms. I propose using the -lingual terms for known languages in general. I think polyglot should be for only learned languages (i.e. native languages don’t count) because it is a term that is pretty much only used by learner communities to describe proficient learners. I think since multilingual starts at 3 and poly- prefix mostly implies 3+, then polyglot should be 3 learned languages to a B2+ level. Perhaps C1, I haven’t quite decided.", "created_utc": "1641693544.0", "edited": "1641706797.0", "id": "hruw8ep", "is_submitter": "False", "link_id": "t3_rzebvm", "parent_id": "t3_rzebvm", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Posting blatantly false statistics to make outlandish racism claim. 8k upvotes... yikes", "created_utc": "1641603072.0", "edited": "False", "id": "hrprzsl", "is_submitter": "False", "link_id": "t3_ryfssz", "parent_id": "t3_ryfssz", "score": "1", "subreddit": "MurderedByAOC", "subreddit_id": "t5_xkt2h"}, {"author": "tocayoinnominado", "body": "Do you mean more useful if it were the former, cause if so, then I agree.", "created_utc": "1641522989.0", "edited": "False", "id": "hrkzjcn", "is_submitter": "False", "link_id": "t3_rxtz96", "parent_id": "t1_hrkx4fk", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "With enough exposure you will be fine for the weirdness. For producing the language, it comes down to practice and feedback. I don’t there’s really anything special to it so don’t overthink it.", "created_utc": "1641331092.0", "edited": "False", "id": "hr9j5dj", "is_submitter": "False", "link_id": "t3_rvy4gm", "parent_id": "t3_rvy4gm", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Chinese is not a language :)", "created_utc": "1640296605.0", "edited": "False", "id": "hpqfilt", "is_submitter": "False", "link_id": "t3_rmsk3x", "parent_id": "t3_rmsk3x", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "“Por si aún no me había lastimado lo suficiente” = As if you still (i.e. up until this point after all of what came before) hadn’t hurt me enough.\n\npor si = in case, as if\n\naún = still\n\nlo suficiente = enough\n\nThe por si aún is not a set phrase. Try searching linguee for more examples of “por si” and “lo suficiente”", "created_utc": "1639900817.0", "edited": "False", "id": "hp5aha9", "is_submitter": "False", "link_id": "t3_rjo7al", "parent_id": "t3_rjo7al", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "IIRC his mom is a native English speaker and he wasn’t in turkey the whole time", "created_utc": "1639848684.0", "edited": "False", "id": "hp2hc9i", "is_submitter": "False", "link_id": "t3_rj42px", "parent_id": "t1_hp2drvg", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "The quality seems good and all of the entries and example sentences are colloquial Cantonese. The only issue is that it just doesn't have a ton of entries.", "created_utc": "1639646806.0", "edited": "False", "id": "horf9il", "is_submitter": "False", "link_id": "t3_rhiyno", "parent_id": "t3_rhiyno", "score": "5", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "DM'ed", "created_utc": "1638399163.0", "edited": "False", "id": "hmuwh5f", "is_submitter": "True", "link_id": "t3_q44vmg", "parent_id": "t1_hmhcapw", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Many, many graded readers here with audio, jyutping, and traditional characters: https://hambaanglaang.hk/", "created_utc": "1638068272.0", "edited": "False", "id": "hmcrng0", "is_submitter": "False", "link_id": "t3_r3tijh", "parent_id": "t3_r3tijh", "score": "10", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Coronate and crown are both perfectly acceptable.", "created_utc": "1637548876.0", "edited": "False", "id": "hllb6bj", "is_submitter": "False", "link_id": "t3_qz7fyz", "parent_id": "t1_hlkqmmk", "score": "11", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Look up every word provided it is an ebook.", "created_utc": "1636888520.0", "edited": "False", "id": "hkkqktg", "is_submitter": "False", "link_id": "t3_qtaibc", "parent_id": "t3_qtaibc", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "There aren’t any unfortunately :(", "created_utc": "1636767038.0", "edited": "False", "id": "hkemhn3", "is_submitter": "False", "link_id": "t3_qsotp9", "parent_id": "t3_qsotp9", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "There is no public info about the app yet other than that it’s in development. The features most certainly will be in line with the desktop functionality. I highly recommend supporting the patreon as it supports the development of both.", "created_utc": "1636749142.0", "edited": "False", "id": "hkdjlc0", "is_submitter": "False", "link_id": "t3_qrr0sw", "parent_id": "t1_hkcr7uv", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "You do realize development of Migaku Mobile is underway as we speak, right?", "created_utc": "1636684835.0", "edited": "False", "id": "hka8qze", "is_submitter": "False", "link_id": "t3_qrr0sw", "parent_id": "t1_hk9rxu8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Please let me know if they would be interested in doing transcripts. Also feel free to join the discord.", "created_utc": "1636135998.0", "edited": "False", "id": "hjg1tr3", "is_submitter": "True", "link_id": "t3_q44vmg", "parent_id": "t1_hjfsdo6", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "What I mean by context in this case is within the word. American flap only occurs with d and t in the middle of a word. It's a different ability to say it in initial or final position. Case in point, Americans can't pronunce spanish flap at beginning of words well nor, start words with ng, despite both existing in english in phonology in a general sense.", "created_utc": "1634794862.0", "edited": "False", "id": "hhgk24z", "is_submitter": "False", "link_id": "t3_q9m10b", "parent_id": "t1_hhg1pzb", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Right but if a sound appears only in a very speciifc context or a very specific dialect then that seems to be a gross misrepresentation of \"all but one sound are in English\". Appreciate the concession.", "created_utc": "1634503178.0", "edited": "False", "id": "hh1130y", "is_submitter": "False", "link_id": "t3_q9m10b", "parent_id": "t1_hh0reoe", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "1. is blatantly false. The tap/flap r, palatal fricative, the alveolo-palatal fricatives, and the e, o, and u vowels, to name some, are not in English", "created_utc": "1634487353.0", "edited": "False", "id": "hgzz1ia", "is_submitter": "False", "link_id": "t3_q9m10b", "parent_id": "t1_hgxkel3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "The Migaku Browser Extension can add jyutping and track known words for both SWC and Cantonese. It’s amazing. I will make a post about it in the future. It’s still in development but it had a patreon. It costs 5 bucks a month to access. Definitely worth it if you are serious about learning.", "created_utc": "1634459912.0", "edited": "False", "id": "hgyowrk", "is_submitter": "False", "link_id": "t3_q9i3qt", "parent_id": "t3_q9i3qt", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Transliteration is VERY different from word for word translation. Sounds like you mean the latter but you should clarify. Also doesn’t seem like a good methodology. Why not talk to a native cantonese speaker for a bit and record their mistakes? Then try to correlate their mistakes to Cantonese grammar patterns?", "created_utc": "1634344563.0", "edited": "False", "id": "hgt1bzw", "is_submitter": "False", "link_id": "t3_q90uql", "parent_id": "t3_q90uql", "score": "8", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "There are tools that exist that can allow you to play subs over for example netflix or youtube. For example, the Migaku Browser extension or Substital.", "created_utc": "1633743827.0", "edited": "False", "id": "hfxgwrb", "is_submitter": "True", "link_id": "t3_q44vmg", "parent_id": "t1_hfww9lf", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Yes, I wholeheartedly agree.", "created_utc": "1633739450.0", "edited": "False", "id": "hfx7ybq", "is_submitter": "True", "link_id": "t3_q44vmg", "parent_id": "t1_hfww9lf", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I just posted my project, CantoCaptions that has subs for some media.", "created_utc": "1633721437.0", "edited": "False", "id": "hfw3dth", "is_submitter": "False", "link_id": "t3_q3mg8r", "parent_id": "t3_q3mg8r", "score": "5", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "God it really is.", "created_utc": "1633561769.0", "edited": "False", "id": "hfnwppi", "is_submitter": "False", "link_id": "t3_q2a3t4", "parent_id": "t1_hfmutx0", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "tocayoinnominado", "body": "It used to be but they developed an account system that they are going to use for syncing which they decided to use for now to help with the piracy problem. There will be a free release though with almost all of the features available.", "created_utc": "1633539766.0", "edited": "False", "id": "hfmi1e3", "is_submitter": "False", "link_id": "t3_q2a3t4", "parent_id": "t1_hfljphz", "score": "1", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "tocayoinnominado", "body": "Migaku is what you are gonna want. Only 5 bucks a month.", "created_utc": "1633504071.0", "edited": "False", "id": "hfktf3y", "is_submitter": "False", "link_id": "t3_q2a3t4", "parent_id": "t3_q2a3t4", "score": "4", "subreddit": "Refold", "subreddit_id": "t5_3azein"}, {"author": "tocayoinnominado", "body": "Just some feedback: full canto subs would be even more helpful than the English for intermediate and above learners.", "created_utc": "1633482184.0", "edited": "False", "id": "hfjt6yk", "is_submitter": "False", "link_id": "t3_q1zj9z", "parent_id": "t3_q1zj9z", "score": "5", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "[https://unogs.com/title/70142405](https://unogs.com/title/70142405)  \n\n\nYou can check different countries where it may be available here. I can confirm it is available in Spain.", "created_utc": "1629736870.0", "edited": "False", "id": "ha1twto", "is_submitter": "False", "link_id": "t3_pa299w", "parent_id": "t3_pa299w", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "It’s word families, not just words.", "created_utc": "1629320097.0", "edited": "False", "id": "h9gavs3", "is_submitter": "False", "link_id": "t3_p6srk7", "parent_id": "t1_h9g1ti5", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I would say that contributing accurate soft subtitles would be the most impactful. Content creators, please provide more 粵文字幕!", "created_utc": "1625968905.0", "edited": "1625974463.0", "id": "h4rk86o", "is_submitter": "False", "link_id": "t3_ohtyx4", "parent_id": "t3_ohtyx4", "score": "12", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "What is your concern with the framing, out of curiosity?", "created_utc": "1625524684.0", "edited": "False", "id": "h46bz3a", "is_submitter": "False", "link_id": "t3_odp06a", "parent_id": "t1_h44s7mm", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Holy fuck this comment is pretentious. Just watch what you want in Spanish, make gains, explore media as it becomes enticing. You read so much into the fact of consuming non-native media it’s crazy. Being bad at a language is so painful. The goal should be get better in as fun a way as possible, and not force yourself to consume native content for the sake of it.\n\nEdit: To not be so negative, you normally are quite reasonable. I feel like you should reconsider this weird native-material only dogma.", "created_utc": "1625457124.0", "edited": "False", "id": "h43eboj", "is_submitter": "False", "link_id": "t3_odp06a", "parent_id": "t1_h41ypp1", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "That’s not actually different because progress here just means the time/effort that they have already spent. If you said an investor should not back out of an investment because they would lose their progress, you’d be committing the same fallacy.", "created_utc": "1621162187.0", "edited": "False", "id": "gyb8qsk", "is_submitter": "False", "link_id": "t3_ncz10s", "parent_id": "t1_gyaudsu", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "It absolutely would be a sunk cost fallacy. This fallacy revolves around the justification for continuing. If your justification for continuing to learn a language is that you have already spent 100 hours learning said language, then that is illogical because it is a forgone expenditure of time/effort that you cannot recover. Other factors should determine whether you pursue a given venture.", "created_utc": "1621144734.0", "edited": "False", "id": "gyapa8r", "is_submitter": "False", "link_id": "t3_ncz10s", "parent_id": "t1_gyab1vb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I’d strongly advise you to start learning characters. If not, it’s going to stagnate your learning down the line.", "created_utc": "1619661181.0", "edited": "1619662533.0", "id": "gw8x7du", "is_submitter": "False", "link_id": "t3_n0nybh", "parent_id": "t3_n0nybh", "score": "5", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Best iOS keyboard: https://apps.apple.com/us/app/%E7%B2%B5%E6%8B%BC%E8%BC%B8%E5%85%A5%E6%B3%95/id1509367629", "created_utc": "1618162307.0", "edited": "False", "id": "gu5yqib", "is_submitter": "False", "link_id": "t3_moulhp", "parent_id": "t3_moulhp", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Reading is the best tool for learning vocab. I would start learning to read right now.", "created_utc": "1618161992.0", "edited": "False", "id": "gu5y1gn", "is_submitter": "False", "link_id": "t3_mou47l", "parent_id": "t3_mou47l", "score": "5", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Np!", "created_utc": "1618005806.0", "edited": "False", "id": "gtzb4ba", "is_submitter": "True", "link_id": "t3_knfytj", "parent_id": "t1_gtz7ngt", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Read novels (ideally with lingq) and make flashcards in anki of sentences and vocab that appear in your books.", "created_utc": "1617475978.0", "edited": "False", "id": "gt9s1ms", "is_submitter": "False", "link_id": "t3_mjebgs", "parent_id": "t3_mjebgs", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "You have to login...", "created_utc": "1616548277.0", "edited": "False", "id": "grzy91j", "is_submitter": "False", "link_id": "t3_mbgnwl", "parent_id": "t3_mbgnwl", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Actually words.hk didn’t have an entry for 詛咒 until I made it. I put those readings based on what I saw. I made this poll to gather more info.", "created_utc": "1616083994.0", "edited": "False", "id": "grdlb0k", "is_submitter": "True", "link_id": "t3_m76gl2", "parent_id": "t1_grc2jwy", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Interesting. Thanks for your insight.", "created_utc": "1616044540.0", "edited": "False", "id": "grbmnai", "is_submitter": "True", "link_id": "t3_m76gl2", "parent_id": "t1_grblkoy", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I see. And never zo2 zau3?", "created_utc": "1616044524.0", "edited": "False", "id": "grbmmjl", "is_submitter": "True", "link_id": "t3_m76gl2", "parent_id": "t1_grbkomq", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "It was my understanding that some news will but now I'm less sure if they all do mix in some Cantonese.", "created_utc": "1616034438.0", "edited": "False", "id": "grb6j5x", "is_submitter": "False", "link_id": "t3_m7ekli", "parent_id": "t1_grb4qj3", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Yes, I mean they write following Mandarin conventions of grammar and vocabulary. As for what they have in their mind as they write, I don't know. Some news they will read what is essentially Mandarin with Cantonese pronunciation.", "created_utc": "1616032249.0", "edited": "1616033978.0", "id": "grb2e03", "is_submitter": "False", "link_id": "t3_m7ekli", "parent_id": "t1_grb0e41", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Yes, by me.", "created_utc": "1616028981.0", "edited": "False", "id": "graw2yj", "is_submitter": "False", "link_id": "t3_m7ekli", "parent_id": "t1_gravs47", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Your ignorance is forgiven. Perhaps someone else will go into more detail. In short, there is diglossia in Hong Kong. In formal situations, they write in Mandarin (Standard Written Chinese) and in informal situations like texting, they will write in actual Cantonese. Although there isn't a huge wealth of written content, there is enough for one to learn. The main issue is the lack of books to read.\n\nIf you want to get started, I would suggest this [book](https://drive.google.com/file/d/1X7C4-rkug4m_K9H2KTu2PV-Ow67k2YST/view?usp=sharing). You certainly don't need to know Mandarin to learn Cantonese, written or spoken.", "created_utc": "1616028109.0", "edited": "False", "id": "grauep5", "is_submitter": "False", "link_id": "t3_m7ekli", "parent_id": "t3_m7ekli", "score": "22", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "No problem! Thanks for the comment.", "created_utc": "1616015504.0", "edited": "False", "id": "gra5dnr", "is_submitter": "True", "link_id": "t3_m76gl2", "parent_id": "t1_gra44xj", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Given that you provide no information regarding for whom it is more difficult, your question presupposes that one language can be easier/harder than another in a vacuum, which is dubious.", "created_utc": "1615757052.0", "edited": "False", "id": "gqy2jcw", "is_submitter": "False", "link_id": "t3_m54ah2", "parent_id": "t3_m54ah2", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I love Jyutcit. This is so cool!", "created_utc": "1615137551.0", "edited": "False", "id": "gq43s0i", "is_submitter": "False", "link_id": "t3_lzszik", "parent_id": "t3_lzszik", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "https://drive.google.com/file/d/1X7C4-rkug4m_K9H2KTu2PV-Ow67k2YST/view?usp=sharing\n\nThis is one of the best learner resources.", "created_utc": "1615071458.0", "edited": "False", "id": "gq192i9", "is_submitter": "False", "link_id": "t3_lyw2ml", "parent_id": "t3_lyw2ml", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I'm glad more people are seeing it and appreciate it. It was a ton of work.", "created_utc": "1615011746.0", "edited": "False", "id": "gpvklct", "is_submitter": "False", "link_id": "t3_lwdtef", "parent_id": "t1_gpv7b6z", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "[https://drive.google.com/file/d/1X7C4-rkug4m\\_K9H2KTu2PV-Ow67k2YST/view?usp=sharing](https://drive.google.com/file/d/1X7C4-rkug4m_K9H2KTu2PV-Ow67k2YST/view?usp=sharing)\n\nYou should learn IPA and Jyutping. This book will get you started with learning characters for basic sentences. \n\nWikipedia has a very good article on [Jyutping](https://en.wikipedia.org/wiki/Jyutping)\n\nCantolounge has a cool interactive Jyutping [chart](https://cantolounge.com/jyutping-chart/)", "created_utc": "1614740514.0", "edited": "False", "id": "gphqtsw", "is_submitter": "False", "link_id": "t3_lwgbsd", "parent_id": "t3_lwgbsd", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "[https://drive.google.com/file/d/1X7C4-rkug4m\\_K9H2KTu2PV-Ow67k2YST/view?usp=sharing](https://drive.google.com/file/d/1X7C4-rkug4m_K9H2KTu2PV-Ow67k2YST/view?usp=sharing)\n\nThis is one of the best learner resources.", "created_utc": "1614740444.0", "edited": "False", "id": "gphqoev", "is_submitter": "False", "link_id": "t3_lwdtef", "parent_id": "t3_lwdtef", "score": "4", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I made it with the help of some proofreaders. It’s not official.", "created_utc": "1614679880.0", "edited": "False", "id": "gpefslz", "is_submitter": "False", "link_id": "t3_lvxgub", "parent_id": "t1_gpefoe9", "score": "7", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "https://drive.google.com/file/d/1X7C4-rkug4m_K9H2KTu2PV-Ow67k2YST/view?usp=sharing", "created_utc": "1614676255.0", "edited": "False", "id": "gpec7ws", "is_submitter": "False", "link_id": "t3_lvxgub", "parent_id": "t3_lvxgub", "score": "16", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "[https://unogs.com/search/avatar%20the%20last%20airbender?country\\_andorunique=or&start\\_year=1900&end\\_year=2021&end\\_rating=10&genrelist=&audio=Cantonese&audiosubtitle\\_andor=or&countrylist=21,23,26,29,33,307,45,39,327,331,334,265,337,336,269,267,357,378,65,67,392,268,402,408,412,447,348,270,73,34,425,432,46,78](https://unogs.com/search/avatar%20the%20last%20airbender?country_andorunique=or&start_year=1900&end_year=2021&end_rating=10&genrelist=&audio=Cantonese&audiosubtitle_andor=or&countrylist=21,23,26,29,33,307,45,39,327,331,334,265,337,336,269,267,357,378,65,67,392,268,402,408,412,447,348,270,73,34,425,432,46,78)\n\nThe above site indexes netflix shows to easily find available dubs and subs.  \n\n\nATLA is available in Cantonese in Argentina, Brazil, Hong Kong, Japan, Mexico, Singapore, Spain, Thailand, and Malaysia (I guess only the 1st season).", "created_utc": "1612078978.0", "edited": "False", "id": "glgl4m8", "is_submitter": "False", "link_id": "t3_l8khot", "parent_id": "t3_l8khot", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Granted I have a high level of Spanish, but I really don’t think it would be necessary. Just learn the bare basics of an English grammar book and read on lingq and you will be set. I just pretty much jumped into books really early on.", "created_utc": "1611645451.0", "edited": "False", "id": "gksva9y", "is_submitter": "False", "link_id": "t3_l519mb", "parent_id": "t3_l519mb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "That's awesome! Good luck", "created_utc": "1609660004.0", "edited": "False", "id": "ghx2oyk", "is_submitter": "True", "link_id": "t3_knfytj", "parent_id": "t1_ghva11p", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "No worries.", "created_utc": "1609389072.0", "edited": "False", "id": "ghkr43s", "is_submitter": "True", "link_id": "t3_knfytj", "parent_id": "t1_ghkqk7r", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Yes there are characters, however as far as I know they are not copy pasteable and the formatting and size of the characters leave a lot to be desired. This version puts the characters at the forefront with large, clear copypasteable text, as well as providing more info.", "created_utc": "1609388401.0", "edited": "False", "id": "ghkpz66", "is_submitter": "True", "link_id": "t3_knfytj", "parent_id": "t1_ghkmzom", "score": "5", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "More idiomatic translations would be:\n\nMy brain lagged\n\nI had a brain fart", "created_utc": "1608941777.0", "edited": "False", "id": "gh141dt", "is_submitter": "False", "link_id": "t3_kk6rwr", "parent_id": "t1_gh0soi7", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I was under the impression 俾 and 畀 were always interchangeable.\n\n[https://words.hk/zidin/v/10853/%E4%BF%BE/%E7%95%80](https://words.hk/zidin/v/10853/%E4%BF%BE/%E7%95%80)", "created_utc": "1604834031.0", "edited": "False", "id": "gbliy7p", "is_submitter": "False", "link_id": "t3_jq4m3s", "parent_id": "t1_gbl9med", "score": "6", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": " [https://disney.fandom.com/wiki/Disney%2B](https://disney.fandom.com/wiki/Disney%2B) \n\nOn this site if you ctrl + f for \"cantonese\" you will see all of the shows that have Cantonese audio on Disney+. There is not much.", "created_utc": "1602964821.0", "edited": "False", "id": "g94v1h5", "is_submitter": "False", "link_id": "t3_jcw2as", "parent_id": "t3_jcw2as", "score": "7", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "I think it's awesome that you want to contribute to Cantonese, but I'm trying to better understand the need that you're filling here. \n\nIf the goal is to be a dictionary, we already have [CantoDict](http://www.cantonese.sheik.co.uk/dictionary/) and [Words.hk](https://Words.hk) which are both extensive and growing user built dictionaries. It seems unlikely that this project will become a better dictionary than either of those. \n\nIf the purpose is just to be a flashcard review site, well we already have Anki which can do pretty much anything you want with flashcards.\n\nSo the only niche that I can see being filled is as a vocabulary list aggregator, which granted, isn't the most exciting thing in the world but could still be useful. If this was the identity of the site then I'd just try to integrate with existing dictionaries and integrate with anki. Have easy look ups and have lists that are ready to be ported to Anki.\n\nI guess I just don't see the reason to reinvent the wheel here.", "created_utc": "1602887070.0", "edited": "False", "id": "g91rb7t", "is_submitter": "False", "link_id": "t3_jceyri", "parent_id": "t3_jceyri", "score": "10", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "> I have been working on russian for a while but it's so slow. I know about 100 words and it's not too fun anymore. Russian wouldn't really be useful where I live anyways. But Spanish. There are so many Spanish speakers where I live and Spanish is easier to learn than Russian. I'm not sure if I should continue with russian or start Spanish. Help?\n\nEnjoy.", "created_utc": "1602117456.0", "edited": "False", "id": "g827ayh", "is_submitter": "False", "link_id": "t3_j6v7xh", "parent_id": "t1_g824bkz", "score": "18", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "You’re not going to learn either one, so I wouldn’t stress it too much.", "created_utc": "1602094087.0", "edited": "False", "id": "g80xtyu", "is_submitter": "False", "link_id": "t3_j6v7xh", "parent_id": "t3_j6v7xh", "score": "91", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "What's the source? I'm pretty sure d > ð is at least prevalent in Mexico, if not fairly universal in cases where there isn't elision, but I could be wrong.", "created_utc": "1601624525.0", "edited": "False", "id": "g7dp0vi", "is_submitter": "False", "link_id": "t3_j3n5ak", "parent_id": "t3_j3n5ak", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I think doing an intensive reading of the first book you read is incredibly powerful. After that, just do extensive reading.", "created_utc": "1600720090.0", "edited": "False", "id": "g657gv0", "is_submitter": "False", "link_id": "t3_ix7efd", "parent_id": "t3_ix7efd", "score": "4", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "So much this. I really don’t think that MASS immersion is that beneficial when you hardly know any words. At the very beginning it’s useful for exposure to the languages sounds, but that benefit drops off once you become able to parse them and are generally familiar with what sounds exist. Then, you just need to learn words. There will just be too little for you to notice. After that 2k-ish known words and a basic grammar foundation, the value of the immersion grows immensely.", "created_utc": "1600617230.0", "edited": "False", "id": "g5zqf68", "is_submitter": "False", "link_id": "t3_iw15lp", "parent_id": "t1_g5wu8nr", "score": "3", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "I'm currently watching Dragons: Rescue Riders on Netflix which I haven't seen anyone mention here before.", "created_utc": "1600576022.0", "edited": "False", "id": "g5xdovz", "is_submitter": "False", "link_id": "t3_ivthgf", "parent_id": "t3_ivthgf", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "From what I see, they are:\n\n或（waak6） 亦或（jik6 waak6）or  抑或 （jik1 waak6）\n\nIn an or question: 定（ding6）", "created_utc": "1600299205.0", "edited": "False", "id": "g5izld0", "is_submitter": "False", "link_id": "t3_itj4mh", "parent_id": "t1_g5f9lnu", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Are you a lawyer?", "created_utc": "1600252593.0", "edited": "False", "id": "g5givy4", "is_submitter": "False", "link_id": "t3_its4c9", "parent_id": "t1_g5ghifv", "score": "20", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "For isolated sentence reading practice you can use [Clozemaster](https://clozemaster.com). This would be a resource before breaking into full on reading.", "created_utc": "1600230232.0", "edited": "False", "id": "g5fvsyy", "is_submitter": "False", "link_id": "t3_it1fvt", "parent_id": "t3_it1fvt", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Do you have a source for “50% of unique words in a novel only appear once”? It seems super interesting. Not saying you made it up or anything.", "created_utc": "1599846989.0", "edited": "False", "id": "g4ugsaf", "is_submitter": "False", "link_id": "t3_iqk72v", "parent_id": "t1_g4sru9w", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "First one said something like “I don’t know why anki is so revered in this sub. I just use pen and paper and review words here and there. I’ve learned 5 languages this way.”\n\nSecond one is more hazy for me but said something like “I know this is the best way for me. People need to just sit down with a textbook and learn the old fashioned way. It’s much better than these other new apps like duolingo.”", "created_utc": "1599844795.0", "edited": "False", "id": "g4ucbne", "is_submitter": "False", "link_id": "t3_iq4dc4", "parent_id": "t1_g4t5kai", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "You literally can’t know that though. Nobody can really know that their method is most optimal. You could only compare it to other methods individually, but you haven’t even tried Anki and presumably other SRS’s, so how would you know that your way is easier or more efficient? Yes, I agree that textbooks have a place. My point is that saying you succeeded using one method so you don’t know why ppl would use another one (implying that there is no point for other approaches) is not logically sound.", "created_utc": "1599763580.0", "edited": "False", "id": "g4q4m4f", "is_submitter": "False", "link_id": "t3_iq4dc4", "parent_id": "t1_g4pskn1", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Have you ever considered that there could be an easier or more efficient way than what you did though? I mean people learned languages throughout history, but that doesn’t mean the new innovations and tools are pointless.", "created_utc": "1599760034.0", "edited": "False", "id": "g4prb5s", "is_submitter": "False", "link_id": "t3_iq4dc4", "parent_id": "t1_g4pfc55", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I think OP is not considering themselves as strictly speaking promoting MIA. I think your comment needs a bit more explanation as well. MIA would say that getting feedback from native speakers when you're really bad at the language is not going to save your accent because the sheer quantity of your mistakes are just too numerous to all point out and correct. Native speaker feedback is never a negative thing though and it is highly recommended to polish your accent when you are more proficient.", "created_utc": "1599642669.0", "edited": "False", "id": "g4j4ab6", "is_submitter": "False", "link_id": "t3_ip678h", "parent_id": "t1_g4ipszk", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "They’re just making valid points. It’s not overly aggressive, they’re just perplexed by your stance, as am I.", "created_utc": "1599568475.0", "edited": "False", "id": "g4foo8m", "is_submitter": "False", "link_id": "t3_ioe6cq", "parent_id": "t1_g4fd6ee", "score": "10", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "tocayoinnominado", "body": "“I'm not big on calling any methods garbage as long as it has helped you in some ways.”\n\nIf you take this to its logical conclusion it really doesn’t make any sense. You’re saying, as long as your derive some benefit from something no matter how marginal, it can’t be considered really bad? Some methods are objectively worse than others.", "created_utc": "1599568299.0", "edited": "1599568501.0", "id": "g4fofji", "is_submitter": "False", "link_id": "t3_ioe6cq", "parent_id": "t1_g4f872s", "score": "8", "subreddit": "languagelearningjerk", "subreddit_id": "t5_37rt5"}, {"author": "tocayoinnominado", "body": "It's going to be very hard to work on flow. The best thing you can do is try to better notice the flow of native speaker speech when you are consuming English content. Good luck!", "created_utc": "1599566270.0", "edited": "False", "id": "g4flu4x", "is_submitter": "False", "link_id": "t3_iopsck", "parent_id": "t1_g4fi55y", "score": "4", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "tocayoinnominado", "body": "Here is my feedback:\nhttps://voca.ro/16PHmmBRa19z\n\nAll feedback is based on my specific American accent.", "created_utc": "1599560609.0", "edited": "False", "id": "g4ffwrh", "is_submitter": "False", "link_id": "t3_iopsck", "parent_id": "t3_iopsck", "score": "8", "subreddit": "JudgeMyAccent", "subreddit_id": "t5_2ufiq"}, {"author": "tocayoinnominado", "body": "How is there no point? If you want to speak Cantonese you need to know the pronunciation of words...\n\nAlso, if you know the pronunciation of words you can type easily with a phonetic keyboard.", "created_utc": "1599524369.0", "edited": "False", "id": "g4e6ysb", "is_submitter": "False", "link_id": "t3_io94x9", "parent_id": "t1_g4cidov", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Ok so this really made me go learn and read more. In this documentary which is a collaboration from many linguists including Chomsky, they talk about error corrections lack of impact on language acquisition from 11:00-13:00. [https://www.youtube.com/watch?v=2htmI7-u1ng](https://www.youtube.com/watch?v=2htmI7-u1ng)\n\nI found a paper that talks about the consensus but it's from 1986. The paper itself seems to disagree with the consensus but because error correction's impact shouldn't be outright discounted as there are many issues with defining error correction (negative feedback) and measuring it. Paper:  [https://www.researchgate.net/publication/19417268\\_Feedback\\_to\\_first\\_language\\_learners\\_The\\_role\\_of\\_repetitions\\_and\\_clarification\\_questions](https://www.researchgate.net/publication/19417268_Feedback_to_first_language_learners_The_role_of_repetitions_and_clarification_questions)\n\n>The issue of whether negative feedback to agrammatical utterances plays any role in children’s early language development was for many years presumed settled on the basis of Brown and Hanlon’s findings (1970) that mothers neither provided responses of approval and disapproval differentially to well-formed and ill-formed child utterances, nor were more likely to produce ‘nonsequiturs’ (responses indicating mis- or non-comprehension) after ill-formed utterances. The conclusion that parental responses are unavailable to help children correct wrongly formulated rules or restrict overgeneralized rules has been incorporated into recent attempts to develop learnability models (Pinker, 1979, 1984; Wexler & Culicover, 1980) as well as into generally accepted assumptions about the helpfulness of parental input to children (see comment by Hakuta, 1984).  \n>  \n> In an attempt to replicate Brown and Hanlon’s study (1970), Hirsh-Pasek, Treiman, and Schneiderman (1984) confirmed the conclusions regarding explicit feedback, but suggested a different interpretation for implicit responses. They reported that adults are more likely to repeat ill-formed than well-formed utterances, at least in conversation with two-year-olds.   \n>  \n>If one starts from the position that children produce their utterances with an intent to communicate, arid therefore will interpret a failure or postponement of uptake as negative feedback, it is clear from our results and those of many others (Cherry, in press; Garvey, 1’379; Olsen-Fulero, 1’382) that a high proportion of maternal responses qualify as negative feedback. Our results indicate, furthermore, that these negative responses are more likely to follow ill-formed than well-formed child utterances. Thus, the axiom of learnability theory—that the model of the learner must be powerful enough to operate without negative feedback—seems ill-founded. The child does have available information that would help to identify ill-formed utterances in his or her own output.", "created_utc": "1599430161.0", "edited": "False", "id": "g49vexj", "is_submitter": "False", "link_id": "t3_in5ze3", "parent_id": "t1_g49f133", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Actually there are tons of studies that demonstrate just that. Children learn grammar that they are never taught, and make mistakes that are never heard. They often ignore the corrections of their parents for some time. There is tons of evidence (and I believe it is the linguistic scientific consensus) that error correction actually does not impact the speaking ability of native speakers. They learn from all of the input in their environment.", "created_utc": "1599414677.0", "edited": "False", "id": "g493eph", "is_submitter": "False", "link_id": "t3_in5ze3", "parent_id": "t1_g45frgb", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I really don't think there's anything you can or should do other than keep improving. I think it mostly comes down to you aren't good enough yet. I know you said 95% but it's very hard to assess comprehension ability and 95%, while seemingly high, is really not that great if you want to experience the language on a deeper level. I think it kind of comes down to the language just being so intuitive and so effortless that you spend less time processing the language itself and more time processing the content and impact of the language. \n\nI couldn't really experience what you're talking about for a very long time. It wasn't until I was incredibly comfortable in the language where my brain wouldn't have to work so analytically on decoding. Also, the better you get a language, the better your memory gets in that language perhaps for the same reason: your brain is more focused on recording the content. So both of these effects, in my opinion, stem from the same issue of language comfort/competence. Best of luck.", "created_utc": "1598345215.0", "edited": "False", "id": "g2s6cd2", "is_submitter": "False", "link_id": "t3_ig4tab", "parent_id": "t3_ig4tab", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "This kind of exists but as an Anki add-on. You can set forvo, google images, and dictionaries (as long as they are in the right format) and search them all and quickly use them to create anki cards. \nhttps://www.youtube.com/watch?v=iKldS0JLVR0\nhttps://massimmersionapproach.com/table-of-contents/anki/mia-dictionary/", "created_utc": "1597821250.0", "edited": "False", "id": "g22uvz1", "is_submitter": "False", "link_id": "t3_ic8txk", "parent_id": "t1_g21hokk", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I love MIA as much as the next guy, but you are mistaken here. Even Matt who went extremely hardcore was not C2 after 18 months lol. In fact he only just considered himself a low level fluent after 18-24 months. Or in his words “Ya you could consider me fluent, but I still mostly sucked.” So sure you can expect a low to mid-level fluency in Japanese after 18-24 months, but nowhere near mastery.", "created_utc": "1597773049.0", "edited": "False", "id": "g20dzko", "is_submitter": "False", "link_id": "t3_ic28rp", "parent_id": "t1_g1zxz0w", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "It sounds like you are familiar with the Mass Immersion Approach. I'm over 500 hours into studying Cantonese with that method. Get a Traditional RTH anki deck and do that. It's going to be just fine for you. Study the tones, and read this  [https://en.wikipedia.org/wiki/Written\\_Cantonese](https://en.wikipedia.org/wiki/Written_Cantonese). Learning basic vocab on memrise is fine, but I'd just import it to anki. You should absolutely learn how to use Anki. There is some incredible functionality with it and MIA add-ons that will make sentence mining a breeze. If you have more questions just pm me.", "created_utc": "1597632284.0", "edited": "False", "id": "g1ss0eg", "is_submitter": "False", "link_id": "t3_iac6zc", "parent_id": "t3_iac6zc", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "What do you mean it works with jyutping too? There is a lot of overlap between yale and jyutping so I guess it works with those, but where they differ it doesn't work.", "created_utc": "1597380892.0", "edited": "False", "id": "g1esx2t", "is_submitter": "True", "link_id": "t3_i8l1ws", "parent_id": "t1_g1dxdap", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Gboard uses Yale my dude. It also doesn't have tones.", "created_utc": "1597345952.0", "edited": "1597346454.0", "id": "g1cy9x6", "is_submitter": "True", "link_id": "t3_i8l1ws", "parent_id": "t1_g1b2xl1", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Oh yes, you're right. You can get a Standard Jyutping Keyboard on iOS, but it's more complicated.", "created_utc": "1597304212.0", "edited": "False", "id": "g1b12xr", "is_submitter": "True", "link_id": "t3_i8l1ws", "parent_id": "t1_g1azzy3", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "For macOS it's a very similar process. You download the mac version of Rime. There is a mac folder included in that zip file in the guide with the mac files you need. You move them to the Rime folder. You compile it. You should be able to use the windows guide to help you. Let me know if you need more help.\n\nFor iOS you can get a Standard Jyutping Keyboard but it's a bit trickier. I will make a guide in the future perhaps. You need to download iRime. I believe there is a guide but it's in Chinese. I got it to work but there was something that was not mentioned in the guide that you need to do. If you are interested just reply to this post and I will figure it out in the next few days.", "created_utc": "1597280725.0", "edited": "1597304615.0", "id": "g1a22s1", "is_submitter": "True", "link_id": "t3_i8l1ws", "parent_id": "t1_g19m8yi", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "But it doesn't have to be concrete. For both compliments or congratulatory remarks, I understand it that 多謝 would be most apt. Correct me if I'm wrong though.", "created_utc": "1597027633.0", "edited": "1597261539.0", "id": "g0yfzs2", "is_submitter": "False", "link_id": "t3_i5q0rh", "parent_id": "t1_g0rj6k7", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": " [https://massimmersionapproach.com/table-of-contents/stage-1/jp-quickstart-guide](https://massimmersionapproach.com/table-of-contents/stage-1/jp-quickstart-guide) apply it to Spanish", "created_utc": "1596511223.0", "edited": "False", "id": "g0ag285", "is_submitter": "False", "link_id": "t3_i3b4v7", "parent_id": "t3_i3b4v7", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "That’s an incredible ability that you now have that you don’t seem to appreciate. Inferring meaning IS learning. Eventually koinu will = puppy in your brain with no mnemonic needed.", "created_utc": "1596501954.0", "edited": "False", "id": "g09z6vc", "is_submitter": "False", "link_id": "t3_i342sg", "parent_id": "t1_g09fl6z", "score": "4", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "It seems like a rather large amount of ppl blindly follow the approach without understanding why certain aspects of it are the way they are.", "created_utc": "1596501845.0", "edited": "False", "id": "g09yzj4", "is_submitter": "False", "link_id": "t3_i342sg", "parent_id": "t1_g09rgr5", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "That’s interesting. So in what way you would you make them less tame? Do you have an example in mind?", "created_utc": "1596414500.0", "edited": "False", "id": "g05qi9c", "is_submitter": "False", "link_id": "t3_i287fb", "parent_id": "t1_g02zff1", "score": "1", "subreddit": "ajatt", "subreddit_id": "t5_dw44m"}, {"author": "tocayoinnominado", "body": "1. no\n2. copy the text from whatever list you find (find a list with copyable text)", "created_utc": "1596072939.0", "edited": "False", "id": "fzonnux", "is_submitter": "False", "link_id": "t3_hzzaio", "parent_id": "t1_fzo8oem", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "you just need to put the words into excel. Words that go on the front in the 1st column, and the matching definitions in the 2nd column, save as a csv and import. Need as many columns as fields and the exact order doesnt matter really because the import wizard will allow you to set whichever column to whichever field", "created_utc": "1596053512.0", "edited": "False", "id": "fznmbjv", "is_submitter": "False", "link_id": "t3_hzzaio", "parent_id": "t1_fzmwlmf", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "This is amazing, thank you! Do you have a text file of the transcript by chance?", "created_utc": "1595971523.0", "edited": "False", "id": "fzjzot3", "is_submitter": "False", "link_id": "t3_hxwue1", "parent_id": "t3_hxwue1", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Learn the 1000 most common words with Anki. If you actually make it through that then message me for more help.", "created_utc": "1595968115.0", "edited": "False", "id": "fzjsrsb", "is_submitter": "False", "link_id": "t3_hzksq6", "parent_id": "t3_hzksq6", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "You're awesome. Amazing beginning resource with jyutping, AND simplified & traditional characters.", "created_utc": "1595967860.0", "edited": "False", "id": "fzjs8wj", "is_submitter": "False", "link_id": "t3_hzb8vk", "parent_id": "t1_fzhuu7e", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "This analogy might seem like hyperbole, but it's so on point. Learning a language to a high level is a multi-year endeavor just as those pursuits are. You can't develop the required familiarity with all the ins and outs, phonetic and semantic nuances, cultural understandings, and everything in between in such a rushed manner. There isn't enough time in the day to make solid progress in so many languages at once.\n\nCounter-intuitively the fastest way is to do them one at a time. The more you study one of them in a single time frame will drastically increase the repetition of the words and grammar structures of that single language, with the increase in repetition allowing you even more opportunities for recognition, deciphering nuances, and ultimately learning them. As an aside, you cannot learn a word from isolated, rote memorization. Word knowledge is very deep: spelling, pronunciation, all of the different possible meanings, the nuances of all those meanings, the formality, the real-life contexts in which the word is used, collocations, evocations, synonyms, and on and on. Learning a 1 word translation is a tiny piece of the puzzle.", "created_utc": "1595926248.0", "edited": "False", "id": "fzhu7qv", "is_submitter": "False", "link_id": "t3_hz9fo8", "parent_id": "t1_fzhn87x", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "True but I think both ming and meng are possible but I think meng is prob more common. Edited", "created_utc": "1595913849.0", "edited": "False", "id": "fzhgxi3", "is_submitter": "False", "link_id": "t3_hymt55", "parent_id": "t1_fzh60e0", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Corrections:\n\n* Dictionaries have 哈囉 as haa1 lo2 or haa1 lo4, but I pretty sure at least haa1 lou2 is also said.\n* 早唞 is always zou2 t**a**u2\n* 你叫乜嘢名呀? should be nei5 giu3 mat1 je5 men**g2** aa3? and is more commonly and informally said as 你叫咩名？ (lei5 giu3 me1 meng**2**)", "created_utc": "1595892923.0", "edited": "1595913892.0", "id": "fzgiqiu", "is_submitter": "False", "link_id": "t3_hymt55", "parent_id": "t1_fzee8q5", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Completely false. Cantonese is very, very hard for English natives, but any language with enough written and spoken content can be learned on the internet to a high level.", "created_utc": "1595892058.0", "edited": "False", "id": "fzgh4h4", "is_submitter": "False", "link_id": "t3_hymt55", "parent_id": "t1_fze2w1q", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Khatz did not get fluent in 6 months lmfao.", "created_utc": "1595834460.0", "edited": "False", "id": "fzdscw5", "is_submitter": "False", "link_id": "t3_hxracm", "parent_id": "t1_fz8mhgf", "score": "36", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "There is. Remembering the Hanzi by James Heisig to name one.", "created_utc": "1595641529.0", "edited": "False", "id": "fz5lm2f", "is_submitter": "False", "link_id": "t3_hx1vyv", "parent_id": "t1_fz44rjy", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Very interesting follow up! That's a lot of vocab. So when did you start MIA? I started on March 1st.", "created_utc": "1595574599.0", "edited": "False", "id": "fz2go4u", "is_submitter": "False", "link_id": "t3_hw2jgn", "parent_id": "t1_fz24gpn", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "So my above layout is not what I did exactly. The above is just theorizing about a potentially more optimal route. I don't really know how much you want to know, since you're learning Mandarin and not Cantonese, right? But I'll go into detail. Personally I did the following:\n\n1. Learned 500 most common words from [here](https://docs.google.com/spreadsheets/d/1ArxEFo46PTrDyDDhWyu3wB0epxqTyd8WBaprnwTEPm4/edit#gid=1428902047) (it's not the best resource, but I made an anki deck out of the top 500 and it was ok, but at that point it got really hard for words to stick and I started mixing up characters, even though I had basic familiarity of 200 characters from studying mandarin a couple years ago)\n2. Production RTH ( I did all 1500 because I plan on studying Mandarin and Japanese and there is no Cantonese specific one. I think production helped greatly with differentiating characters. I learned readings of many of these by putting it on the front so I learned a fair number of words just from this)\n3. I didn't really do this step exactly as I already had 500 words plus PRTH vocab. I did make a deck from [this](https://www.memrise.com/course/726961/no-typing-essential-cantonese-vocabulary-audio/) Memrise course, which was kind of a pain but it was nice to have native audio. I ended up ignoring all but a select 200 or so words because almost all of it I felt I already knew or I didn't care to learn. I also had accrued about 200 words that I was able to notice from my immersion, so I put that into Anki too at this point.\n4. For the grammar resource it was rough because I used [this](https://books.google.com/books/about/Basic_Cantonese.html?id=I1B9TRmQi5gC) book. However, Cantonese: A Basic Grammar has a new version with actual characters, but since I'm cheap I just downloaded the old version and am manually adding characters, jyutping and reformatting it. Ideally you could just buy the new one and mine from there. I had already read through it once before, but now I'm rereading, adding characters, and mining from it at the same time that I do Clozemaster. Also I mine sentences from a server on discord where natives type in Cantonese lol. I think it's super engaging and fun.\n\nWith 2000 words known sentence mining should be really fun and easy in my experience, so definitely get started on that!", "created_utc": "1595558975.0", "edited": "False", "id": "fz1ugyf", "is_submitter": "False", "link_id": "t3_hw2jgn", "parent_id": "t1_fz1om8r", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "I think Clozemaster absolutely has a place here, but I don't use it as intended per se, I simply mine sentences from it. Imo the following should be the path of progression for Chinese and Japanese:  \n\n\n1. Learn 100-200 most common words\n2. RTK/RTH\n3. Learn 500-2000 most common words\n4. Sentence mine from basic grammar resource\n5. Sentence mine from Clozemaster (if no other sentence deck resource exists)\n\nI am studying Cantonese so the written resources are slim. I've been sentence mining from Clozemaster for the past couple weeks and it has been perfect for this purpose. I tried doing it earlier on as well and it was a bit frustrating and filled with frequent guessing because there were too many gaps. Now most sentences feel 1T or 2T, which is super fun and motivating.", "created_utc": "1595542770.0", "edited": "False", "id": "fz110q4", "is_submitter": "False", "link_id": "t3_hw2jgn", "parent_id": "t3_hw2jgn", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Ya I was going to comment this too. It's very jarring.", "created_utc": "1595221526.0", "edited": "False", "id": "fymq23j", "is_submitter": "False", "link_id": "t3_huegl3", "parent_id": "t1_fymo5b3", "score": "4", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Thanks for such an in-depth response, as I'm still not sure myself if it's a good idea or not, and I haven't tested it. I am only suggesting it for the backs of cards. I think you might be right that proactively adding them might be unnecessary or even detrimental, but I have a hard time seeing reactively adding this info as a downside. Anecdotally, it seems to help me when I take a step back and look at a group of similar characters and their meanings such as: 更, 梗, 硬, 便. I can better organize them in my head. Likewise, this was the case with similar words in Spanish like: incrustar, engarzar, encastrar, encajar, engastar.", "created_utc": "1595032106.0", "edited": "False", "id": "fyf0th2", "is_submitter": "True", "link_id": "t3_ht1tbt", "parent_id": "t1_fyesgpe", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "The keywords always tie to at least one of the meanings of the kanji.  [https://jisho.org/search/%E6%9B%B2%E3%81%8C%E3%82%8B](https://jisho.org/search/%E6%9B%B2%E3%81%8C%E3%82%8B)", "created_utc": "1595010310.0", "edited": "False", "id": "fydv22j", "is_submitter": "False", "link_id": "t3_hsvu1f", "parent_id": "t3_hsvu1f", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "The better you are at a language, the easier it is to memorize vocab. When you are starting out you have no mental framework (mental dictionary) to place this information or to draw connections to. You have to “build” it from the ground up. Right now everything is abstract and foreign, so it helps to make your own quirky mnemonics and connections to the words/characters.\n\nIn MIA you just delete words that are particularly tricky. You’ll learn it from immersion if it’s important anyways.", "created_utc": "1594543377.0", "edited": "False", "id": "fxt9quf", "is_submitter": "False", "link_id": "t3_hppf08", "parent_id": "t1_fxt7vl6", "score": "3", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Pretty interesting post here, albeit not surprising. Are you learning all of these at the same time? Also, what are your levels in all of them? Pretty interested in how you are tackling Cantonese as I'm learning it too. Did you get your sentences from Clozemaster?", "created_utc": "1594517889.0", "edited": "False", "id": "fxs6pw0", "is_submitter": "False", "link_id": "t3_hplibf", "parent_id": "t3_hplibf", "score": "8", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "That is not true. MIA always emphasizes immersion over anki. There is a recommended hard limit on anki of 2 hours that stands no matter your level. I don't know where you heard the idea that making sentence cards would account for 2/3 of your time as compared to immersion.", "created_utc": "1594517237.0", "edited": "False", "id": "fxs5lmd", "is_submitter": "False", "link_id": "t3_hp6jwk", "parent_id": "t1_fxriq77", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "You don’t just soak up language (at least to a significant degree) as an adult. You must put in effort. You must be attentive. You must try to notice your mistakes. And, you must actively focus on fixing your mistakes. It is a very long, arduous, and purposeful process. I have lived with non-native speakers going to university (who had lived here for 7+ years) and they could communicate quite comfortably. They made tons of pronunciation and grammar mistakes. They didn’t read books for fun or study vocab. They had tiny vocabularies compared to any native speaker. They watched English shows with subtitles. They did not make an effort to reach the next level, and so they did not reach that next level. People around you will not correct you if they can understand you more or less. You have to correct you. It doesn’t matter how long you live immersed in the language. These kinds of experiences demonstrate explicitly the difference between native language acquisition and second language acquisition.", "created_utc": "1594498174.0", "edited": "False", "id": "fxqmzjr", "is_submitter": "False", "link_id": "t3_hp8lky", "parent_id": "t3_hp8lky", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Ya I would say they are off the mark on what C1 means. C2 can be expected to have reasonable proficiency in these more obscure domains. There’s no way your average C1 speaker knows this much. A C2 speaker understands “virtually” everything so molar and page included, but  not a C1. I think a C1 speaker could write a scientific abstract for sure though.", "created_utc": "1594497612.0", "edited": "False", "id": "fxqkh9u", "is_submitter": "False", "link_id": "t3_hp8lky", "parent_id": "t1_fxqboyf", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "The last part of the translation sounds a bit awkward to my ears, but obviously it doesn’t change the concept you explained.\n\nAre your shoes new? No, they're old, but in mint condition.\n\nAre your shoes new? No, they're old, but look (brand) new.", "created_utc": "1594496711.0", "edited": "False", "id": "fxqgqhy", "is_submitter": "False", "link_id": "t3_hp8xs9", "parent_id": "t1_fxogzww", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "You need to save it as a CSV UTF-8", "created_utc": "1594429151.0", "edited": "False", "id": "fxl939t", "is_submitter": "False", "link_id": "t3_hnrqba", "parent_id": "t1_fxdzox3", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Listening is the hardest skill period. Absolutely start consuming Spanish without subtitles. I recommend you download the audio from what you watched with subtitles and listen to that when you have down time.", "created_utc": "1594044799.0", "edited": "False", "id": "fx3ml3e", "is_submitter": "False", "link_id": "t3_hm5ojr", "parent_id": "t1_fx3klia", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I’m just over 4 months into MIA for Cantonese, and recently my listening comprehension has shot up significantly and the amount of effort I have to put in to parse or hear sounds has decreased greatly. After only a month it was still absolutely pitiful, but I also barely knew any words at that time.", "created_utc": "1593970641.0", "edited": "False", "id": "fx0lpef", "is_submitter": "False", "link_id": "t3_hlhctg", "parent_id": "t3_hlhctg", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "I don't think you should strive to learn a particular number of languages like some checkoff list. Just learn languages that have compelling culture or media.", "created_utc": "1593841019.0", "edited": "False", "id": "fwvmseh", "is_submitter": "False", "link_id": "t3_hkx4qn", "parent_id": "t3_hkx4qn", "score": "36", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "It depends on your goals. If you want to just know a little Korean here or there, and a super basic general idea of the language then you can do that. If you want to speak and understand Korean to a high level, then you are going to need much more compelling reasons. Looks cool is pretty low on the list of compelling reasons. To reach this level you need 1000+ hours spent with the language. On top of that, once you reach a high level you aren't just done with Korean. You need to keep consuming Korean content and practicing to maintain your level. Depending on how high of a level you want to maintain, it may not be a ton of exposure, but it will be consistent exposure from here on out. So the question really becomes, is there content/media I find interesting enough to me or real life circumstances that make the language a useful enough tool that would make this pursuit worthwhile and fulfilling. If the answer is no, then maybe don't try to learn that language to a high level. Find some other language or pursuit that is more inline with your own tastes/interests.", "created_utc": "1593812853.0", "edited": "False", "id": "fwufzi2", "is_submitter": "False", "link_id": "t3_hkn8bu", "parent_id": "t3_hkn8bu", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "If they are quite unintelligible, then despite what most people would call a dialect, I would call a language regardless.", "created_utc": "1593812284.0", "edited": "False", "id": "fwuez13", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fwu7de3", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Sorry it was a little snarky. Right I should have said Standard Mandarin.", "created_utc": "1593812149.0", "edited": "False", "id": "fwueqjr", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fwt9w3a", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "> Are you saying mutually unintelligible enough with PTH?\n\nYes.\n\nOk I think I understand and agree with what you are saying. Topolects are a subdivision so they can't be considered a language, but rather part of the whole that is called a language. So I guess I will stick with the term language for mutually unintelligible lects/varieties and then you will be happy? Would you agree with the following?\n\n粵語 (Yueyu) = Cantonese language\n\n廣東話 (Guangdongwaa) = Cantonese topolect of the Guangdong Province\n   \n普通話 (Poutongwaa) = Mandarin language\n\n北京話 (Beijingwaa) = Mandarin topolect of Beijing", "created_utc": "1593759480.0", "edited": "False", "id": "fws6te7", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fws08pa", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Virtually every language is \"to some degree\" mutually intelligible with some other language, so that's really besides the point. The degree of intelligibility is what we care about. Obviously the exact cutoff as to what constitutes highly mutually intelligible versus somewhat mutually intelligible versus fairly mutually unintelligible is impossible to make concrete, but drawing distinctions between languages that are very dissimilar in many cases is fairly obvious and useful. I never claimed Beijinghua would be a language. In the comment right before this you mentioned Shanghaihua (which I'm not familiar with) and Guangdonghua (which I am familiar with) and I would consider the latter mutually unintelligible enough to warrant language status. Just for clarity, I think there are many languages and many dialects in China. I don't think that they are ALL separate languages. I don't understand how the word \"language\" is problematic in your second to last comment.", "created_utc": "1593751692.0", "edited": "False", "id": "fwrx4x8", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fwrpf7z", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "You prefer \"variety\" in those cases because they are tied to a city or region in the name?", "created_utc": "1593743157.0", "edited": "False", "id": "fwrk8an", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fwrjo9s", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Oh ok, I think we are just talking about different things. My problem is with referring to mutually unintelligible varieties of Chinese as dialects. If there exists a variety of Mandarin that is highly intelligible then I would call that a dialect of Mandarin, and if we are talking about a variety that is highly mutually unintelligible, then it should be called a language.", "created_utc": "1593742558.0", "edited": "False", "id": "fwrj9gu", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fwrg4ci", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I'm going to have to disagree with \"nonstandard\" as part of the potential classification. It has too much negative connotative weight and Hong Kong could easily have developed standards for Cantonese usage, circumstances permitting. You could go with variety, I suppose, but why not just language? Imagine calling Catalan a nonstandard variety of Spanish.", "created_utc": "1593736699.0", "edited": "False", "id": "fwr9sf0", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fwr10rf", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Very interesting insight. I just want to point out, as you are a linguistics student, that the term is \"dialectal\" and not \"dialectical.\"", "created_utc": "1593725776.0", "edited": "False", "id": "fwqpzu2", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fwqg98b", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Yes, absolutely. The term should be Chinese languages or topolects, but NOT dialects. There are dialects that exist of these languages/topolects. It's quite annoying that they have all been lumped together as Chinese or Mandarin plus dialects.\n\nEdit: A very interesting paper discussing this issue can be found [here](http://www.sino-platonic.org/complete/spp029_chinese_dialect.pdf).\n\nQuotes from the article:\n> First of all, the vast majority of Chinese languages have never received a written form. Mandarin, Fuchow, Cantonese, Shanghai, Suchow, and the other major fangyan do not share the same written language. I have seen scattered materials written in these different Chinese fangyan, both in tetragraphs and in romanized transcription, and it is safe to say that they barely resemble each other at all. Certainly they are no closer to each other than Dutch is to English or Italian to Spanish. The discrepancies between the major Chinese fangyan in phonology, lexicon, orthography, and grammar are so great that it is impossible for a reader of one of them to make much sense of materials written in another of them. This is an entirely different matter from that of classical (wenyan), vernacular (baihua), and mixed classical-vernacular (banwen-banbai) prestige, non-local or national written styles that are read by literate individuals throughout China according to the pronunciation of their local fangyan. Written Sinitic, with exceedingly few exceptions, has been restricted to some type of Classical Chinese or Mandarin, since the other languages of the group have never developed orthographical conventions that were recognized by a substantial segment of their speakers. In sum, regardless of the fact that such statements are almost universally accepted among Western treatments of Chinese language(s), it is false (or at least dangerously misleading) to claim that all the Chinese \"dialects\" share the same written language. It is also frequently asserted that, while there may be enormous differences in vocabulary, pronunciation, and idiom among the major spoken Chinese fangyan, they basically share the same grammar. This assumption, too, remains to be proven, both in absolute and in comparative terms.\n\n> My only plea is for consistency in English linguistic usage. If we call Swedish and German or Marathi and Bengali separate languages, then I believe that we have no choice but to refer to Mandarin and Cantonese as two different languages. At the very least, if diplomatic or other considerations prevent us from making such an overt statement, we should refer to the major fangyan as \"forms\" or \"varieties\" of Chinese instead of as \"dialects\".", "created_utc": "1593725279.0", "edited": "1593726127.0", "id": "fwqp04t", "is_submitter": "False", "link_id": "t3_hk1lat", "parent_id": "t1_fwq8y2j", "score": "43", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I'm pretty sure you mean the movie Rio and I just looked it up and even the trailer for the second movie has Cantonese subs. Super surprising!\n\nRio 2 Trailer link:  [https://www.youtube.com/watch?v=qXS9fObC\\_ps](https://www.youtube.com/watch?v=qXS9fObC_ps) \n\nSearch query link that pulls up multiple Rio Cantonese dubbed videos: [https://www.youtube.com/results?search\\_query=%E5%A5%87%E9%B8%9A%E5%98%89%E5%B9%B4%E8%8F%AF+%E9%A6%99%E6%B8%AF%E7%B2%B5%E8%AA%9E](https://www.youtube.com/results?search_query=%E5%A5%87%E9%B8%9A%E5%98%89%E5%B9%B4%E8%8F%AF+%E9%A6%99%E6%B8%AF%E7%B2%B5%E8%AA%9E)", "created_utc": "1593412083.0", "edited": "False", "id": "fwcdsbr", "is_submitter": "False", "link_id": "t3_hhnd86", "parent_id": "t1_fwbil1b", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Cantonese subtitles, especially soft subtitles so that they can be downloaded.", "created_utc": "1593411662.0", "edited": "False", "id": "fwcdbya", "is_submitter": "False", "link_id": "t3_hhh2jh", "parent_id": "t3_hhh2jh", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Effective:\n\n* SRS for vocabulary\n* Reading and listening should be the primary focus until high comprehension\n* Spending hundreds to thousands of hours engaging with native content\n* Be attentive\n\nIneffective:\n\n* Not study long enough (<1 hour a day for Japanese)\n* Drilling set phrases and conjugations\n* Spending too much time with grammar rules in general\n* Practicing speaking as a beginner", "created_utc": "1593393484.0", "edited": "False", "id": "fwbnbjn", "is_submitter": "False", "link_id": "t3_hh8rs5", "parent_id": "t1_fwbfgal", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Blaming lack of talent or intellect is such a cop out. The idea that they are comparable to the time spent with the language is patently absurd. Almost certainly a lack of quality time engaged with the language and inefficient methods are the root of your failures.", "created_utc": "1593336459.0", "edited": "False", "id": "fw92r6p", "is_submitter": "False", "link_id": "t3_hh8rs5", "parent_id": "t1_fw8ov0v", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I do kind of agree with you, but he has 4 months. 4 months of intensive MIA and he would be well above B1. I think you're right though that this should be supplemented with traditional grammar textbook study and writing practice to prepare for the exam.", "created_utc": "1593022108.0", "edited": "False", "id": "fvvi8v7", "is_submitter": "False", "link_id": "t3_hepmze", "parent_id": "t1_fvuuggt", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "https://massimmersionapproach.com/table-of-contents/stage-1/jp-quickstart-guide/\n\nApply the principles to Italian.", "created_utc": "1592955589.0", "edited": "False", "id": "fvspy5w", "is_submitter": "False", "link_id": "t3_hepmze", "parent_id": "t3_hepmze", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "No, the MIA Japanese add-on has been released to the public, but the MIA Chinese just came out, so you will have to wait a few months for it to become free or join the Patreon. [Here](https://www.youtube.com/watch?v=Wn60ysJxBXQ) is a video about it. MIA dictionary add-on is also publicly available and it is not language specific. You can add dictionaries for any language as long as it exists and you can get it into the right format. I made Cantonese compatible dictionaries that you can find [here](https://www.reddit.com/r/MassImmersionApproach/comments/hbniov/compatible_cantonese_mia_dictionaries_and/).\n\nI think the ideal listening material is personally engaging, highly visually interesting, at least somewhat comprehensible, well-known to you, and repetitive (similar ongoing narrative). I watch dubbed anime that I have already seen as this checks all the boxes. Also it's good to be able to watch a variety of things to avoid burnout and boredom. I supplement this with dramas, movies, and a smattering of youtube videos. I haven't been listening to any traditionally beginner material oriented material, but that doesn't mean it can't be good. I am going to try to listen to some kid shows in the near future to see how it feels. However, I think drilling pronunciation is counterproductive at this point.", "created_utc": "1592892180.0", "edited": "False", "id": "fvpuhpy", "is_submitter": "False", "link_id": "t3_hdraea", "parent_id": "t1_fvpt526", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Check out the MIA Chinese add-on [here](https://www.youtube.com/watch?v=Wn60ysJxBXQ). It can automatically add jyutping readings and color code based on tone. You have to be a patron on Patreon for now, or you could wait a couple months and get it for free. The MIA Dictionary add-on is also really cool and I made compatible Cantonese dictionaries for it found [here](https://www.reddit.com/r/MassImmersionApproach/comments/hbniov/compatible_cantonese_mia_dictionaries_and/).\n\nAs for other resources, I think Clozemaster has a really good selection of Cantonese sentences that you can sentence mine.", "created_utc": "1592881922.0", "edited": "False", "id": "fvpg27j", "is_submitter": "False", "link_id": "t3_hdo1j4", "parent_id": "t3_hdo1j4", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "* Join the MIA Patreon (5 bucks).\n* Get the MIA Chinese Anki Add-on.\n* Automatically add jyutping readings and color code characters based on tone.\n* Stop trying to practice pronunciation and just listen more.", "created_utc": "1592874641.0", "edited": "False", "id": "fvp3s31", "is_submitter": "False", "link_id": "t3_hdraea", "parent_id": "t3_hdraea", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "As long as you use it as an e-reader it can be quite powerful, especially for popular languages and latin-alphabet languages. It really could be so much better and cleaner too, so it’s a little frustrating that it hasn’t improved more and a bit pricey.", "created_utc": "1592770873.0", "edited": "False", "id": "fvkirpa", "is_submitter": "False", "link_id": "t3_hdc9fp", "parent_id": "t3_hdc9fp", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "TL = Target language", "created_utc": "1592770501.0", "edited": "False", "id": "fvki3kd", "is_submitter": "False", "link_id": "t3_hdc9fp", "parent_id": "t1_fvkaxz8", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "So your post tackles 2 issues:\n\n1. Why is reading highly emphasized?\n2. Why is so much time spent with incomprehensible input?\n\nIn the MIA, and even in the very last Q&A, Matt asserts that reading is for learning the bulk of new words, while listening is for developing that instant auditory recognition. In my opinion and experience, it's much easier to learn new words through reading for a few reasons. Firstly, you actually have time to think about the sentence and how the components work inside of it, so it's easier to really look at the parts of speech and think about word order and separate words and phrases and whatnot. Also, it's much easier to pick out the unknown component because it is written for you, whereas when listening, the listener has to figure out what was said. Both of these difficulties are going to be compounded at the beginning of the process with even less knowledge to fill gaps. I would argue that the amount of repetitions to learn a word from pure listening is a lot higher on average than for reading a word. So why emphasize reading? Well you learn words more quickly, which makes your immersion more comprehensible more quickly, and leads to more 1 target sentences.\n\nI actually agree with your second critique and it follows logically from the conclusion above. In my experience, the benefits of completely incomprehensible immersion is limited to perhaps the first month or less. You can still learn words from it, but the pace is actually quite slow. I really couldn't stomach it so I learned the 500 most common Cantonese words, and then did RTH. Those words were definitely starting to get hard to remember in the 400-500 range, so I still think RTH is valuable. Either way, brute forcing a small number of super frequent words without RTH/RTK absolutely seems worth it from an efficiency and from an enjoyment stance. Those first few months of immersion will be orders of magnitude more valuable even with such a small vocab base. I think the MIA counterargument is that these words are so frequent that they will be learned the easiest. In my experience, this isn't exactly the case because of the difficulty of learning from audio mentioned in the first answer. It's very hard to isolate those common words without any or very limited grammar knowledge and limited phonetic intuition of how words blend. On top of that, these words tend to be the most meaning dense and have the most diverse ranges of usage. As a result, even these super common words can take a long time to learn, and these words are the cornerstone for making anything comprehensible, which slows everything down and not to mention a big hit to motivation.", "created_utc": "1592730156.0", "edited": "False", "id": "fviukrd", "is_submitter": "False", "link_id": "t3_hd1nzm", "parent_id": "t3_hd1nzm", "score": "8", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "No problem! I hope the MIA dictionary addon will be even more useful by then.", "created_utc": "1592519183.0", "edited": "False", "id": "fva1cgr", "is_submitter": "True", "link_id": "t3_hbniov", "parent_id": "t1_fva0nv4", "score": "3", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": ">English is not my native language, and, although I consider myself fluent, my English is nowhere near that of a native speaker who has went to university.\n\nActually you are completely right and I would go further and say that that in this sentence the overuse of *English* is a mistake:\n\n\"English is not my native language, and, although I consider myself fluent, ~~my English~~ **it** is nowhere near that of a native speaker who has gone to university\"\n\nEdit: simple past back to present perfect", "created_utc": "1592024067.0", "edited": "1592359726.0", "id": "fuobkv4", "is_submitter": "False", "link_id": "t3_h7s5gc", "parent_id": "t1_fuo9ysb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "\"Have went\" should be \"have gone\", but other than that there are no mistakes.", "created_utc": "1592000465.0", "edited": "False", "id": "fun9h5g", "is_submitter": "False", "link_id": "t3_h7s5gc", "parent_id": "t1_fun6atk", "score": "25", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Are you a patron on patreon?\n\nEdit: He talks about it in a video called \"We're Discontinuing the Perfectionist Path.\" Here's some quotes from the video.\n\n>14:56  \n>  \n>And so, I guess that me and Yoga just realized that really the true perfectionist path would be you put off speaking and reading and listening to anyone but your parent, for maybe like the first year or maybe even 2.  \n>  \n>15:27  \n>  \n>That's kind of just ludicrous. It's insane. It's not going to be worth it. You will probably end up sounding a little bit better because you'll have more consistent speech and your baseline level of speaking the language when you know your tired and all that will still be natural instead of some other weird way and it will take less effort for you to speak in a natural way, but how *much* better is that going to be than my Japanese?", "created_utc": "1591836399.0", "edited": "1591838439.0", "id": "ftn964e", "is_submitter": "False", "link_id": "t3_gzp0ey", "parent_id": "t1_ftk9quo", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Any chance you could make your wordreference script grab audio? Awesome video and progress.", "created_utc": "1591812844.0", "edited": "False", "id": "ftlxeia", "is_submitter": "False", "link_id": "t3_h0d6aa", "parent_id": "t3_h0d6aa", "score": "4", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "They don't release dates on principle, so we are going to just have to be in the dark. I'm optimistic that it will be released within the next 2 months because it seems like this has been in development since the start of 2020 or so, but that's probably me just being hopeful.", "created_utc": "1591766811.0", "edited": "False", "id": "ftk2bx8", "is_submitter": "False", "link_id": "t3_gzzrif", "parent_id": "t1_ftk1y8m", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "MIA is built on theory and anecdote, not research. Research is going to be a long ways off and studying this kind of thing is going to be very difficult to do well, so really the first 2 things is all we have to go on. Most language learning studies are garbage because of the difficulty involved and misguided preconceived notions.", "created_utc": "1591766139.0", "edited": "False", "id": "ftk1fx1", "is_submitter": "False", "link_id": "t3_gz50ox", "parent_id": "t3_gz50ox", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "They're not going to waste their time with that because they are currently working on completely revamping the website.", "created_utc": "1591765212.0", "edited": "False", "id": "ftk07co", "is_submitter": "False", "link_id": "t3_gzzrif", "parent_id": "t3_gzzrif", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Ok let me be clearer. There's 2 things we are talking about here. \n\n1. The way to achieve theoretically the best, most native-like ability possible\n2. The way to achieve a very good level in an efficient amount of time \n\nMatt does not recommend attempting #1. Matt recommends doing the more balanced approach where you still get good. However, they theorize that if the first approach was your goal, then you would in that scenario not do anything but listen to the same 1 or 2 people for 1-2 years before doing anything else. As for the balanced approach, I think they recommend more listening at the beginning, but phasing into 50:50. I hope that makes more sense.", "created_utc": "1591765050.0", "edited": "False", "id": "ftjzzhu", "is_submitter": "False", "link_id": "t3_gzp0ey", "parent_id": "t1_ftjt6if", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Source for which thing? Let me be clear: Matt does not recommend the no-reading thing. That is just theorized as being best in order to achieve the best possible accent. Listening very quickly trails reading ability, which does not conflict with any of the above.", "created_utc": "1591759505.0", "edited": "False", "id": "ftjrrm0", "is_submitter": "False", "link_id": "t3_gzp0ey", "parent_id": "t1_ftjpz55", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Yes", "created_utc": "1591754021.0", "edited": "False", "id": "ftjijth", "is_submitter": "False", "link_id": "t3_gzp0ey", "parent_id": "t1_ftjdg00", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Wow what a behemoth of a post. Very well done. I think you should clarify for learners the meaning of \"Tu mamá está buena\" instead of just going the humor route. I'm kind of curious about the es/está claro distinction. For me, \"está claro que\" sounds more natural, but I never thought of that as an exception to the usual structure. I'm not saying es claro is wrong or anything, but I wonder how common that is. I think the biggest gem in all of this is looking at estar as describing a \"circumstantial state\" which to me seems clear, explanatory, and concise.", "created_utc": "1591740536.0", "edited": "False", "id": "ftiu9pf", "is_submitter": "False", "link_id": "t3_gzwi0s", "parent_id": "t3_gzwi0s", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Definitely", "created_utc": "1591736033.0", "edited": "False", "id": "ftil627", "is_submitter": "False", "link_id": "t3_gzhxiw", "parent_id": "t1_fthym62", "score": "1", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "Maybe clear in isolation, but in native speech it's not very clear for most learners.", "created_utc": "1591724323.0", "edited": "False", "id": "fthwkdj", "is_submitter": "False", "link_id": "t3_gzhxiw", "parent_id": "t1_ftgzzjl", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "For the best results, MIA proposes the idea that learning completely without reading (and simply listening to the same native speaker), however that is just a theory and nobody has actually done that yet. So, they don’t recommend that because there are diminishing returns to holding off on reading just like there are diminishing returns to holding off on speaking. You want to find a balance. Holding off reading for 6 months sounds brutal for most people, but if you really care about your accent, the longer the better.", "created_utc": "1591720876.0", "edited": "1591754034.0", "id": "fthp867", "is_submitter": "False", "link_id": "t3_gzp0ey", "parent_id": "t1_fthl211", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "The second tone is a higher pitch than the fifth tone, otherwise, for all intents and purposes they are the same. That being said, just knowing that is not going to allow you to hear the difference. I can almost never hear the difference. You can listen to them in isolation here:  [https://cantolounge.com/jyutping-chart/](https://cantolounge.com/jyutping-chart/) . I'm not sure how important it really is to distinguish though in all honesty. From my limited experience so far, it seems that from context you would almost never be confused about a word. I've only been learning for 3 months though, so take that with a very large grain of salt. If you want to be really good at listening it's going to take 500+ hours at least.", "created_utc": "1591687378.0", "edited": "False", "id": "ftgdhup", "is_submitter": "False", "link_id": "t3_gzhxiw", "parent_id": "t3_gzhxiw", "score": "3", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "[https://massimmersionapproach.com/table-of-contents/stage-1/jp-quickstart-guide](https://massimmersionapproach.com/table-of-contents/stage-1/jp-quickstart-guide)\n\nI know you are not learning Japanese, but don't let the name fool you. You should read through this and apply the principles to Spanish.", "created_utc": "1591686914.0", "edited": "False", "id": "ftgczod", "is_submitter": "False", "link_id": "t3_gzfv6y", "parent_id": "t3_gzfv6y", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I hope this is a meme lmao.", "created_utc": "1591642952.0", "edited": "False", "id": "fteb7ab", "is_submitter": "False", "link_id": "t3_gz4kup", "parent_id": "t3_gz4kup", "score": "14", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Ok, but even if we're just talking about the spoken language, this 99.9% figure is just way too high as a bar for general fluency. 99% and 99.9% may sound close but those are astronomically different numbers of words known. 98 > 99 is roughly a doubling in the number of words required.", "created_utc": "1591496091.0", "edited": "False", "id": "ft897nd", "is_submitter": "False", "link_id": "t3_gxtv6b", "parent_id": "t1_ft809os", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I don't really understand. How would you quantify comprehension in a general sense?", "created_utc": "1591485727.0", "edited": "False", "id": "ft7koz1", "is_submitter": "False", "link_id": "t3_gxtv6b", "parent_id": "t1_ft6onvx", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I know you probably just chose those numbers at random, but they are pretty off in my opinion. You are saying that “I understand x language” implies there’s only 1 word out of every 100 that you don’t know? That’s pretty steep. 2 words out if every 100 missing and I’d still say that person can generally understand the language and I would go lower than that. For fluency, your number seems even more outlandish. To get to the point of understanding 99.9% (999/1000) words is going to be domain specific. There are going to be many domains where native speakers don’t even meet this criteria, such as almost any adult novel. I’m pretty sure I checked this with Lingq, and my comprehension was 99.5% of the last fiction novel I read in English (my native language). So 1. you need to clarify what kind of domain you are talking about and 2. 99.9% is an absurdly high bar for fluency regardless of the domain.", "created_utc": "1591476347.0", "edited": "False", "id": "ft6nk7m", "is_submitter": "False", "link_id": "t3_gxtv6b", "parent_id": "t1_ft5dl6z", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Just keep practicing, reading, and listening! Suerte", "created_utc": "1591421035.0", "edited": "False", "id": "ft2ac62", "is_submitter": "False", "link_id": "t3_gxi0u5", "parent_id": "t1_ft25wr3", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": " Su ingl**é**s **es** muy bueno :) **Todo el mundo** dice que su ingl**é**s no **es** bueno *(I would probably say something like \"Todo el mundo dice que habla mal el inglés\")* pero yo nunca veo **un** problema. ¡Es para **practicar**! *(para práctica sounded unnatural to me but I could be wrong)* Yo soy de los **E**stados **U**nidos **y** **p**ienso que m**i** español es ho**r**rible, pero tambi**é**n estoy aprendiendo :))", "created_utc": "1591418618.0", "edited": "False", "id": "ft25pbu", "is_submitter": "False", "link_id": "t3_gxi0u5", "parent_id": "t1_ft24evk", "score": "9", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Pretty surprised nobody answered your question. Reading = the pronunciation of the character. So your example is correct there.", "created_utc": "1591387383.0", "edited": "False", "id": "ft0aimq", "is_submitter": "False", "link_id": "t3_gx2qcr", "parent_id": "t1_ft05met", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I’m pretty sure I could find a reference, but just think about it logically. Assuming you know the writing system, the reading will always be easier because you do not have to figure out what is being said (the exact utterance is transcribed so no confusion can arise in this regard) and you can go at your own speed (there is no time limit to understand). Speech can have some benefits to comprehension like inflection of the words can make a certain meaning clearer, but speech can also be muttered, garbled, rephrased, go off on sudden tangents, and simply contain errors that can add to the difficulty of deciphering the message. Anecdotally, I myself and pretty much everyone I know or have seen online also confirms this. I literally don’t think I could think of someone that would say reading is overall harder than listening unless we are talking about someone that doesn’t know how to read at all. Even for Chinese languages, you can learn the writing system much faster than you can become proficient in listening.", "created_utc": "1591119220.0", "edited": "False", "id": "fsnm8j6", "is_submitter": "False", "link_id": "t3_gud4de", "parent_id": "t1_fsmsraw", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "This is really flawed logic and simply not true. A test has no bearing on how much time you should put into each skill. They could be tested within the same time frame, but how does that relate in any way to how long those skills take to develop? As it turns out, you are much better off reading and listening for a much greater percentage of your time, as they are the drivers of language acquisition. Listening takes far, far longer to improve than any of the other skills. Speaking practice should be avoided early on in the process for optimal results.", "created_utc": "1590993696.0", "edited": "False", "id": "fsi4fm9", "is_submitter": "False", "link_id": "t3_gud4de", "parent_id": "t1_fshtmsy", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Proficient American university students in Chinese and Japanese would be quite shocking to me too. Do you have a high level in those languages? It is extremely hard to accurately perceive proficiency without being at least quite close to the level of the person being rated. I have pretty extensive experience in Spanish classrooms, and I can say that even the best speakers were pretty bad. Mind you they could manage the homework and assignments fine. The actual pronunciation and oral competence was horrendous. The only good ones were the native speakers. I know you say to discount the JLPT for now, but I would just like to say that it is absolutely not a good marker of language proficiency. I really, really don't think GE's are the underlying reason for American language classroom shortcomings. It's simply due to a lack of input and forcing output.", "created_utc": "1590783654.0", "edited": "False", "id": "fs8jjaj", "is_submitter": "False", "link_id": "t3_gsv5ff", "parent_id": "t1_fs8gcmb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "&#x200B;\n\n>In this context, many foreign language professionals are revisiting language gain studies to reconsider the connections between curricula and learning outcomes. Carroll’s (1967) study of the language proﬁciency of university seniors with foreign language majors is perhaps the most signiﬁcant work in this area because it was the ﬁrst major study of its kind and because Carroll tested 2,784 students in French, German, Italian, Russian, and Spanish in listening, speaking, reading, and writing (Form A of the Modern Language Association \\[MLA\\] Foreign Language Proﬁciency Tests for Teachers and Advanced Students). Carroll reported that seniors were attaining advanced-high (ILR 2+) levels in speaking and listening and found this “disturbing”: “The most striking thing about these charts is the generally low median levels of attainment ...they reveal” (pp. 140, 134). If Carroll was disturbed by a mean learning outcome of advanced-high, one can only imagine how he would react to the results observed by Magnan (1986), Brecht, Davidson, and Ginsburg (1993), Tschirner (1996), Thompson (1996), and Davidson (1998, 2002, 2003), or the reported ﬁndings of the Defense Language Institute (Omaggio-Hadley, 2001) and the Foreign Service Institute (Jackson & Kaplan, 2001). Magnan found that the average oral proﬁciency level of university students in 4th-year French was advanced (not advanced-high, as Carroll had found). Magnan’s ﬁndings for the lower levels in French (intermediate-low and intermediate-mid for 1st- and 2nd-year French, respectively) were conﬁrmed by Tschirner (1996) who studied oral proﬁciency levels of students of German in the ﬁrst 4 semesters of a university German curriculum.\n\n [https://onlinelibrary.wiley.com/doi/epdf/10.1111/j.0026-7902.2005.00262.x](https://onlinelibrary.wiley.com/doi/epdf/10.1111/j.0026-7902.2005.00262.x) \n\nThese terms of Advanced or Advanced-High sound good, but can be misleading if you actually look at the 1986 ACTFL proficiency guidelines. They are not high levels. Also, these are university majors and other people focused on learning the language, presumably motivated and highly interested in the languages that they want to learn. If that is the kind of level they can achieve, that is a failure in my book. For high school, we would expect much, much worse achievement.\n\n**Advanced**: Able to write routine social correspondence and join sentences in simple discourse of at least several paragraphs in length on familiar topics. Can write simple social correspondence, take notes, write cohesive summaries and resumes, as well as narratives and descriptions of a factual nature. Has sufficient writing vocabulary to express self simply with some circumlocution. May still make errors in punctuation, spelling, or the formation of nonalphabetic symbols. Good control of the morphology and the most frequently used syntactic structures, e.g. common word order patterns, coordination, subordination, but makes frequent errors in producing complex sentences. Use a limited number of cohesive devices, such as pronouns, accurately. Writing may resemble literal translations from the native language, but a sense of organization (rhetorical structure) is emerging. Writing is understandable to native not used to the writing of nonnatives.\n\n**Advanced-High**: Able to write about a variety of topics with significant precision and in detail. Can write most social and informal business correspondence. Can describe and narrate personal experiences fully but has difficulty supporting points of view in written discourse. Can write about the concrete aspects of topics relating to particular interests and special fields of competence. Often shows remarkable fluency and ease of expression, but under time constraints and pressure writing may be inaccurate. Generally strong in either grammar or vocabulary, but not in both. Weakness and unevenness in one of the foregoing or in spelling or character writing formation may result in occasional miscommunication. Some misuse of vocabulary may still be evident. Style may still be obviously foreign.\n\n [https://www.actfl.org/sites/default/files/pdfs/public/ACTFLProficiencyGuidelines1986.pdf](https://www.actfl.org/sites/default/files/pdfs/public/ACTFLProficiencyGuidelines1986.pdf)", "created_utc": "1590781184.0", "edited": "False", "id": "fs8eins", "is_submitter": "False", "link_id": "t3_gsv5ff", "parent_id": "t1_fs86zmb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "If you think classrooms are the best place to learn a language, how do you reconcile the fact that almost all students in classrooms achieve awful results? French and Chinese are your best languages because presumably you spent the most time on them. Did you try other methods (mainly immersion), and if not how do you know classroom was better than alternatives? You just think the classroom would have improved your Japanese, but your experience without it allowed you to get to a “good” level, seems to contradict your point. If you look at elite speakers of foreign languages, they did not achieve it from direct instruction.", "created_utc": "1590776761.0", "edited": "False", "id": "fs85bgf", "is_submitter": "False", "link_id": "t3_gsv5ff", "parent_id": "t1_fs7ptlh", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "> My current strategies of learning tones are effective \\* \n\nSeems weird to ask this question and have no follow-up as to what those strategies are. Don't you want to better understand how learners approach learning tones and what they find to be effective and ineffective?", "created_utc": "1590654101.0", "edited": "False", "id": "fs2i4di", "is_submitter": "False", "link_id": "t3_gqkbbj", "parent_id": "t3_gqkbbj", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "\\#1 His kids are going away on a field trip with their school over the weekend, so he's finally going to have some time to himself, **which is** going to be good for him. Besides, he's also going to have the whole house all to himself! Don't worry about him\\*\\*. H\\*\\*e'll be fine.\n\n\\#3 Mom's **baked** a cake **just for me**!\n\n\\#4 Mom's **baked** a cake for me, so **I have it** all to myself!", "created_utc": "1590542869.0", "edited": "False", "id": "frxmffm", "is_submitter": "False", "link_id": "t3_gr8wop", "parent_id": "t3_gr8wop", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "tocayoinnominado", "body": "Trending (media/videos/etc. that we find suitable) for you", "created_utc": "1590541969.0", "edited": "False", "id": "frxkvkt", "is_submitter": "False", "link_id": "t3_gr85ie", "parent_id": "t1_frxjy9q", "score": "1", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "tocayoinnominado", "body": "None of the responses seem that natural so far. As has been pointed out, all of your examples are wrong. Idiomatic English for expressing this in my experience is, in order of weakest to strongest desire:\n\n* I could really go for some KFC (right now).\n* I'm (really) craving (some) KFC (right now).\n* I'm dying for some KFC (right now).\n\n\"I have a (strong) craving for KFC\" is grammatical, but there aren't many situations where a native speaker would actually say that. The parenthetical options to me make the sentences more natural.", "created_utc": "1590541824.0", "edited": "1590542037.0", "id": "frxkmdg", "is_submitter": "False", "link_id": "t3_gr7utj", "parent_id": "t3_gr7utj", "score": "3", "subreddit": "EnglishLearning", "subreddit_id": "t5_2u8ap"}, {"author": "tocayoinnominado", "body": "Madrid is a destination, so you need para in that instance. \"Voy para Madrid\" or \"Voy a ir para Madrid\" are fine in a vacuum, but I don't think your sentence really makes that much sense. Maybe \"Después de considerar varios destinos, fui para Madrid.\"", "created_utc": "1590514528.0", "edited": "False", "id": "frw30et", "is_submitter": "False", "link_id": "t3_gqzzp9", "parent_id": "t1_frvxwh5", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "This is pretty silly. It is not that rare or surprising to surpass average native speakers in grammar and vocabulary knowledge. What native speakers are virtually unparalleled in is their pronunciation, ease of speaking, listening comprehension, and intuition for natural spoken language. In these regards, native speakers are rightly revered.", "created_utc": "1590314006.0", "edited": "False", "id": "frmzsoq", "is_submitter": "False", "link_id": "t3_gopedm", "parent_id": "t1_frjhns2", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Well you do immerse during RRTK so the only issue is what is the optimal cut off point for kanji. 1000 seems like a good enough base though.", "created_utc": "1590213249.0", "edited": "False", "id": "friyoid", "is_submitter": "False", "link_id": "t3_gor41x", "parent_id": "t1_frho1oh", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "https://en.wikipedia.org/wiki/Spanish_verbs\n\nYour title should say I'm challenging myself to study Spanish for 2 weeks because you can't learn a language in 2 weeks obviously. Gonna second the textbook suggestion because you seem rather clueless, as is partly to be expected with the first language you learn, as well as someone that is too lazy to google for an explanation of the tenses.", "created_utc": "1590030007.0", "edited": "False", "id": "frb0f5k", "is_submitter": "False", "link_id": "t3_gnoax3", "parent_id": "t3_gnoax3", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "There's literally no reason to buy a dictionary other than novelty. [WordReference](https://www.wordreference.com/) and [Collins](https://www.collinsdictionary.com/dictionary/english-spanish/) are more than sufficient for bilingual dictionaries. For monolingual, the [DRAE](https://dle.rae.es/) is more than sufficient.", "created_utc": "1589865873.0", "edited": "False", "id": "fr3tk24", "is_submitter": "False", "link_id": "t3_gmguzy", "parent_id": "t3_gmguzy", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "There are Mandarin subs but not Cantonese subs.", "created_utc": "1589855954.0", "edited": "False", "id": "fr3exub", "is_submitter": "False", "link_id": "t3_gmd248", "parent_id": "t1_fr2x32h", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "A book called “Remembering the Hanzi” by James Heisig", "created_utc": "1589677008.0", "edited": "False", "id": "fqvgwb2", "is_submitter": "False", "link_id": "t3_gl4hdf", "parent_id": "t1_fqvf4lb", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "No revisé el texto cuidadosamente, pero por lo menos hay un error: “instincto” en vez de “instinto”.", "created_utc": "1589520968.0", "edited": "False", "id": "fqopb41", "is_submitter": "False", "link_id": "t3_gjskq4", "parent_id": "t1_fqn29b0", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Your translation is mistaken. It should be something like “Con el tiempo, te das cuenta de que nadie es perfecto.”\n\nI don’t really understand your question, but in the English the “you” refers to people in general and not “literally every person” as does the Spanish with tú.\n\nEdit: “Con el tiempo, te vas dando cuenta de que nadie es perfecto” as was mentioned in another comment is better.", "created_utc": "1589391636.0", "edited": "1589407561.0", "id": "fqi78xy", "is_submitter": "False", "link_id": "t3_gj39lo", "parent_id": "t3_gj39lo", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "When giving a figure for words known, you need to specify whether it refers to types (words separated by spaces with unique spellings), lemmas, or word families. Based on the number, I'm assuming it's word families, but still, talking about \"words known\" without specifying is nonsensical because there are different classifications for a word.", "created_utc": "1589324827.0", "edited": "1589326186.0", "id": "fqfh7jf", "is_submitter": "False", "link_id": "t3_gigyyw", "parent_id": "t1_fqehg1x", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "They didn't say they needed them to understand what was going on, just that they needed them to not miss anything. Also, it's definitely possible.", "created_utc": "1589306460.0", "edited": "False", "id": "fqef0fu", "is_submitter": "False", "link_id": "t3_gi7e40", "parent_id": "t1_fqdxuwj", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "No soy nativo, pero unas correcciones:\n\n* EEUU > EE. UU. (en la escritura súper formal según la RAE; obviamente casi nadie lo escribe de esa manera en comentarios en internet)\n* \"estaré viendo\" suena a inglés para mí pero no creo que sea incorrecto (quizá \"veo\" sería mejor)\n* Ingles > inglés\n* es raro que nos imponemos > es raro que nos impongamos\n* nuestra Español > nuestro español\n* nuestra Ingles > nuestro inglés", "created_utc": "1589306256.0", "edited": "False", "id": "fqeekm6", "is_submitter": "False", "link_id": "t3_gi7e40", "parent_id": "t1_fqdbjap", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "If you assume every single video over 10 minutes is doing that, you are wrong. Also, you would be missing out on tons of valuable content out of spite, I guess? And, there's a thing called skipping around a video and increasing the playback speed to save you time and to avoid lengthy sponsor plugs and lengthy intros. That principle is simply untenable. You would never say \"I never read books. They all start off with prologues that are too long and they just take too long to get to the point.\"", "created_utc": "1589304408.0", "edited": "False", "id": "fqeak24", "is_submitter": "False", "link_id": "t3_ghcoxh", "parent_id": "t1_fqcyd52", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "That is a profoundly stupid principle to hold.", "created_utc": "1589260810.0", "edited": "False", "id": "fqckqak", "is_submitter": "False", "link_id": "t3_ghcoxh", "parent_id": "t1_fq9lm5p", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Because it's \"el ave\" aunque es femenina, como \"el águila.\" Probablemente de allí, la confusión.", "created_utc": "1588894404.0", "edited": "1588894675.0", "id": "fptn5zm", "is_submitter": "False", "link_id": "t3_gfezl0", "parent_id": "t1_fptig4u", "score": "6", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "You just immerse with the news actively. It may be a struggle at first, but you will gradually understand more and more, just like other domains. You don’t need to start off with a specific vocab list. Just mine the sentences from NHK or whatever you find.", "created_utc": "1588869662.0", "edited": "False", "id": "fps9df0", "is_submitter": "False", "link_id": "t3_gf9gvd", "parent_id": "t3_gf9gvd", "score": "4", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "Just FYI, exposición > exposure", "created_utc": "1588841729.0", "edited": "False", "id": "fpr45sh", "is_submitter": "False", "link_id": "t3_geyuxq", "parent_id": "t1_fpqvsv7", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I guess, but I still feel like you would run into issues with anything remotely complex, not to mention there could be a plethora of issues given finer nuances in the pronouns or nouns or what have you depending on the language. I mean it's avoidable up to a point, but it's simply not worth it.", "created_utc": "1588840958.0", "edited": "False", "id": "fpr3ee8", "is_submitter": "False", "link_id": "t3_geyqox", "parent_id": "t1_fpr26af", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I don't understand. Is there an example sentence with just a picture and no translation? Can you expand on that?", "created_utc": "1588839564.0", "edited": "False", "id": "fpr1zv7", "is_submitter": "False", "link_id": "t3_geyqox", "parent_id": "t1_fpr0dex", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "How do you use pictures to learn grammatical terms and other abstract concepts? There's simply no need to avoid translations when you're starting out. Is using a picture of an apple instead of the word \"apple\" really going to make a difference in the long run? No.", "created_utc": "1588837771.0", "edited": "False", "id": "fpr05tu", "is_submitter": "False", "link_id": "t3_geyqox", "parent_id": "t1_fpqymtx", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Using translations at first is almost unavoidable and is super efficient and not detrimental. I think brute forcing a frequency list is extremely beneficial and will allow one to store information related to the language much easier.", "created_utc": "1588834450.0", "edited": "False", "id": "fpqwm4b", "is_submitter": "False", "link_id": "t3_geyqox", "parent_id": "t1_fpqgmug", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "That is not true. Preterit can absolutely be used with estar in the past progressive, although it’s not very common. \n\nEstuve corriendo por 30 minutos esta mañana.", "created_utc": "1588789906.0", "edited": "False", "id": "fposiei", "is_submitter": "False", "link_id": "t3_gejc9f", "parent_id": "t1_fpomoyf", "score": "8", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "It's definitely a bad idea to regularly consume slowed down content. What developing listening ability involves is, in essence, pattern recognition. Your brain needs to decipher how sounds blend to together in order to break down a stream of sound waves into word partitions. By listening to distorted audio, you are fundamentally changing the kind of patterns that you are going to be exposed to. It will just sound off from native speech, and thus, you will not be practicing and your brain will not be gathering data on the correct kind of speech. \n\nIt's perfectly okay to understand less. The faster you get used to not understanding, the more authentic you can consume. The more authentic content you consume, the more you get exposed to the correct patterns, and the better you will get. A large part of this process is subconscious, which your brain figures out via mass exposure. I think slowing down audio has no necessary role in the process, although it could be nice to slow it down to listen to a phrase again, this ultimately won't be needed. Eventually you will be able to hear more and more phrases at full native speed, it's just going to take a very long time (100s-1000s of hours).", "created_utc": "1588721919.0", "edited": "False", "id": "fplygxb", "is_submitter": "False", "link_id": "t3_ge437x", "parent_id": "t3_ge437x", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Just a small correction, as your English is amazing:\n\nIf you are interested, please reach out to me.\n\nBoa sorte", "created_utc": "1588705372.0", "edited": "False", "id": "fpl2tkv", "is_submitter": "False", "link_id": "t3_ge09fc", "parent_id": "t3_ge09fc", "score": "5", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Ya literally just start reading books and you will be just fine. No need to stress out about it my guy.", "created_utc": "1588704012.0", "edited": "False", "id": "fpl02py", "is_submitter": "False", "link_id": "t3_ge2i64", "parent_id": "t3_ge2i64", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Unfortunately you will never get over it. I guess you are stuck with 2 languages. :(", "created_utc": "1588665877.0", "edited": "False", "id": "fpjet2d", "is_submitter": "False", "link_id": "t3_gdr6ye", "parent_id": "t3_gdr6ye", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "It absolutely is a much better version of AJATT, with very powerful guiding principals and they are constantly developing cutting edge language learning tools. It is still incomplete, and the whole website is going to be revamped, so you should probably check it out again in a few months, if you don't want to start right now.", "created_utc": "1588665650.0", "edited": "False", "id": "fpjel0f", "is_submitter": "False", "link_id": "t3_gdgh5l", "parent_id": "t1_fpi9i4e", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "This question is really vague, but the answer is no. Sometimes there are expressions that follow a similar formula that don't use subjunctive, but they are exceedingly rare in my experience. The phrase \"menos mal que\" is almost always followed by the indicative.\n\nMenos mal que tuvo su pasaporte a mano.\n\nLuckily he had his passport on him.", "created_utc": "1588572583.0", "edited": "False", "id": "fpfiuux", "is_submitter": "False", "link_id": "t3_gcm20x", "parent_id": "t3_gcm20x", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Yep. I’m going through this exact process with Cantonese right now. From your post, I’m pretty sure my listening ability is similar to yours maybe better, but I’ve been studying 2 months and I listen an hour-ish every day. Your goal is not to understand the plot and details (that is not going to happen), but instead listen for words and phrases that you already know, as well as words that you hear over and over. You are going to have to listen so much to “download” Chinese because it’s so different. A lot of this “downloading” happens subconsciously so you won’t really feel like you are improving as much as you really are. I would try to find the most entertaining, highly visual show that is as simple as you can. For me this is Dragonball. The language is very simple and extremely repetitive. Also, check out the Mass Immersion Approach. Good luck", "created_utc": "1588523531.0", "edited": "False", "id": "fpdb6c2", "is_submitter": "False", "link_id": "t3_gci2zu", "parent_id": "t1_fpcu6mu", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Your daily exposure to spoken Chinese is a mixed English-Chinese podcast for 15-20min???? Listen to actual native content an hour a day and you will drastically improve.", "created_utc": "1588496695.0", "edited": "False", "id": "fpcdqhx", "is_submitter": "False", "link_id": "t3_gci2zu", "parent_id": "t3_gci2zu", "score": "16", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Dialogue (speaking between two or more characters) is always marked by the raya. Comillas are for quoting text, or the expression of thoughts. In reported speech there is an interesting nuance:\n\n>Las rayas se usan para enmarcar, en medio de una cita textual entrecomillada, las aclaraciones del transcriptor sobre la autoría de las palabras que se citan:  \n>  \n>«Es imprescindible —señaló el ministro— reforzar los sistemas de control sanitario en las fronteras».  \n>  \n>Se usa, en cambio, la coma cuando la aclaración aparece en posición final, fuera del texto entrecomillado:  \n>  \n>«Es imprescindible señaló el ministro reforzar los sistemas de control sanitario en las fronteras», señaló el ministro.", "created_utc": "1588375864.0", "edited": "False", "id": "fp7qrzz", "is_submitter": "False", "link_id": "t3_gboh6x", "parent_id": "t1_fp75olz", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "A grandes rasgos, es una buena lectura, aunque a mi parecer un poco más lenta de lo natural. Quiero señalarte unos de los errores que noté yo para que puedas seguir mejorando.\n\n* diskípulos > discípulos (s sound not k sound) \n* reunó > reunió \n* ir-gui-ó > ir-guió \n* a-tre-vi-ó > a-tre-vió \n* repuSO > rePUso \n* hágamos > hagamos \n* práctico > pracTIco", "created_utc": "1588184300.0", "edited": "1588184579.0", "id": "foz3zua", "is_submitter": "False", "link_id": "t3_gabdlk", "parent_id": "t3_gabdlk", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "What the fuck did I just read and how does it have upvotes.\n> I'm learning Portuguese right now. I can read Brazilian Portuguese at about 80%, listening about 50-60%\n> \nIn terms of reading, I'm easily B2, listening maybe A2/B1\n\nYou either don't know how to evaluate your comprehension ability (which is extremely likely given that it's unintuitive and very hard to gauge the lower your level is) or you are completely delusional about your ability. You NEED to read that article. 80% comprehension of raw words is painful and the true comprehension of those texts is going to be much, much lower, to an extent that you can barely tell what's going on at all. \n\nAlso, when you reach an extremely high level of comprehension competence (ELN or higher), you will be able to speak to at least a basic to low moderate level naturally. The common language would have been drilled into your head over the hundreds to thousands of hours that it takes to reach that level.", "created_utc": "1588062494.0", "edited": "False", "id": "fotqh1a", "is_submitter": "False", "link_id": "t3_g98sqr", "parent_id": "t1_fosvtj8", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "As for your question I have no idea. Here is your post corrected more or less:\n\nPara el inglés hay un libro que se llama Merriam-Webster's Vocabulary Builder. No es un diccionario en sentido estricto, pero contiene (listas de?) palabras para ayudar en la expansión del léxico de una persona.\n\n¿Hay (*Existe* sounds better to me here but that'd be splitting hairs) una versión de este libro en español?", "created_utc": "1587966923.0", "edited": "False", "id": "fopo6ub", "is_submitter": "False", "link_id": "t3_g8qcke", "parent_id": "t3_g8qcke", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "comoquiera*", "created_utc": "1587957145.0", "edited": "False", "id": "fopb442", "is_submitter": "False", "link_id": "t3_g8nukp", "parent_id": "t1_foola9g", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "It’s the same as the other alveolar taps/flaps. You are mistaken.", "created_utc": "1587155361.0", "edited": "False", "id": "fnq0hil", "is_submitter": "False", "link_id": "t3_g38hf1", "parent_id": "t3_g38hf1", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "No pasa nada. Nomás ten en cuenta que es un larguísimo viaje.", "created_utc": "1587061275.0", "edited": "False", "id": "fnlx5fj", "is_submitter": "False", "link_id": "t3_g2b66v", "parent_id": "t1_fnlv6iw", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Hace 108 días publicó una grabación en la que decía que había estudiado el español durante los últimos 6 meses, así que ni siquiera ha estudiado por un año y se creyó alcanzar el C1...", "created_utc": "1587057243.0", "edited": "False", "id": "fnloyzp", "is_submitter": "False", "link_id": "t3_g2b66v", "parent_id": "t1_fnkvvnn", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Here are a few things you need to keep in mind:\n\n1. You can’t learn all of the words\n2. The rarer the words, the more domain specific they get\n3. You have to choose what you care about learning\n4. Consume content in that domain\n\nAt the advanced levels word lists are pretty bad. They are usually picked arbitrarily and you also won’t know if the words are in current use, are used in the region you care about, and are actually relevant to what you want to learn.\n\nSo what should you do? Well, if you want to learn words related to electricity and engineering, read a book from the target country on those topics. Watch videos where they talk about these topics or are explaining how something works, or tutorials, or manuals. Any native content that pertains to it is fine. The same goes for literature. Read poems, novels, etc.\n\nAs for how to memorize them, I highly recommend making sentence cards in Anki. That is, you find a sentence where there is 1 new concept, you put the sentence on the front of a card in anki, and on the back you write the word and it’s definition in Spanish (unless it’s a noun, in which case often a picture or the English word are more useful). This way you are only learning words that have been proven to actually be used and thus useful, and you see the exact context the word is used in.", "created_utc": "1586887885.0", "edited": "False", "id": "fneeenw", "is_submitter": "False", "link_id": "t3_g167wm", "parent_id": "t3_g167wm", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "De hecho, no es así en el habla culta europea.\n\n Fundéu:\n\n>***Mientras*** **y** ***mientras que*** **pueden significar ‘durante el tiempo en que’ y ‘en cambio’**, excepto en el español culto europeo, donde no se considera adecuado el uso de *mientras que* con el primero de estos sentidos.  \n>  \n>Como explica la Gramática académica, [***mientras***](http://aplica.rae.es/grweb/cgi-bin/v.cgi?i=bMpTpiItsjxDyakR) proviene de la reducción de *mientras tanto* y **expresa simultaneidad, superposición temporal de dos situaciones**. ***Mientras que*** es una locución conjuntiva que, **con este** mismo **sentido**, solo pervive en el español americano, pero **no se encuentra en la lengua culta del español europeo**.  \n>  \n>Por otro lado, ***mientras que*** **y** ***mientras*** **expresan** contraposición**, contraste de dos estados de cosas o de dos propiedades**, y su **uso** está **asentado tanto en el español americano como en el europeo**.\n\n [https://www.fundeu.es/recomendacion/mientras-no-es-lo-mismo-que-mientras-que/](https://www.fundeu.es/recomendacion/mientras-no-es-lo-mismo-que-mientras-que/)", "created_utc": "1586750030.0", "edited": "False", "id": "fn8trln", "is_submitter": "False", "link_id": "t3_g03skm", "parent_id": "t1_fn8q0ul", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Siempre y cuando, siempre que y con tal de que significan lo mismo aunque pueden tener matices que los diferencian sutilmente.\n\n\"Mientras que\" es diferente.\n\n>**mientras** **que**  \n>  \n>**1.** loc. conjunt. En cambio. *Juan* estudia, mientras que tú no haces nada de provecho.\n\n*Equivale a \"while\".*", "created_utc": "1586746037.0", "edited": "False", "id": "fn8o0zj", "is_submitter": "False", "link_id": "t3_g03skm", "parent_id": "t1_fn8kh31", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "A lemma is a headword and it’s inflected forms. \n\nEx: run = headword\nLemma: run, runs, ran, running\n\n“Runner” would not be part of the lemma because that is a derived and not an inflected form.", "created_utc": "1586671886.0", "edited": "False", "id": "fn5puon", "is_submitter": "False", "link_id": "t3_fzgath", "parent_id": "t1_fn5olnj", "score": "10", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "If you do 1000 hours of listening, I bet you would have a pretty solid hang of them.", "created_utc": "1586644478.0", "edited": "False", "id": "fn4mkou", "is_submitter": "False", "link_id": "t3_fyyvq7", "parent_id": "t3_fyyvq7", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "After 6 months-ish.", "created_utc": "1586403605.0", "edited": "False", "id": "fmv19mu", "is_submitter": "False", "link_id": "t3_fxjwbv", "parent_id": "t3_fxjwbv", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "If you just want grammar: A New Reference Grammar of Modern Spanish, 6th Edition, By John Butt, Carmen Benjamin, Antonia Moreira Rodríguez, Routledge", "created_utc": "1586287650.0", "edited": "False", "id": "fmpunha", "is_submitter": "False", "link_id": "t3_fwqmwp", "parent_id": "t3_fwqmwp", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Ya, but that's a noun. You needed the adjective.\n\nEdit: also condescendent is extremely uncommon", "created_utc": "1586061440.0", "edited": "False", "id": "fmgynne", "is_submitter": "False", "link_id": "t3_fv606v", "parent_id": "t1_fmgyivn", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Just want to point out condescendiente > condescending.", "created_utc": "1586060949.0", "edited": "False", "id": "fmgy1eb", "is_submitter": "False", "link_id": "t3_fv606v", "parent_id": "t1_fmgn3ia", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I think you should think of understanding movies as almost like a separate skill. You will naturally get better over time by watching more movies, just like you can naturally get better at the language by listening to things you don't understand all of.", "created_utc": "1585684741.0", "edited": "False", "id": "fm1tj45", "is_submitter": "False", "link_id": "t3_fsflb2", "parent_id": "t1_fm1mn8o", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Read a lot of Latin?", "created_utc": "1585680317.0", "edited": "False", "id": "fm1kymx", "is_submitter": "False", "link_id": "t3_fsblrm", "parent_id": "t1_fm1k0sw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "There is a subconscious narrowing of the possibilities based on the context that natives have. It's not a conscious prediction/deduction. Yes, of course there are things that natives will miss, but they are few and far between instances.\n> the problem isn't in me as you insist to point out\n\n> I get about 85% of what's said but tend to miss a lot of important words\n\nI guess you are just fine. Natives only understand 85% of movies? News to me. The best way to not improve is to just assume you aren't the problem.", "created_utc": "1585679702.0", "edited": "False", "id": "fm1js87", "is_submitter": "False", "link_id": "t3_fsflb2", "parent_id": "t1_fm1g8lq", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "So sometimes the audio is distorted or extra hard to hear. In these cases, natives predict what will be said and deduce what was said after from context. You probably have an underdeveloped ability to guess from context.", "created_utc": "1585674746.0", "edited": "False", "id": "fm1a5d3", "is_submitter": "False", "link_id": "t3_fsflb2", "parent_id": "t1_fm16q8j", "score": "-1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Yes", "created_utc": "1585672650.0", "edited": "False", "id": "fm161kw", "is_submitter": "False", "link_id": "t3_fsflnw", "parent_id": "t1_fm14sjt", "score": "7", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Movies are harder so it strains your listening skills more. Your listening skills are simply underdeveloped. You just need to watch more native content without subtitles or listen to more audiobooks/podcasts/etc.", "created_utc": "1585672598.0", "edited": "False", "id": "fm15xzh", "is_submitter": "False", "link_id": "t3_fsflb2", "parent_id": "t3_fsflb2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "You can’t directly.\n\nKnowing/teaching grammar can still be useful. You can teach them more grammar, so that they notice the grammar more. The only way they will improve their spoken grammar is if they can notice how it is used in native speech and writing. The problem is that in order to develop this subconscious grammar automaticity it’s going to take hundreds to thousands of hours of focused reading and listening, which they have to do on their own.", "created_utc": "1585672390.0", "edited": "False", "id": "fm15jpf", "is_submitter": "False", "link_id": "t3_fsblrm", "parent_id": "t3_fsblrm", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Study both languages everyday.", "created_utc": "1585671825.0", "edited": "False", "id": "fm14gga", "is_submitter": "False", "link_id": "t3_fsd761", "parent_id": "t3_fsd761", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Right. It's not very hard to read a book on how the grammar works, but it can be really hard to write the book on how the grammar works.", "created_utc": "1585607559.0", "edited": "False", "id": "flyrbe6", "is_submitter": "False", "link_id": "t3_fs0bgv", "parent_id": "t1_flyr002", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "If it's not mutually intelligible, it's a different language.\n\nThis is an interesting predicament. I'm assuming there are no frequency lists for this language. I would find a list of the most common concepts and verbs across languages, look them up in the dictionary, and make Anki cards from them. I don't know if such a list exists though. If not, try just brainstorming really common and useful words that you will need, such as family member names, man/woman, common verbs like drink, eat, etc. I would ask the natives if they know what the articles and prepositions are and have them make simple sentences for you using them. Otherwise, I think you would just have to pay really close attention to their speech and ask A LOT of questions to try to build some kinda of loose foundation. If you get enough exposure, your brain should be able to figure it out. Granted, that's going to be incredibly difficult to do with pure conversation. Definitely record their speech to listen to for later. Also I would form hypotheses about how certain words and grammar works in a book and constantly be on the lookout for how it behaves in real conversations. Effectively, you would really need some kind of background in linguistics to decipher how it works.", "created_utc": "1585607095.0", "edited": "False", "id": "flyqh5w", "is_submitter": "False", "link_id": "t3_fs0bgv", "parent_id": "t3_fs0bgv", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I used to do a lot of Memrise, but have since converted to Anki. I definitely learned a lot, but the support for it is terrible. Luckily people have made scripts that improve its functionality, but it’s still quite limited. It’s actually pretty good with auto learn, type-only tests, and if you remove the letter hints with an ad blocker. However, there is pretty much only one reason to use it over Anki and that is user-friendliness. Anki can do everything Memrise can and more, and it is highly customizable and evolving to get better and better. Anki is pretty much as good as you make it, whereas Memrise is pretty good for those that don’t want that burden.\n\nMemrise was never designed to develop language ability. It’s for gaining knowledge. You have to read, listen, and speak to develop those abilities.", "created_utc": "1585556119.0", "edited": "False", "id": "flwmass", "is_submitter": "False", "link_id": "t3_frk416", "parent_id": "t3_frk416", "score": "1", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "The fact that learning styles don't exist does not contradict the fact that seeing words helps you remember them better. It helps me too. It would probably help everyone to some extent. The idea is that some material is conducive to a certain method of presentation and other material, in other ways. No one is a blanket \"visual learner\" in all fields of learning.", "created_utc": "1585551667.0", "edited": "False", "id": "flwiaf7", "is_submitter": "False", "link_id": "t3_fqsg90", "parent_id": "t1_flwd7s1", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Exacto, las palabras casi siempre tienen muchas acepciones. *Awkward* puede querer decir *clumsy* y eso un hecho indiscutible.", "created_utc": "1585526894.0", "edited": "False", "id": "flvm6nr", "is_submitter": "False", "link_id": "t3_fr400s", "parent_id": "t1_fltyldf", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "FYI learning styles don't exist.\n\n> Despite the popularity of learning styles and inventories such as the VARK, it’s important to know that **there is** **no evidence to support the idea that matching activities to one’s learning style improves learning**.  It’s not simply a matter of “the absence of evidence doesn’t mean the evidence of absence.”  On the contrary, for years researchers have tried to make this connection through hundreds of studies. \n\n [https://cft.vanderbilt.edu/guides-sub-pages/learning-styles-preferences/](https://cft.vanderbilt.edu/guides-sub-pages/learning-styles-preferences/)", "created_utc": "1585526235.0", "edited": "False", "id": "flvl6dr", "is_submitter": "False", "link_id": "t3_fqsg90", "parent_id": "t1_flt7pcw", "score": "0", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "What level can you reach in a year? No idea\n\nWhat can you do right now?\nI'm assuming you know basic grammar and the most common 1000 words in Spanish.\n\n1. Read the Mass Immersion Approach [website](https://massimmersionapproach.com/table-of-contents/stage-0/introduction/)\n2. Download and learn how to use Anki (check out how MIA does Anki, but the most important thing is that you focus on making sentence cards containing 1 unknown word/phrase on the front and the word and its definition on the back)\n3. Figure out how much time you are willing to spend per day studying Spanish\n4. Spend 1/3 listening to native content (no subtitles), 1/3 reading native content, and 1/3 on Anki making flash cards and reviewing.\n5. Depending on your goals of how good you want to get, start speaking (the better you want to get, the later you should put off actively practicing speaking).", "created_utc": "1585470747.0", "edited": "False", "id": "fltfl5o", "is_submitter": "False", "link_id": "t3_fr0spi", "parent_id": "t1_fltei5s", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Wow the Dunning Kruger effect never ceases to amaze. There's so much to unpack here, where to start...\n\nThese language levels aren't like math courses, where you just pass one and then just move on the next and be able to keep progressing in the same amount of time. The amount to improve each level is exponential. To reach C2 in one year is impossible. There's simply not enough time in the year for you to be able to reach that level.\n\n**C2 Criteria:**\n\n>Can understand with ease virtually everything heard or read.  \n>  \n>Can summarize information from different spoken and written sources, reconstructing arguments and accounts in a coherent presentation.  \n>  \n>Can express themselves spontaneously, very fluently and precisely, differentiating finer shades of meaning even in the most complex situations.\n\n**Vocabulary:**\n\nA C2 level is comparable to an educated native speaker. From Researching Vocabulary: A Vocabulary Research Manual (Research and Practice in Applied Linguistics), Norbert Schmitt: “A range of 16,000–20,000 word families seems a fair estimate of the vocabulary size for educated native speakers.”\n\nThere are 3 main ways to classify words, type, lemma, and word family. A type is every unique grouping of characters separated by a space. A lemma is a dictionary head word and its inflected forms. A word family is all of the inflected and derived forms of a word. For example:\n\nLemma: talk, talks, talked, talking\n\nWord Family: talk, talks, talked, talking, **talker, talkie, talkers, talkable, talkability, intertalk…**\n\nLemma: hablar, hablo, hablas, hablo, hablan, hablamos, habláis, hablan, hablé, hablaste, habló, hablasteis, hablaron, hablaba, hablabas, hablábamos...\n\nWord family: lemma: hablar, hablo, hablas, hablo, hablan, hablamos, habláis, hablan, hablé, hablaste, habló, hablasteis, hablaron, hablaba, hablabas, hablábamos... **hablador, habladuría, hablante, hablanchín, habladera...**\n\nSo word families can encompass quite a few words, although many of the forms can be understood from the lemma. Even so, you’re looking at knowing around 40-60kish word forms or something thereabouts. It’s really hard to put a number to. Let’s say 40,000 for the hell of it; that would be 110 new words everyday for a whole year. Clearly, it’s impossible to retain that much. However, C2 speakers not only know all those words, but they have more or less instant recognition of them, as well as a production capability of many of them. This amount of vocabulary is an enormous task alone, but it’s really just a small piece of a C2 speaker.\n\n**Listening:**\n\nC2 speakers also have amazing listening capabilities. Listening skill is developed unconsciously by listening to a tremendous amount of the language. You can’t really control how fast you will be able to develop this ability, apart from listening to the language as much as possible, but there will be diminishing returns of the course of each day. You aren’t going to get better 6 times as fast listening 6 hours a day as you would if you listened 1 hour a day.\n\n**Speaking:**\n\nThere is a lot involved in speaking, from literal muscle memory to have proper pronunciation, to fluidity, accurate word choice, adequate speed and so on. This will also take a great deal of time to improve at. In order to speak naturally, correct syntax and grammar has to be largely subconscious.\n\nI’m not even going to go into reading, writing, grammar, and general culture knowledge (including regional variation) and countless other little skills. The point is, there is a lot to learn and practice.\n\n**What about below a C2 level?**\n\nSo it is clear that C2 is out of reach in a year I hope. It doesn’t matter how “good” you may be at learning languages. Many people consider even B2 to be fluent, which is a very good level that also requires tons of vocab and exposure similar to the above, but to lesser degrees. You don’t hear about too many people getting very fluent in 1 year. It’s possible with highly related languages, but would still take a tremendous amount of time and effort, and the end result would still be quite limited. Also, a test can never get an accurate assessment of your ability. It’s fine if you just want it as a certification, but do not conflate a test score with competence. Language abilities are too nuanced, and knowledge sets too vast for comprehensive assessment within a reasonable time frame.\n\n**Classes/Courses to get me to X level?**\n\nTaking from one of my other answers:\n\n>If the only Spanish exposure you get is in classes, you will never be fluent. You have to study outside of the class because fluency simply takes so long. Depending on the level that you want to reach, you have to spend hundreds to thousands of hours reading and listening followed by a ton of speaking practice. Also, classes are just horrible at teaching languages. They could be an okay-ish supplement to learning, as well as a source of accountability and structure, but that's it. NOBODY can teach you a language, just as nobody can teach you to the level of a professional musician. It takes lots of practice.\n\nThere is no course that can take you to a C1, much less a C2 level. You just consume native content A LOT. If you want to improve your grammar, read a book in the target language on grammar. If you want to speak better, practice speaking on your own or with native speakers.  If you want to know more words, use an SRS. If you want to know more about how the language works, listen and read and PAY ATTENTION. Developing language ability isn’t math. You don't just plug in English into the formula and get the Spanish and once you have enough formulas you're done. You have to know what to say and how to say it in the countless and  very specific situations that come up in life. It’s more akin to being able to play an instrument or a sport. Guidance and theory help, but are useless without practice.\n\nEdit:\n\n[Language isn't math](https://www.youtube.com/watch?v=y8JK8W8dBxk)\n\n[Language as an ability](https://www.youtube.com/watch?v=_LIz-Wbt4us)", "created_utc": "1585469014.0", "edited": "1585469985.0", "id": "flte5kb", "is_submitter": "False", "link_id": "t3_fr0spi", "parent_id": "t3_fr0spi", "score": "11", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "[https://www.youtube.com/watch?v=YCESUUA0wL0](https://www.youtube.com/watch?v=YCESUUA0wL0)\n\nDisclaimer: Don't shadow, unless you are already kinda fluent.", "created_utc": "1585446335.0", "edited": "False", "id": "flsno3u", "is_submitter": "False", "link_id": "t3_fqwnso", "parent_id": "t3_fqwnso", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I don't think there is any research yet. It's too new and too unknown. I think vocabulary research is fascinating though and I almost want to get a degree in linguistics to study it myself. I think SRS (well pretty much only Anki right now) are vastly underestimated in their efficacy, flexibility, and applicability.", "created_utc": "1585354061.0", "edited": "False", "id": "flp8v7k", "is_submitter": "False", "link_id": "t3_fpoeql", "parent_id": "t1_flmvmhw", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "No puedo contestarte del todo. De hecho, ni siquiera sabía de llevar + participio. A mí parecer, ~~solo se usa \"tener + participio\" con una escasez de verbos específicos.~~\n\nSegún mi experiencia, *tengo entendido* y *tengo pensado* son los más comunes. Ni puedo recordar otros ejemplos en este momento. Que yo sepa, difieren en su matiz de sus equivalentes con haber.\n\nTengo entendido que = As I understand it...\n\nHe entendido que = I have understood that...\n\nTengo pensado + verbo = I envision myself doing (verb)\n\nHe pensado + verbo = I plan on doing (verb)\n\nPuede que me equivoque y son idénticos. A ver qué dicen los nativos en cuanto a ello y lo de llevar + participio.\n\nEdit: *DPD*\n\n>**4.** ***llevar*** **+ participio. Perífrasis que expresa la realización hasta un determinado momento de la acción designada por el participio y que esta aún continúa o puede continuar:** ***«De su recetario de cocina china lleva vendidas siete ediciones» (País \\[Esp.\\] 1.2.84). El español estándar permite esta construcción solamente con verbos transitivos, con cuyo complemento directo, que debe estar explícito, concuerda en género y número el participio:*** ***«Llevaba ya leídas las obras completas de Marx y parte de las de Lenin» (Bryce*** ***Vida \\[Perú 1981\\]). Es incorrecto mantener invariable el participio:*** ***«Llevo gastado unos 30 millones de sucres»(Vistazo \\[Ec.\\] 6.11.97); debió decirse*** ***Llevo gastados.***  \n>  \n>**4.** ***tener*** **+ participio. El verbo** ***tener se usa como auxiliar, seguido del participio de un verbo transitivo, con el mismo sentido que*** ***haber cuando forma los tiempos compuestos de la conjugación:*** ***«Pues la mujer, según tengo oído \\[= he oído\\],*** ***estuvo sirviendo en su casa antes de casarse» (Signes*** ***Ramos \\[Esp. 1977\\]). A menudo la construcción con*** ***tener añade un matiz de reiteración o insistencia:*** ***«¡Le tengo dicho \\[= le he dicho muchas veces\\]*** ***que no me los deje subir al segundo piso, carajo!» (Gamboa*** ***Páginas \\[Col. 1998\\]). A diferencia de*** ***haber, que se combina siempre con el participio en*** ***-o del verbo principal, en la construcción con*** ***tener el participio debe concordar en género y número con el complemento directo:*** ***«Los pocos libros que hay aquí los tiene leídos y releídos»(Carrasquilla*** ***Marquesa \\[Col. 1928\\]);*** ***«¿Quién no tiene oídas historias de baqueanos que encuentran huellas donde nadie las supo ver?» (Fogwill*** ***Cantos\\[Arg. 1998\\]); así pues, el participio no debe quedar inmovilizado en masculino singular:*** ***«Estados Unidos \\[...\\]*** ***parece tener asegurado esta segunda plaza»(País \\[Esp.\\] 21.6.77); debió decirse*** ***tener asegurada. Tampoco es admisible el uso de esta construcción con verbos intransitivos:*** ***«No creas que yo no me tengo ida al sicoanalista» (Futoransky*** ***Pe \\[Arg. 1986\\]).***", "created_utc": "1585296366.0", "edited": "1585297685.0", "id": "flmttmx", "is_submitter": "False", "link_id": "t3_fpshrn", "parent_id": "t3_fpshrn", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I agree that there is a potential for effective classroom instruction. After all, I'm considering teaching it, however the current state of classrooms by and large is ineffective. \n\n> It can be more efficient than anything else\n\nI guess I could buy this in an ideal setting with caveats. I think there are learners who aren't sufficiently self-motivated for which an idealistic classroom setting could prove to be the most effective method. The biggest barrier for learning is motivation and whatever keeps students learning is for practical purposes better than a more theoretically effective approach. I'm not so sure the input can ever be of a truly high quality in a classroom, though. The more input, the more anxious the students tend to be, and the less input, the less effective the classroom. It's a tough balance to pull off. Furthermore, the input tends to be limited in scope because the teacher 1. is always in a classroom setting dealing with academic topics, and 2. is not able to have a conversation with another native. This limited scope is likely not to be a problem for beginners, but the better the students get, the more problematic this one-dimensionality becomes. So the ideal classroom environment could only be the most effective for unmotivated beginners.\n\nI think classrooms today are missing 3 absolutely crucial components and have 2 crippling drawbacks. They lack discussion of effective language learning theory and strategy, they don't teach about how to use an SRS, and they don't help students find personally compelling content. As for drawbacks they incentivize basic communication and grammar rule memorization, and they lack input.", "created_utc": "1585295521.0", "edited": "False", "id": "flmt4f4", "is_submitter": "False", "link_id": "t3_fpoeql", "parent_id": "t1_flmrngh", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Obviously people have different criteria for fluent, but if you're saying they had a B2 or better level that's pretty impressive. When I was in school that number was 0.", "created_utc": "1585285469.0", "edited": "False", "id": "flmjgra", "is_submitter": "False", "link_id": "t3_fpoeql", "parent_id": "t1_flm4gyg", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "This honestly seems troll, but you will absolutely not be fluent. Spanish 2 at my school was starting to teach past tense and did not even get to subjunctive. If the only Spanish exposure you get is in classes, you will never be fluent. You have to study outside of the class because fluency simply takes so long. Depending on the level that you want to reach, you have to spend hundreds to thousands of hours reading and listening followed by a ton of speaking practice. Also, classes are just horrible at teaching languages. They could be an okay-ish supplement to learning, as well as a source of accountability and structure, but that's it. NOBODY can teach you a language, just as nobody can teach you to the level of a professional musician. It takes lots of practice.", "created_utc": "1585278182.0", "edited": "False", "id": "flma29k", "is_submitter": "False", "link_id": "t3_fpoeql", "parent_id": "t3_fpoeql", "score": "13", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "No lo he leído, pero una corrección pequeñita: *el* dilema.", "created_utc": "1585269871.0", "edited": "False", "id": "fllxk0v", "is_submitter": "False", "link_id": "t3_fpk0ew", "parent_id": "t3_fpk0ew", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "This is not the correct usage. \n\nThe first union is x. The second union is y. The unions are x and y, respectively (i.e. x applies to the first and y to the second).\n\nRespectively = in that order", "created_utc": "1585038889.0", "edited": "False", "id": "flco11x", "is_submitter": "False", "link_id": "t3_fo1dbg", "parent_id": "t3_fo1dbg", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "In extremely brief terms,\n\n1. Learn the script and start listening to native speech\n2. Anki the 1000ish most common words\n3. Read a book on basic grammar\n4. Find 1000 very simple sentences with 1 unknown word (sentence on the front, 1 word with its definition on the back)\n5. Sentence mine from immersion\n6. Start making sentence cards with the definition in the target language (monolingual transition)", "created_utc": "1585038517.0", "edited": "False", "id": "flcnqqj", "is_submitter": "False", "link_id": "t3_fnx2yq", "parent_id": "t3_fnx2yq", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "To put it simply, there are 3 components to listening comprehension: raw sounds, how sounds blend together (connected speech), and context. In the case of corrupted or distorted audio, mumbling, or interference from other noise, the raw sounds may not be enough. In this case, one must rely on context of the situation to almost predict what is likely to be said (unconsciously) in order to decipher the message. Sometimes the context is so informative that one can understand even with no sound at all (lip reading), and sometimes no context is needed (clear speech and unambiguous sentences), but most of the time it will fall in between. Your ability to guess from context is probably underdeveloped in this case, as well as your familiarity with connected speech. Understanding connected speech takes a very long time to acquire.\n\n>Lo que escucho: **Testá** buscando.\n\nThat is literally how that phrase is pronounced. In normal paced speech it is not pronounced \"Te...está...buscando.\" \"Testá\" is effectively the \"word\" that is being said. There is no break in it.", "created_utc": "1585030209.0", "edited": "False", "id": "flcgpqs", "is_submitter": "False", "link_id": "t3_fnw5kj", "parent_id": "t3_fnw5kj", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Don’t watch shows with subtitles.", "created_utc": "1585024663.0", "edited": "False", "id": "flcav01", "is_submitter": "False", "link_id": "t3_fnmpst", "parent_id": "t3_fnmpst", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "No hace falta ser enseñado para llegar a una alta competencia en un idioma. ¿Cuánto tiempo pasas mirando la tele diariamente? ¿Qué tan frecuente lees libros? ¿Estudias intencionadamente el vocabulario con un sistema de repetición espaciada? Me imagino que has tomado muchas clases, pero que no te has esforzado mucho en descifrar contenido difícil. Sugiero que veas programas sin subtítulos. La mayoría de su tiempo sería mejor utilizada en ver y leer, pero también recomiendo que estudies la gramática unos diez minutos al día y quizás que escribas más para mejorar tu ortografía, con tal de que encuentres alguien que lo revise.", "created_utc": "1585024285.0", "edited": "False", "id": "flcaf5a", "is_submitter": "False", "link_id": "t3_fnwrmc", "parent_id": "t3_fnwrmc", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "The mindset of learning a language fast is pretty detrimental. So many people chase quick progress that is just not feasible and end up quitting when they inevitably fail. Also, chasing quick progress can detract from developing advanced ability in the long term. That being said, a “reasonable conversation” can actually be had at a very low level. If the person you are talking to speaks very slowly, very clearly, and tailors their language to a very narrow set of vocab, then you can have something resembling a conversation. If this is the goal, then have at it. It should be more or less possible, depending on how choppy and limited you are willing to tolerate. However, the idea that you will in any way be proficient should be cast aside. If you don’t care about reaching a high level in the future, then by all means follow the advice in this thread as it should be able to help you reach that goal.", "created_utc": "1585023416.0", "edited": "False", "id": "flc9d9n", "is_submitter": "False", "link_id": "t3_fnmdy9", "parent_id": "t3_fnmdy9", "score": "0", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Probably impossible? It is impossible to reach a very high level in ANY language in 3 months.", "created_utc": "1585022569.0", "edited": "False", "id": "flc8b2t", "is_submitter": "False", "link_id": "t3_fnmdy9", "parent_id": "t1_flbdyyy", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "To improve your listening skills, you need to listen to spoken Spanish. \"What do you mean, I just listen to it? What if I don't understand?\" Yes, you just listen to native Spanish. You listen to as much as you can stand. Developing listening ability is an unconscious process, one that I'm working on right now with Cantonese. It doesn't even matter if you understand almost nothing. I understood almost nothing and everyday I understand more and more. You just actively try to notice the words that you do know. Eventually you become able to pick out more and more words. Once you learn new words, you just start listening for those words. Eventually you can pick out words you have never heard before. You will be able to decipher some words from context alone. It's not flashy. It's not complicated. You just listen a lot. It's not particularly fun to listen to something you barely understand, but it is necessary to improve.\n\nEdit: Listening without subtitles is true listening", "created_utc": "1584907726.0", "edited": "1584910570.0", "id": "fl7rc05", "is_submitter": "False", "link_id": "t3_fn4td6", "parent_id": "t3_fn4td6", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "You won't get sued for illegally streaming lol. Worst case is a misdemeanor and fine. I think you're too worried.", "created_utc": "1584824374.0", "edited": "False", "id": "fl4yfid", "is_submitter": "False", "link_id": "t3_fm5je7", "parent_id": "t1_fl4xcud", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Hosting illegal streams can get you into real trouble. Just watching illegal streams is almost certainly fine. I haven't heard of any cases related to just streaming the content, although it is technically illegal and punishable by a fine. I guess it just comes down to how important it is to you.", "created_utc": "1584807174.0", "edited": "False", "id": "fl46t0g", "is_submitter": "False", "link_id": "t3_fm5je7", "parent_id": "t1_fl458dw", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "1. You don't NEED friends to learn a language, but they help. You can find people that speak most of the world's languages on the internet you just have to look.\n2. If little to no media exists legally, then get it illegally. If little to no media exists period, then you're fucked and you need to pick a new language or move to the place where they speak it.\n3. If you're learning Latin you just read because there's nothing to listen to. There are tons of things written in Latin, albeit historical documents and such. You would just have to seek out the materials.", "created_utc": "1584772125.0", "edited": "False", "id": "fl37yd6", "is_submitter": "False", "link_id": "t3_fm5je7", "parent_id": "t1_fl2uxl6", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Just learn them 1 at a time, if you actually want to maximize your ability in both. If you want to be pretty mediocre to bad at both then go right ahead.", "created_utc": "1584685729.0", "edited": "False", "id": "fkzzmpn", "is_submitter": "False", "link_id": "t3_flpybo", "parent_id": "t3_flpybo", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Input should always be the bulk of your language studies. Input raises your potential. Practicing output allows you to actualize your potential. If you want to start outputting now, I would suggest this [video](https://www.youtube.com/watch?v=YCESUUA0wL0). Now, if you self-assess at B2, you probably need much, much more immersion and possibly more guidance which you can find on the [Matt vs Japan](https://www.youtube.com/channel/UCpf4BknRWAjb_oYIHoMDGVg) youtube channel and on the [Mass Immersion Approach website](https://massimmersionapproach.com/table-of-contents/stage-0/overview/) (although it is still largely a work in progress).", "created_utc": "1584684788.0", "edited": "False", "id": "fkzyq1l", "is_submitter": "False", "link_id": "t3_flpbn8", "parent_id": "t3_flpbn8", "score": "12", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I'm a Spanish learner, but I'm very advanced now and didn't learn about MIA until a couple months ago. My goal is to basically reach Matt's level in Japanese in Spanish.", "created_utc": "1584683159.0", "edited": "False", "id": "fkzx3w4", "is_submitter": "False", "link_id": "t3_fjugry", "parent_id": "t3_fjugry", "score": "2", "subreddit": "MassImmersionApproach", "subreddit_id": "t5_rw8og"}, {"author": "tocayoinnominado", "body": "According to the RAE, the following are correct.\n\n «Tomo un café solo, por favor», respondió ella. \n\nElla respondió: «Tomo un café solo, por favor». \n\nI'm pretty sure \"respondió ella:\" is wrong when preceding a quote. At least it sounds super off to me.", "created_utc": "1584658923.0", "edited": "False", "id": "fkyymjf", "is_submitter": "False", "link_id": "t3_fla9gc", "parent_id": "t3_fla9gc", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "> **español**. Para designar la lengua común de España y de muchas naciones de América, y que también se habla como propia en otras partes del mundo, son válidos los términos *castellano* y *español*. La polémica sobre cuál de estas denominaciones resulta más apropiada está hoy superada. El término *español* resulta más recomendable por carecer de ambigüedad, ya que se refiere de modo unívoco a la lengua que hablan hoy cerca de cuatrocientos millones de personas. Asimismo, es la denominación que se utiliza internacionalmente (*Spanish, espagnol, Spanisch, spagnolo,* etc.). Aun siendo también sinónimo de *español,* resulta preferible reservar el término *castellano* para referirse al dialecto románico nacido en el Reino de Castilla durante la Edad Media, o al dialecto del español que se habla actualmente en esta región. En España, se usa asimismo el nombre *castellano* cuando se alude a la lengua común del Estado en relación con las otras lenguas cooficiales en sus respectivos territorios autónomos, como el catalán, el gallego o el vasco. \n\n \\-*Diccionario panhispánico de dudas*", "created_utc": "1584658515.0", "edited": "False", "id": "fkyxygh", "is_submitter": "False", "link_id": "t3_flhlnw", "parent_id": "t3_flhlnw", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "It's not common, but it's perfectly possible and correct.\n\n>dejar **5.** tr. Desamparar, abandonar.   \n>  \n>desamparar  **2.** tr. Ausentarse, abandonar un lugar o sitio.   \n>  \n> abandonar **3.** tr. Dejar un lugar, apartarse de él. *Abandonaron* *el* *lugar* *del* *suceso.*", "created_utc": "1584658213.0", "edited": "False", "id": "fkyxgo2", "is_submitter": "False", "link_id": "t3_flj7ry", "parent_id": "t3_flj7ry", "score": "18", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "The most efficient method is the [Mass Immersion Approach](https://massimmersionapproach.com/table-of-contents/stage-0/introduction/).", "created_utc": "1584567549.0", "edited": "False", "id": "fkvefnd", "is_submitter": "False", "link_id": "t3_fkgxru", "parent_id": "t3_fkgxru", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I'm just going add on to this reply because it's really good, but the key criticism that is missing is wrong stress.\n\n1. TOmé should be toMÉ\n2. PENsé should be penSÉ\n3. Así que should be aSÍ que\n\nIn Spanish, an accent mark will ALWAYS mark where stress is.", "created_utc": "1584499243.0", "edited": "False", "id": "fksvbha", "is_submitter": "False", "link_id": "t3_fkdclx", "parent_id": "t1_fksfu3e", "score": "5", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Hay varias maneras de traducirlo según mis investigaciones, pero creo que estaría bien la siguiente:\n\nLos puntos de acceso a wifi están abiertos y gratis para el público.\n\nThere are many ways to translate it according to my research, but I think that the following one will suffice:\n\nLos puntos de acceso a wifi están abiertos y gratis para el público.\n\nEdit: English", "created_utc": "1584477528.0", "edited": "1584477867.0", "id": "fkrwo46", "is_submitter": "False", "link_id": "t3_fkc73b", "parent_id": "t3_fkc73b", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "SRS is the umbrella term for the kinds of programs that use an algorithm to show words more or less frequently based on performance like Anki. The goal of SRS is just to allow you to create \"mental dictionary entries\" that allow you to know a word exists and it's general meaning so that you can notice it when you are reading or listening to native content. I think recall is just developed by seeing, hearing, and thinking about these words in the language all of the time. \n\nI think translation is a separate skill. Obviously it is necessary at the beginning, but as you go on, it becomes more of a hindrance to true comprehension. The method that I believe in promotes a monolingual transition, where you learn how to function entirely within the target language, looking up new words in the target language dictionary. With languages that are very similar this is much less necessary, but with languages that are very distant from English (like Korean) this becomes even more important. It will help you with recall too because the synonyms in your head for certain concepts will be reinforced by the monolingual dictionary. If you want to learn more check out this [link](https://massimmersionapproach.com/table-of-contents/stage-2/mia-stage-2-guide#monolingual-transition).\"", "created_utc": "1584466283.0", "edited": "False", "id": "fkrcrus", "is_submitter": "False", "link_id": "t3_fiwfoe", "parent_id": "t1_fkqi35i", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Percatarse no conforma con el registro. Es demasiado formal.", "created_utc": "1584306360.0", "edited": "False", "id": "fklhf8a", "is_submitter": "False", "link_id": "t3_fj240b", "parent_id": "t1_fkl08bp", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Según mi humilde opinión:\n\n1. Noto cuando mi perro tiene que ir al baño. \n2. Sé cuando mi perro tiene que ir al baño.\n3. Reconozco cuando mi perro tiene que ir al baño.", "created_utc": "1584286224.0", "edited": "False", "id": "fkkkpnp", "is_submitter": "False", "link_id": "t3_fj240b", "parent_id": "t3_fj240b", "score": "35", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "The overlap in meaning is extensive, however, the last meaning of atrasar is not found in retrasar.\n\n> **8.** prnl. Dicho de una persona, de un animal o de una planta: Dejar de crecer, no llegar a su completo desarrollo.", "created_utc": "1584285816.0", "edited": "False", "id": "fkkk2vl", "is_submitter": "False", "link_id": "t3_fiyjhz", "parent_id": "t3_fiyjhz", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Yep. It's a long, long journey. For Korean it's gonna be an even longer journey than for most languages. You just have to keep plowing on. The only \"shortcut\" is to spend even more time per day, but there's no true shortcuts. Do you use SRS?", "created_utc": "1584285239.0", "edited": "False", "id": "fkkj6vv", "is_submitter": "False", "link_id": "t3_fiwfoe", "parent_id": "t1_fkjxdxl", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Hol’ up. Children’s book at C1ish? I think we may be over estimating a bit here. Regardless, the answer is and always will be as Pyjamashjaltarna said: consume native content in mass (reading and listening). Conscious knowledge cannot be accessed by unconscious speaking ability, hence the disconnect you mention. You need to acquire Korean. In order to speak fluidly and effortlessly, the comprehension of the language must be automatic and effortless in combination with intensive speaking practice.", "created_utc": "1584263498.0", "edited": "False", "id": "fkjwy8p", "is_submitter": "False", "link_id": "t3_fiwfoe", "parent_id": "t1_fkjp1li", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "A New Reference Grammar of Modern Spanish John Butt, Carmen Benjamin, and Antonia Moreira Rodríguez, 6th Edition, although I’m pretty sure all of the editions are amazing. Definitely the best book on Spanish grammar in the English language that I have seen, but probably the best that exists period.", "created_utc": "1584206379.0", "edited": "False", "id": "fkhuu4v", "is_submitter": "False", "link_id": "t3_figp3c", "parent_id": "t3_figp3c", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Watching with subtitles is reading practice. If you want to make substantial listening progress you are going to have to train your ear with pure audio for hundreds of hours.", "created_utc": "1584176577.0", "edited": "False", "id": "fkgvnwq", "is_submitter": "False", "link_id": "t3_fid5xj", "parent_id": "t3_fid5xj", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "divertido = entertaining, amusing, enjoyable, fun\n\ngracioso/chistoso/cómico = funny, humorous\n\nI think the overlap happens with the word amusing which means funny and entertaining. So something amusing can be described as divertido. In English you can describe a person as funny and it can basically mean they are amusing/entertaining. Hence, you can describe a funny person as una persona divertida.\n\nEdit: dictionary entries\n\n [https://www.collinsdictionary.com/dictionary/spanish-english/divertido](https://www.collinsdictionary.com/dictionary/spanish-english/divertido)\n\n\\[*libro, película*\\] **entertaining**\n\n\\[*chiste, persona*\\] **funny** ⧫ **amusing**\n\n [https://www.merriam-webster.com/dictionary/funny](https://www.merriam-webster.com/dictionary/funny)\n\n **1a:** affording light mirth and laughter **:** [AMUSING](https://www.merriam-webster.com/dictionary/amusing) \n\n [https://www.lexico.com/en/definition/amusing](https://www.lexico.com/en/definition/amusing)  \n\nCausing laughter and providing entertainment.", "created_utc": "1584151629.0", "edited": "1584151823.0", "id": "fkg754g", "is_submitter": "False", "link_id": "t3_fi688i", "parent_id": "t3_fi688i", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Tienes toda la razón. Está mal escrita en mi libro de lingüística entonces, a menos que esta regla hubiera cambiado después de su publicación.", "created_utc": "1583979337.0", "edited": "False", "id": "fk9n53e", "is_submitter": "False", "link_id": "t3_fgqnia", "parent_id": "t1_fk9mr69", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "~~I just wanted to point out that it is \"tiíto\" with an accent.~~ I don't about the illo form.\n\nEdit: tiito is correct.", "created_utc": "1583954435.0", "edited": "1583979375.0", "id": "fk8e9sy", "is_submitter": "False", "link_id": "t3_fgqnia", "parent_id": "t3_fgqnia", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": ":(", "created_utc": "1583820557.0", "edited": "False", "id": "fk37het", "is_submitter": "False", "link_id": "t3_fg8zrh", "parent_id": "t1_fk371e0", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I think you mean occurrence.", "created_utc": "1583819994.0", "edited": "False", "id": "fk36yup", "is_submitter": "False", "link_id": "t3_fg8zrh", "parent_id": "t1_fk35zn7", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "From the same source, hacer(se) can be used with adjectives and nouns, whereas convertirse en is only used with nouns or an adjective with a very strongly implied noun attached. When they are both used with nouns the meaning is incredibly similar, but hacer(se) has the nuance of effort or intentionality on the part of the person changing, whereas convertirse en carries no such nuance. Se hizo doctor = He became a doctor (of his own doing). Se convirtió en doctor = He became a doctor (no additional info).", "created_utc": "1583790495.0", "edited": "False", "id": "fk20cum", "is_submitter": "False", "link_id": "t3_ffwjyr", "parent_id": "t1_fk1q977", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Poner(se) is used to express a change in state e.g. an emotional state. Hacer(se) expresses change e.g. from rich to poor, or atheist to Christian, etc. Hacer(se) cannot express a change in state. Your teacher is wrong. [Source](https://edisciplinas.usp.br/pluginfile.php/60031/mod_resource/content/3/Verbos%20de%20cambio%20Porroche%20T.pdf)", "created_utc": "1583780956.0", "edited": "False", "id": "fk1jjpr", "is_submitter": "False", "link_id": "t3_ffwjyr", "parent_id": "t1_fk16fxk", "score": "10", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I highly recommend the [Mass Immersion Approach](https://massimmersionapproach.com/about/). It's the fastest (although still very slow) way to get really good at a language. It is still in the early stage of being developed, but it has the most guidance for Japanese.", "created_utc": "1583636666.0", "edited": "False", "id": "fjw8y0p", "is_submitter": "False", "link_id": "t3_fezcnp", "parent_id": "t1_fjvzomp", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "It's a satirical post... lol", "created_utc": "1583354346.0", "edited": "False", "id": "fjhsor3", "is_submitter": "False", "link_id": "t3_fdiwp4", "parent_id": "t3_fdiwp4", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "You could be confident in conveying a very limited amount of thoughts and lack the massive vocab required to effortlessly understand native speech. I also doubt their speaking proficiency, however.", "created_utc": "1583301259.0", "edited": "False", "id": "fjfv8kr", "is_submitter": "False", "link_id": "t3_fcvgoz", "parent_id": "t1_fjdf570", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "You probably shouldn't memorize adverbs for the most part. You should learn them from context by seeing them in reading and hearing them in listening. Adverbs usually are very flexible and have tons of meanings that make them pretty unsuitable for isolated memorization. The best option would be to make sentence cards with the adverb and definition on the back. Take the sentences from your reading or listening.", "created_utc": "1583299658.0", "edited": "False", "id": "fjft9rf", "is_submitter": "False", "link_id": "t3_fd7i9f", "parent_id": "t3_fd7i9f", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I'm also trying to achieve a psuedo-native level in Spanish. I'm going to make a distinction between ability and competence. Ability is your actual performance of language activities like speaking, listening, writing, and to a lesser extent reading. Competence is your knowledge of the Spanish language, encompassing vocab, syntax, grammar, nuance, regionalisms, etc. Your ability is limited by your competence. Right now, your competence is too low because you aren't aware of the natural phrasings of native speakers. Practicing speaking is not going to be productive in this case because you would be practicing the language you know and not the natural language of natives.\n\nIn order to fix this you simply need more exposure to the language aka input. You need to read and listen a TON and pay attention to how native speakers form sentences. You need to notice what they say, how they say it, and in what exact situation/context they say it in. I would just consume as much Mexican and Spanish content as you can. Always be critical of yourself and try to verify that something is natural by hearing it used by multiple native speakers in a certain context. Nonnatives will pretty much always suck pretty bad compared to natives for a very long time.\n\nSi quieres perseguir un nivel tan alto, sugiero que aprendas sobre el [Mass Immersion Approach](https://massimmersionapproach.com/about/).\n\nRetroalimentación:\n\n* asunto > problema\n* comunicar > comunicarse\n\n>aunque con asuntos de entender en la parte de mí, a veces\n\n* Quizá \"aunque me cuesta entender a veces\".\n\n>me siento como si no hable como los nativos ni me expreso así tampoco\n\n* me siento como si no hablara como los nativos ni me expresara así tampoco\n* me quiero mejorar mi nivel > quiero mejorar mi nivel\n* hasta lo que sea como lo nativo > hasta que sea parecido al nativo\n* estudiante americano > estudiante estadounidense (en español suelen usar americano para referirse a lugareños de ambos continentes americanos)\n\nBuena suerte.", "created_utc": "1583298822.0", "edited": "1583299004.0", "id": "fjfs6ai", "is_submitter": "False", "link_id": "t3_fd6921", "parent_id": "t3_fd6921", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Tentatively, I want to say that it seems that it could be written with either. The imperfect denotes that the private tv's merely started arriving in 1990, but continued to arrive well into an unspecified future (without a definite end). The preterit would signify the arrival of the first private tv in Spain. Similarly, if this referred to a single object or let's say a person, then the preterit would be required because the arrival can only happen once. \n\n\"Y es que hace 30 años, en 1990, llegué a España para quedarme para siempre\".", "created_utc": "1583265667.0", "edited": "False", "id": "fje5kvq", "is_submitter": "False", "link_id": "t3_fczmhc", "parent_id": "t3_fczmhc", "score": "13", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I think it should be: \n\nLos estudios de seguimiento de áreas reforestadas no se han realizados de manera constante.\n\nConsistente is wrong here. It's a false cognate.", "created_utc": "1583005432.0", "edited": "False", "id": "fj4d09e", "is_submitter": "False", "link_id": "t3_fbfyoa", "parent_id": "t3_fbfyoa", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Oh I see how you got confused now. I was strictly referring to the present perfect example. That is not a past tense.\n\n> so the sentence could be “Mi novia me ha pedido que le presente a mis padres.” But as I’ve said before, the “technical” way that you’re supposed to say this is with the past imperfect subjunctive.\n\nThis is wrong. The present perfect in the first clause is not always followed by the imperfect subjunctive. It depends. Sometimes it is followed by the imperfect and sometimes by the present.\n\nThis actually turned out to be a lot more complex than I thought. Basically though, the rule of past main clause leading to a past subjunctive clause has exceptions. In addition, the present perfect is also exceptional in and of itself because it can act as a present or past clause.\n\nFollowing quotes are from the Nueva gramática de la lengua española (2010):\n> La forma he cantado —o bien canté en algunos países: § 23.4.1b— es irregular, ya que se agrupa en unos contextos con los tiempos de la esfera del presente y en otros con los de la esfera del pasado.\n\nAs for concord of tense, there are restrictive and nonrestrictive verbs. Restrictive verbs require (with some exceptions) that the following clause falls under a specific category of orientation. The 3 categories are prospective, simultaneous, and retrospective. [V1] denotes the first verb i.e. the main clause verb, and [V2] denotes the second verb, i.e. the subordinate clause verb. \n\n> 24.3.1d Ya en las sintaxis latinas se observa que algunas propiedades semánticas de V1 determinan de forma esencial la dependencia temporal de V2. En función de este criterio, los predicados verbales pueden ser RESTRICTIVOS o NO RESTRICTIVOS (§ 24.3.1g). \nLos predicados restrictivos orientan la interpretación temporal de sus complementos, a diferencia de los no restrictivos. Los primeros pueden ser de orientación prospectiva, retrospectiva y simultánea.\n\nVerbs that express judgement or assessment, such as \"reprochar, censurar, criticar, reprender, alabar, etc.\" are restrictive retrospective verbs. That is, they refer to a past action. For example, you generally praise somebody for something they DID and not something that they WILL DO, which doesn't make much sense. However, there are exceptions.\n\n> En efecto, la forma *abandone* (V2) en \"Le reprocharon duramente que abandone la empresa dentro de unos días y se vaya a trabajar a una multinacional.\" equivale a ‘vaya a abandonar’. Expresa, pues, una situación posterior a V1.\n\nNonrestrictive verbs are not bound by the past-present distinction. These include verbs that express emotions about something (sentir), verbs that communicate ideas (comunicar), and verbs that communicate thoughts (pensar, creer, etc.).\n\n>  La presencia en esta pauta de los factivos (§ 25.3.2) se debe a que las reacciones emotivas pueden ser independientes de la localización temporal de la situación que la provoca: Siento mucho que {haya tenido ~ tenga ~ tuviera ~ vaya a tener} problemas.\n\nAll of the choices in brackets are valid. In the Nueva gramática, options that aren't accepted are denoted with an *.", "created_utc": "1582885783.0", "edited": "False", "id": "fj02av8", "is_submitter": "False", "link_id": "t3_fakh0j", "parent_id": "t1_fizs8py", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I'm fairly certain this is wrong.\n\nIf they have asked you to introduce her in the future, then only the present subjunctive is used. If they have asked you to introduce her, and that time has passed, then the past subjunctive is always used.\n\nMi novia me ha pedido que le presente a mis padres esta noche.\n\nMi novia me ha pedido varias veces que le presentara a mis padres, pero siempre me negué.", "created_utc": "1582871727.0", "edited": "False", "id": "fizreh9", "is_submitter": "False", "link_id": "t3_fakh0j", "parent_id": "t1_fiz30gh", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Big props for the bravery to post these.\n\nPointers: careful with the \"v\" pronunciation. At the beginning of a word it is identical to an English \"b.\" In the middle of a word it is a softer b sound / β / in IPA.", "created_utc": "1582796689.0", "edited": "False", "id": "fiwphk9", "is_submitter": "False", "link_id": "t3_fa8s2i", "parent_id": "t3_fa8s2i", "score": "21", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "The [Mass Immersion Approach](https://massimmersionapproach.com/about/) will answer your questions.", "created_utc": "1582766667.0", "edited": "False", "id": "fivrvlr", "is_submitter": "False", "link_id": "t3_f9v2t2", "parent_id": "t3_f9v2t2", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "I really don't think you should have the mindset that you HAVE to go abroad to immerse. You can arguably get better listening and reading immersion from where you are. Spend the time you have to sit down and study on reading or watching shows without subtitles, and spend all your down time just listening to native Spanish. Listen to as much native speech as you can. You will always have those slight moments, whether walking, or driving, or just any breaks to listen to Spanish. Listen to podcasts or audiobooks for natives. You can replay it as much as you want, unlike conversations with natives abroad. You will quickly get your mind in Spanish mode again. Then when you go abroad you will be able to put into practice those listening skills and knowledge with natives and practice your speaking.\n\nEdit: Also use an SRS, ideally Anki, to study vocab.", "created_utc": "1582765319.0", "edited": "1582766777.0", "id": "fivppnz", "is_submitter": "False", "link_id": "t3_fa1wdo", "parent_id": "t3_fa1wdo", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Se puede que yo sepa, pero sugiero que descargues esto:\n\n[Reddit Enhancement Suite](https://chrome.google.com/webstore/detail/reddit-enhancement-suite/kbmfpngjjgdllneeigpgjifpgocmfgmb?hl=en-US)\n\nPuedes formatearlo a mano si sigues esta [guía](https://www.reddit.com/r/raerth/comments/cw70q/reddit_comment_formatting/?utm_source=amp&utm_medium=&utm_content=post_body), pero sería muy fastidioso.", "created_utc": "1582660403.0", "edited": "False", "id": "fira4kt", "is_submitter": "False", "link_id": "t3_f93kz3", "parent_id": "t1_fiq8o6z", "score": "1", "subreddit": "WriteStreakES", "subreddit_id": "t5_2eamt5"}, {"author": "tocayoinnominado", "body": "No hay de que. No sé con qué frecuencia, pero claro, de vez en cuando no debería ser un problema.", "created_utc": "1582615000.0", "edited": "False", "id": "fippa12", "is_submitter": "False", "link_id": "t3_f93kz3", "parent_id": "t1_fipmick", "score": "3", "subreddit": "WriteStreakES", "subreddit_id": "t5_2eamt5"}, {"author": "tocayoinnominado", "body": "Entiendo. Gracias por la respuesta.", "created_utc": "1582614781.0", "edited": "False", "id": "fipp3eq", "is_submitter": "False", "link_id": "t3_f8z7re", "parent_id": "t1_fipndee", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I don't know how difficult this site will be for you to understand, but it is the best resource if you actually want to get fairly good at Japanese. If you want to just be super casual or dabble, then it is not for you.\n\n[Mass Immersion Approach: Japanese Quickstart Guide](https://massimmersionapproach.com/table-of-contents/stage-1/jp-quickstart-guide/)", "created_utc": "1582614712.0", "edited": "False", "id": "fipp1bi", "is_submitter": "False", "link_id": "t3_f92m8n", "parent_id": "t3_f92m8n", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": ">para que mejoren su oído en español.\n\n¿En serio se lo puede decir así? A mí no me suena.", "created_utc": "1582603604.0", "edited": "False", "id": "fipd1x3", "is_submitter": "False", "link_id": "t3_f8z7re", "parent_id": "t3_f8z7re", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Hola!\n\nYo soy ~~un~~ mod aquí. Aprendo español por un ~~en~~ total de cuatro mese**s,** pero en tres años diferentes. La primera vez fue en enero de 2018, la segunda vez en enero de 201**9** y ahora la tercera vez desde~~s~~ enero. Ves el patró**n,** pero espero no volver a ~~renunciar~~ (rendirme / darme por vencido).\n\nAprendo español porque en 2012 visité Perú, y por ~~la~~ primera vez encontré (me di cuenta is probably better) que el español es hermoso. La gente era amigable y gentil allí. ~~Tuve un gran tiempo~~ Lo pasé muy bien ~~allí~~.\n\nTambién hay muchos latinos aquí. Espero que algún día pued**a** hablar con ellos sin dificultad y pienso que este subreddit es importante para es**e** **ob**jetivo. Entonces espero que este subreddit tenga éxito y te ayud**e** tanto como a mí.", "created_utc": "1582603101.0", "edited": "False", "id": "fipccqh", "is_submitter": "False", "link_id": "t3_f93kz3", "parent_id": "t3_f93kz3", "score": "4", "subreddit": "WriteStreakES", "subreddit_id": "t5_2eamt5"}, {"author": "tocayoinnominado", "body": "Prescriptively, I don't see how anything other than subjunctive can be used in this instance. As for regional or dialectal differences, I have no idea. Curious to see what the natives have to say.", "created_utc": "1582500582.0", "edited": "False", "id": "filfs8f", "is_submitter": "False", "link_id": "t3_f8h8dp", "parent_id": "t3_f8h8dp", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I've honestly never heard of this rule of thumb before. If it's actually used then it's probably the most egregious one of the entire series.", "created_utc": "1582447742.0", "edited": "False", "id": "fijh61x", "is_submitter": "False", "link_id": "t3_f86siz", "parent_id": "t3_f86siz", "score": "27", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "\"It is normally confined to literature and is now extremely rare in speech.\" - A New Reference Grammar of Modern Spanish, 6th Edition, Butt, Benjamin & Rodríguez\n\nIn my experience, I have literally never heard this spoken. I have seen it used in literature, although pretty rarely.", "created_utc": "1582344410.0", "edited": "False", "id": "fice0rq", "is_submitter": "False", "link_id": "t3_f7glwm", "parent_id": "t1_fibcu33", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "~~Just a slight correction: the dropping of that sound is actually called elision/elisión. Aspiration/aspiración refers to the puff of air that is released when pronouncing these words, which also often happens to coincide with the elision/elisión.~~\n\nEdit: This phenomenon is actually called debuccalization. Aspiration doesn't seem like the most apt term. Technically it is aspiration in the sense that the sound changes to the voiceless glottal fricative, which is often called the aspirate, and is indeed aspirated.", "created_utc": "1582256532.0", "edited": "1582266781.0", "id": "fi965te", "is_submitter": "False", "link_id": "t3_f74da3", "parent_id": "t1_fi92t0o", "score": "0", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Latinoamérica o América Latina son las opciones correctas.\n\nSí, es el español estándar. Es universal.", "created_utc": "1582146023.0", "edited": "False", "id": "fi4ps4r", "is_submitter": "False", "link_id": "t3_f62801", "parent_id": "t1_fi4mvmf", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Redundancy isn't necessarily a problem in Spanish, in fact it is often natural or required. That being said, the above should probably be: \"Recomiendo que te duermas.\" Dormirse = colloquial acostarse, so the te is part of the verb's meaning. The first te is unnecessary. Subject pronouns are ALWAYS omitted except for:\n\n1. Avoiding confusion because of a lack of context or conjugation ambiguity\n2. Emphasis (¡Pero yo no lo hice! = but **I** didn't do it!!)\n3. Making a contrasting statement (Mientras **tú** estabas en el sofá, **yo** estaba trabajando)", "created_utc": "1582104814.0", "edited": "False", "id": "fi37ju4", "is_submitter": "False", "link_id": "t3_f65qov", "parent_id": "t3_f65qov", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Conseguir + verb = to manage to do that verb\n\nConseguí llegar a tiempo = I managed to arrive on time.\n\nConseguí comunicarme con varios de los lugareños mientras estuve allí. = I managed to communicate with several of the locals while I was there.", "created_utc": "1582084598.0", "edited": "False", "id": "fi2oddc", "is_submitter": "False", "link_id": "t3_f62801", "parent_id": "t1_fi2865s", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Firstly, your tutor is mistaken. Both libre and exento can be translated as exempt.\n\nexempt: free from an obligation or liability imposed on others.\n\nFrom the DRAE:\n\n* libre |  **9.** adj. Exento, privilegiado, dispensado. *Estoy* *libre* *del* *voto.*\n* exento |  **1.** adj. Libre, desembarazado de algo. *Exento* *DE* *cuidados,* *DE* *temor.*\n\nFrom the Diccionario jurídico del español:\n\nTestigo exento = exempt witness\n\n* Testigo que no tiene la obligación de concurrir al llamamiento judicial\n* In English = Witness that does not have an obligation to appear in court\n\nSecondly, it definitely seems like more of a state to me. Exemptions seem like statuses that are more or less highly subject to change depending on the circumstances, and so lack a reasonable sense of permanence.", "created_utc": "1582058476.0", "edited": "False", "id": "fi1il7o", "is_submitter": "False", "link_id": "t3_f5wni5", "parent_id": "t3_f5wni5", "score": "4", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "To mention a few others:\n\nnada is frequently rendered as \"na\": para nada > pa ná\n\ntodo is frequently rendered as \"to\": todo bien > to bien", "created_utc": "1582052599.0", "edited": "False", "id": "fi189fb", "is_submitter": "False", "link_id": "t3_f5sncc", "parent_id": "t3_f5sncc", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Yeah, it 100% should be translated as loved.", "created_utc": "1582007358.0", "edited": "False", "id": "fhzq7xd", "is_submitter": "False", "link_id": "t3_f5ct1b", "parent_id": "t1_fhzoxba", "score": "7", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "~~It does not have that implication, in fact I think in the majority of cases it has the implication of \"and I still (would) want to.\"~~\n\nEdit: After further investigation it looks like that is not the case. Instead it looks like there are 3 cases:\n\nSiempre quise...\n\n1. I always wanted to (followed by completion of the desire)\n2. I always wanted to (but circumstances now prevent completion of the desire)\n3. I always wanted to (but now no longer have the desire)\n\nIn a roundabout way you could say they all boil down to the same case because when you complete you desire you no longer have it, and when you are unable to complete your desire then you give it up, but I think it is more useful to see them as separate possibilities. In cases where the desire is still alive, the \"siempre he querido\" is the construction used.", "created_utc": "1581998257.0", "edited": "1582017177.0", "id": "fhzfmmb", "is_submitter": "False", "link_id": "t3_f5ct1b", "parent_id": "t1_fhz8nus", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "You wrote quisiste, but you meant supiste.", "created_utc": "1581997871.0", "edited": "False", "id": "fhzf3ra", "is_submitter": "False", "link_id": "t3_f5ct1b", "parent_id": "t1_fhzdu6u", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "There is no such thing as \"Latin American Spanish.\" The vocabulary for slang, everyday items, idioms, and even pronouns and verb conjugations (vos) is going to vary. That being said, overall Spanish is extremely similar across all Spanish speaking communities in terms of most other areas of language. I don't think you should be so focused on learning one Spanish variety over another right now. You need to develop a foundation in the language, and become more specialized over time based on the content that you find enjoyable to consume. Put another way, you don't need to have a specific plan to learn Mexican Spanish vs Iberian Spanish. You just need to be focused on learning Spanish in general, and consume media/content/input from the country that you prefer.", "created_utc": "1581980875.0", "edited": "False", "id": "fhypi5e", "is_submitter": "False", "link_id": "t3_f5h3ax", "parent_id": "t3_f5h3ax", "score": "11", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "I agree with xarkstick, examen de apnea del sueño seems to be perfectly acceptable, but if you are going to ask it as a question perhaps:\n\n\"¿Me puede examinar/evaluar para apnea del sueño?\"", "created_utc": "1581980183.0", "edited": "False", "id": "fhyoer2", "is_submitter": "False", "link_id": "t3_f5c6om", "parent_id": "t3_f5c6om", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Translation and interpretation are separate skills in their own right. In order to translate well you have to study, train, and practice intentionally. Translating a novel at a B2-C1 level is going to be a tremendously difficult task, even for a C2 proficient speaker. Good translation requires intimate knowledge of orthography, writing skills, research skills, and creativity to find natural workarounds. In short, it is not something you can just pick up even though you may speak and understand the language at a high level.\n\n[Common misconceptions \\(English\\)](https://www.londontranslations.co.uk/translators/5-common-translation-myths-and-misconceptions/)\n\n[Common misconceptions \\(Spanish\\)](https://www.atanet.org/publications/getting_it_right_trans_sp.pdf)", "created_utc": "1581916556.0", "edited": "False", "id": "fhwi5eu", "is_submitter": "False", "link_id": "t3_f537g7", "parent_id": "t3_f537g7", "score": "9", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "First of all, I'm excited for you having begun your Spanish journey. However, learning a language to a high level, or even to level where you can easily understand native speech is no small task. In fact, it is a colossal one. There are no short cuts to getting good. You need to spend hundreds or thousands of hours listening to, reading in, and living and breathing the language. Native speech is too quick to work out on the fly. You have to be able to have instant recognition of the spoken words, on a subconscious level. In 5 months, that just isn't possible.\n\nSo what can you do? Well, you need to train your ears by listening to more native speech (from Mexico in this case). Even if you understand very little, you will gradually understand more and more. Your goal is not to understand what they are talking about at first, but merely to listen for and pick out the words that you do know. You also need to know way more words in general, so you will have to read a lot. Finally, you need to fine-tune your grammar knowledge by consulting the plethora of grammar focused content online every once in a while.\n\nIf you want to be better at listening to native speech, you need to practice listening to native speech. The brain is very adept at unconsciously acquiring language with enough exposure.", "created_utc": "1581798256.0", "edited": "False", "id": "fhq22u7", "is_submitter": "False", "link_id": "t3_f4cx8m", "parent_id": "t3_f4cx8m", "score": "6", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Lo he estudiado pero no \"sé\" el japonés. Tengo un nivel bajo. Asimismo, hablo inglés así que no tendría porqué recurrir a recursos en español. Dudo que haya muchos buenos recursos para el hispanohablante. A decir verdad, a lo mejor te serviría aprender lo suficiente del inglés para entender y traducir los recursos.", "created_utc": "1581791999.0", "edited": "False", "id": "fhplr5z", "is_submitter": "False", "link_id": "t3_f3xqsh", "parent_id": "t1_fhoh5xb", "score": "1", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "You have to be careful sometimes because these terms can be specific jargon in a field. Target language in the translation world means the language that one is translating to, which is \"lengua meta.\" Target language in the sense of the language that one is studying I believe would just be \"la lengua que aprendo/estudio.\" As far as I know, there is no specific term or phrase used.", "created_utc": "1581791203.0", "edited": "1581798390.0", "id": "fhpk4sh", "is_submitter": "False", "link_id": "t3_f4bkl2", "parent_id": "t3_f4bkl2", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Si quieres llegar a un nivel alto de japonés, recomiendo encarecidamente el [Mass Immersion Approach](https://massimmersionapproach.com/table-of-contents/stage-1/). Por la parte de abajo hay un *quickstart guide*. Si no estás segura si quieres entregarte al idioma, nomás aprende los alfabetos y usa Duolingo o LingoDeer para empezar. Esas aplicaciones no te van a dar ni siquiera un nivel intermedio. Solo son para mojarse los pies.", "created_utc": "1581712927.0", "edited": "1581718623.0", "id": "fhmhn80", "is_submitter": "False", "link_id": "t3_f3xqsh", "parent_id": "t3_f3xqsh", "score": "4", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "Dialectical is for dialectics.\n\ndialectic\n1. the art of investigating or discussing the truth of opinions.\n2. inquiry into metaphysical contradictions and their solutions.", "created_utc": "1581668907.0", "edited": "False", "id": "fhk6cru", "is_submitter": "False", "link_id": "t3_f38rn5", "parent_id": "t1_fhk225f", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "This is very pedantic of me, so apologies, but the word is dialectal for dialects and not dialectical.", "created_utc": "1581633218.0", "edited": "False", "id": "fhiwh5c", "is_submitter": "False", "link_id": "t3_f38rn5", "parent_id": "t1_fhifk7a", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Aprecio mucho la respuesta. No pensaba en su uso como adverbio en este contexto.", "created_utc": "1581622662.0", "edited": "False", "id": "fhidkp4", "is_submitter": "True", "link_id": "t3_f371bm", "parent_id": "t1_fhh6ay4", "score": "1", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "Ah perfecto. ¡Aprecio mucho la información!", "created_utc": "1581622306.0", "edited": "False", "id": "fhicxch", "is_submitter": "True", "link_id": "t3_f371bm", "parent_id": "t1_fhh1rc7", "score": "2", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}, {"author": "tocayoinnominado", "body": "What an amazing post. This is something that has been bothering me since I started studying Cantonese. Listening to my native speaker friends, I was almost sure it was a Z2 sound in  早, but I chalked it up to my limited exposure to the language.", "created_utc": "1581533065.0", "edited": "False", "id": "fhezg6k", "is_submitter": "False", "link_id": "t3_etox0d", "parent_id": "t1_ffywjis", "score": "2", "subreddit": "Cantonese", "subreddit_id": "t5_2wxkd"}, {"author": "tocayoinnominado", "body": "It's not accurate. First of all it doesn't even take speaking or writing into account. Also, it's way too brief. You would need to sign up for an actual comprehensive exam that tests on the CEFR scale to be sure. I would absolutely just take that result with a very fine grain of salt.", "created_utc": "1581477399.0", "edited": "False", "id": "fhd4ylj", "is_submitter": "False", "link_id": "t3_f2k1x8", "parent_id": "t3_f2k1x8", "score": "3", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "3 months is very little time. Listening comprehension is a very long process. I highly suggest you do some more Spain specific listening even if it's more challenging. You want to be able to understand native speech in Spain, so what you need to do is start listening to native speech in Spain. I would try listening to podcasts and watching tv series from Spain. Listen as much as you can. Your goal is not to understand everything. That will be impossible at this point. Your goal is to try to notice the words that you do know, and pick up new words that you hear over and over. Try watching without subtitles, but if it's too boring/frustrating then try with English subtitles and read the subs as fast as you can for context and then just focus on the speech.", "created_utc": "1581141414.0", "edited": "False", "id": "fgv9jew", "is_submitter": "False", "link_id": "t3_f0ih83", "parent_id": "t3_f0ih83", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "First of all, I think it's really easy to fall into the trap of \"I've been studying X language for Y amount of time, so I must be pretty good now or intermediate or advanced or what have you. In reality, the number of classes you have taken or the number of years that have passed while you have been studying the language on or off are not relevant. The time spent actively engaging with the language is what matters. That raw hour count is going to be much more indicative of one's level.\n\nOne of the most frequent misconceptions I also see is over-estimating how good 80-95% comprehension is. As demonstrated [here](https://www.sinosplice.com/life/archives/2016/08/25/what-80-comprehension-feels-like), 80% comprehension would be immensely frustrating and hard to follow. 95% is still far from desirable, but one can have a strong idea of what is generally happening, while missing a lot of details.\n\nWhat is the best way to become fluent? Well, I believe in the [Mass Immersion Approach](https://massimmersionapproach.com/table-of-contents/). In a nutshell, you consume a ton of native input. Listening should take priority over reading, but you do a ton of both, you should limit speaking until you are very advanced (can hear subtleties in pronunciation and have an intuition for what is right and wrong), and you should use SRS to learn vocab (making sentence cards with 1 unknown word in the sentence). If you do this for hundreds of hours, while actively paying attention to the language and trying to notice new things, you are basically guaranteed to become incredibly proficient.", "created_utc": "1581100464.0", "edited": "False", "id": "fgt781k", "is_submitter": "False", "link_id": "t3_f0c8kw", "parent_id": "t3_f0c8kw", "score": "2", "subreddit": "languagelearning", "subreddit_id": "t5_2rjsc"}, {"author": "tocayoinnominado", "body": "If she doesn't even pronounce the b's or v's right, I'm virtually certain she does not even come close to perfect pronunciation. What you're suffering from is basically a fluency illusion. You aren't good enough to perceive her mistakes, except for the b/v's, so she will sound perfect to you other than that. As you improve, I'm sure you will notice more and more flaws.  [https://massimmersionapproach.com/table-of-contents/stage-1/theory/the-fluency-illusion/](https://massimmersionapproach.com/table-of-contents/stage-1/theory/the-fluency-illusion/)  Also, the b/v at the beginning of the word is equivalent to an English b, but in the middle of words it is a softer b sound / β / in IPA.", "created_utc": "1581014756.0", "edited": "False", "id": "fgpz2uj", "is_submitter": "False", "link_id": "t3_ezejiv", "parent_id": "t1_fgo3y6o", "score": "3", "subreddit": "Spanish", "subreddit_id": "t5_2qtt1"}]